#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_TGF_ItemAnimLayers_Base_3rd_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_AnimGraph");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_AnimGraph) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_AnimGraph");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.BlueprintThreadSafeUpdateAnimation
// 0x0020 (0x0020 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateLeftRightRate_DeltaTime_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateSpineRotator_DeltaTime_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateMoveSpeed_DeltaTime_ImplicitCast;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation) == 0x000020, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation, CallFunc_UpdateLeftRightRate_DeltaTime_ImplicitCast) == 0x000008, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation::CallFunc_UpdateLeftRightRate_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation, CallFunc_UpdateSpineRotator_DeltaTime_ImplicitCast) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation::CallFunc_UpdateSpineRotator_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation, CallFunc_UpdateMoveSpeed_DeltaTime_ImplicitCast) == 0x000018, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintThreadSafeUpdateAnimation::CallFunc_UpdateMoveSpeed_DeltaTime_ImplicitCast' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.EvaluateDeathAnimation
// 0x0060 (0x0060 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UAnimSequenceBase*                      CallFunc_SelectDeathAnimationInternal_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequenceEvaluatorReference            CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequenceEvaluatorPure_Result;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSequenceEvaluatorReference            CallFunc_SetSequence_ReturnValue;                  // 0x0040(0x0010)(NoDestructor)
	struct FSequenceEvaluatorReference            CallFunc_SetExplicitTime_ReturnValue;              // 0x0050(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation) == 0x000060, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, Context) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::Context' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, Node) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::Node' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, CallFunc_SelectDeathAnimationInternal_ReturnValue) == 0x000020, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::CallFunc_SelectDeathAnimationInternal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator) == 0x000028, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, CallFunc_ConvertToSequenceEvaluatorPure_Result) == 0x000038, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::CallFunc_ConvertToSequenceEvaluatorPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, CallFunc_GetPlayLength_ReturnValue) == 0x00003C, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, CallFunc_SetSequence_ReturnValue) == 0x000040, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::CallFunc_SetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation, CallFunc_SetExplicitTime_ReturnValue) == 0x000050, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_EvaluateDeathAnimation::CallFunc_SetExplicitTime_ReturnValue' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2
// 0x02A8 (0x02A8 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_3;      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_4;      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_5;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_6;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_7;      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_8;      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetIdleBlendTime_TrueValue;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetIdleBlendTime_FalseValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValueWithDefault_OutValue;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurveValueWithDefault_ReturnValue;     // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_TGF_Character_Base_C*              CallFunc_GetOwningAnimInstance_ReturnValue_9;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetIdleBlendTime_TrueValue_1;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetIdleBlendTime_FalseValue_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_TGF_Character_Base_C*              K2Node_DynamicCast_AsABP_TGF_Character_Base;       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRaceAvatarData_HeightOffset;           // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTgfRaceAvatarBodyModifyData           CallFunc_GetRaceAvatarData_ReturnValue;            // 0x0118(0x0168)(ConstParm, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast;              // 0x0284(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_1;            // 0x0288(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_2;            // 0x028C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_3;            // 0x0290(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_4;            // 0x0294(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_5;            // 0x0298(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_6;            // 0x029C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Set_Item_ImplicitCast_7;            // 0x02A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2) == 0x0002A8, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, EntryPoint) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, Temp_bool_Variable) == 0x000004, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue) == 0x000008, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_1) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, Temp_real_Variable) == 0x000020, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_2) == 0x000028, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_3) == 0x000030, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, Temp_real_Variable_1) == 0x000038, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_4) == 0x000040, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_5) == 0x000050, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_6) == 0x000058, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_7) == 0x000068, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_BooleanOR_ReturnValue_1) == 0x000070, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_8) == 0x000078, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_SelectFloat_ReturnValue) == 0x000080, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000088, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_FClamp_ReturnValue) == 0x000090, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetIdleBlendTime_TrueValue) == 0x000098, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetIdleBlendTime_TrueValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetIdleBlendTime_FalseValue) == 0x0000A0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetIdleBlendTime_FalseValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetCurveValueWithDefault_OutValue) == 0x0000A8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetCurveValueWithDefault_OutValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetCurveValueWithDefault_ReturnValue) == 0x0000AC, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetCurveValueWithDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningAnimInstance_ReturnValue_9) == 0x0000B0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningAnimInstance_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetIdleBlendTime_TrueValue_1) == 0x0000B8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetIdleBlendTime_TrueValue_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetIdleBlendTime_FalseValue_1) == 0x0000C0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetIdleBlendTime_FalseValue_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetOwningComponent_ReturnValue) == 0x0000D0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, K2Node_Select_Default) == 0x0000D8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetAnimInstance_ReturnValue) == 0x0000E0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, K2Node_DynamicCast_AsABP_TGF_Character_Base) == 0x0000E8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::K2Node_DynamicCast_AsABP_TGF_Character_Base' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000F8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000100, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, K2Node_DynamicCast_AsLyra_Character) == 0x000108, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetRaceAvatarData_HeightOffset) == 0x000114, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetRaceAvatarData_HeightOffset' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_GetRaceAvatarData_ReturnValue) == 0x000118, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_GetRaceAvatarData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, K2Node_Event_DeltaTimeX) == 0x000280, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast) == 0x000284, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast_1) == 0x000288, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast_2) == 0x00028C, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast_3) == 0x000290, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast_4) == 0x000294, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast_5) == 0x000298, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast_6) == 0x00029C, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2, CallFunc_Array_Set_Item_ImplicitCast_7) == 0x0002A0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_ExecuteUbergraph_ABP_TGF_ItemAnimLayers_Base_3rd_V2::CallFunc_Array_Set_Item_ImplicitCast_7' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_Additive
// 0x0020 (0x0020 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_FullBody_Additive;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive) == 0x000020, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive, BasePose) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive::BasePose' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive, Param_FullBody_Additive) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Additive::Param_FullBody_Additive' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_Aiming
// 0x0030 (0x0030 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Param_AimPitch;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_AimYaw;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              Param_FullBody_Aiming;                             // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming) == 0x000030, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming, InPose) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming::InPose' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming, Param_AimPitch) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming::Param_AimPitch' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming, Param_AimYaw) == 0x000018, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming::Param_AimYaw' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming, Param_FullBody_Aiming) == 0x000020, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_Aiming::Param_FullBody_Aiming' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_ApexState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_ApexState final
{
public:
	struct FPoseLink                              Param_FullBody_ApexState;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_ApexState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_ApexState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_ApexState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_ApexState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_ApexState, Param_FullBody_ApexState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_ApexState::Param_FullBody_ApexState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_CrouchingEndState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingEndState final
{
public:
	struct FPoseLink                              Param_FullBody_CrouchingEndState;                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingEndState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingEndState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingEndState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingEndState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingEndState, Param_FullBody_CrouchingEndState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingEndState::Param_FullBody_CrouchingEndState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_CrouchingIdleState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingIdleState final
{
public:
	struct FPoseLink                              Param_FullBody_CrouchingIdleState;                 // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingIdleState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingIdleState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingIdleState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingIdleState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingIdleState, Param_FullBody_CrouchingIdleState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingIdleState::Param_FullBody_CrouchingIdleState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_CrouchingStartState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingStartState final
{
public:
	struct FPoseLink                              Param_FullBody_CrouchingStartState;                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingStartState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingStartState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingStartState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingStartState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingStartState, Param_FullBody_CrouchingStartState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_CrouchingStartState::Param_FullBody_CrouchingStartState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_DeathLayer
// 0x0028 (0x0028 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer final
{
public:
	struct FPoseLink                              NormalPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Param_bDeath;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Param_FullBody_DeathLayer;                         // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer) == 0x000028, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer, NormalPose) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer::NormalPose' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer, Param_bDeath) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer::Param_bDeath' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer, Param_FullBody_DeathLayer) == 0x000018, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_DeathLayer::Param_FullBody_DeathLayer' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_FallState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_FallState final
{
public:
	struct FPoseLink                              Param_FullBody_FallState;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_FallState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_FallState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_FallState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_FallState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_FallState, Param_FullBody_FallState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_FallState::Param_FullBody_FallState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_IdleState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_IdleState final
{
public:
	struct FPoseLink                              Param_FullBody_IdleState;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_IdleState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_IdleState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_IdleState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_IdleState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_IdleState, Param_FullBody_IdleState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_IdleState::Param_FullBody_IdleState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_JumpStartState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_JumpStartState final
{
public:
	struct FPoseLink                              Param_FullBody_JumpStartState;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_JumpStartState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_JumpStartState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_JumpStartState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_JumpStartState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_JumpStartState, Param_FullBody_JumpStartState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_JumpStartState::Param_FullBody_JumpStartState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_LandState
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LandState final
{
public:
	struct FPoseLink                              Param_FullBody_LandState;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LandState) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LandState");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LandState) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LandState");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LandState, Param_FullBody_LandState) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LandState::Param_FullBody_LandState' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_LegIK
// 0x0020 (0x0020 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK final
{
public:
	struct FPoseLink                              InFKPose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_FullBody_LegIK;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK) == 0x000020, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK, InFKPose) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK::InFKPose' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK, Param_FullBody_LegIK) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_LegIK::Param_FullBody_LegIK' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.FullBody_PostProcess
// 0x0020 (0x0020 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess final
{
public:
	struct FPoseLink                              FullBodyPose;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_FullBody_PostProcess;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess) == 0x000020, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess, FullBodyPose) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess::FullBodyPose' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess, Param_FullBody_PostProcess) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_FullBody_PostProcess::Param_FullBody_PostProcess' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.GetIdleBlendTime
// 0x0010 (0x0010 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime final
{
public:
	double                                        TrueValue;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FalseValue;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime) == 0x000010, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime, TrueValue) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime::TrueValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime, FalseValue) == 0x000008, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetIdleBlendTime::FalseValue' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.GetOwningAnimInstance
// 0x0018 (0x0018 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance final
{
public:
	class UABP_TGF_Character_Base_C*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UABP_TGF_Character_Base_C*              K2Node_DynamicCast_AsABP_TGF_Character_Base;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance) == 0x000018, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance, ReturnValue) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance, K2Node_DynamicCast_AsABP_TGF_Character_Base) == 0x000008, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance::K2Node_DynamicCast_AsABP_TGF_Character_Base' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_GetOwningAnimInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.LowerBodyUpperBodySplit
// 0x0050 (0x0050 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit final
{
public:
	struct FPoseLink                              InBaseLocomition;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InBaseUpperBodyMontage;                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InAdditivePose;                                    // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              DefaultAdditive;                                   // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_LowerBodyUpperBodySplit;                     // 0x0040(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit) == 0x000050, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit, InBaseLocomition) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit::InBaseLocomition' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit, InBaseUpperBodyMontage) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit::InBaseUpperBodyMontage' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit, InAdditivePose) == 0x000020, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit::InAdditivePose' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit, DefaultAdditive) == 0x000030, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit::DefaultAdditive' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit, Param_LowerBodyUpperBodySplit) == 0x000040, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_LowerBodyUpperBodySplit::Param_LowerBodyUpperBodySplit' has a wrong offset!");

// Function ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.SelectDeathAnimation
// 0x0050 (0x0050 - 0x0000)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UAnimSequenceBase*                      CallFunc_SelectDeathAnimationInternal_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_SetSequenceWithInertialBlending_ReturnValue; // 0x0040(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation) == 0x000050, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation, Context) == 0x000000, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation::Context' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation, Node) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation::Node' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation, CallFunc_SelectDeathAnimationInternal_ReturnValue) == 0x000020, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation::CallFunc_SelectDeathAnimationInternal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000028, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2_C_SelectDeathAnimation::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
