#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SceneCapture_Character

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_SceneCapture_Character.ABP_SceneCapture_Character_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_44;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_45;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_46;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_47;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_48;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_49;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_50;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_51;                               // 0x003C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_52;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_53;                                 // 0x006C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_54;                                 // 0x006D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_55;                                 // 0x006E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_56;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_57;                               // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x000004, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __BoolProperty_44) == 0x00000C, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__BoolProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __BlendProfile_45) == 0x000010, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__BlendProfile_45' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __CurveFloat_46) == 0x000018, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__CurveFloat_46' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __EnumProperty_47) == 0x000020, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__EnumProperty_47' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __EnumProperty_48) == 0x000021, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__EnumProperty_48' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __ArrayProperty_49) == 0x000028, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__ArrayProperty_49' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __FloatProperty_50) == 0x000038, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__FloatProperty_50' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __StructProperty_51) == 0x00003C, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__StructProperty_51' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __FloatProperty_52) == 0x000068, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__FloatProperty_52' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __BoolProperty_53) == 0x00006C, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__BoolProperty_53' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __EnumProperty_54) == 0x00006D, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__EnumProperty_54' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __ByteProperty_55) == 0x00006E, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__ByteProperty_55' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __NameProperty_56) == 0x000070, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__NameProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, __StructProperty_57) == 0x000078, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::__StructProperty_57' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_SceneCapture_Character.ABP_SceneCapture_Character_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_SceneCapture_Character::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_SceneCapture_Character::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_SceneCapture_Character::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_SceneCapture_Character::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_SceneCapture_Character::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

