#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_TGF_ItemAnimLayers_Base_3rd_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.AnimBlueprintGeneratedConstantData
// 0x02C7 (0x02C8 - 0x0001)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3207;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_3208;                             // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           __ByteProperty_3209;                               // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3210;                               // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_3211;                             // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_3212;                               // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_3213;                              // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3214;                               // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3215;                               // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3216;                               // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3217;                               // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3218;                               // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3219;                               // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3220;                              // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3221;                               // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3222;                               // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_3223;                               // 0x00BC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_3224;                               // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3225;                                // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3226;                               // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3227;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3228;                               // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_3229;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3230;                              // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_3231;                              // 0x00F8(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_3232;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_3233;                              // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_3234;                               // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3235;                               // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3236;                               // 0x0130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3237;                               // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3238;                               // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_3239;                               // 0x0148(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_3240;                               // 0x0149(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3241;                              // 0x0150(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_3242;                               // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_3243;                                 // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_3244;                               // 0x0170(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_3245;                               // 0x0171(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_3246;                              // 0x0178(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_3247;                              // 0x0188(0x0010)(BlueprintVisible)
	float                                         __FloatProperty_3248;                              // 0x0198(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3249;                               // 0x019C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3250;                              // 0x01A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_3251;                             // 0x01A4(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_3252;                              // 0x01D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3253;                              // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3254;                               // 0x01D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_3255;                               // 0x01D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_3256;                               // 0x01DA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DB[0x5];                                      // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_3257;                             // 0x01E0(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_3258;                               // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_3259;                               // 0x0208(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0210(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x0290(0x0008)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0298(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02B0(0x0018)()
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData) == 0x0002C8, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3207) == 0x000004, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3207' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __StructProperty_3208) == 0x000010, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__StructProperty_3208' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ByteProperty_3209) == 0x000030, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ByteProperty_3209' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3210) == 0x000034, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3210' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __StructProperty_3211) == 0x000040, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__StructProperty_3211' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3212) == 0x000060, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3212' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3213) == 0x000068, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3213' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3214) == 0x000078, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3214' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3215) == 0x000080, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3215' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3216) == 0x000088, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3216' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3217) == 0x000090, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3217' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3218) == 0x000098, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3218' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3219) == 0x0000A0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3219' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __FloatProperty_3220) == 0x0000A8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__FloatProperty_3220' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3221) == 0x0000AC, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3221' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3222) == 0x0000B4, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3222' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ByteProperty_3223) == 0x0000BC, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ByteProperty_3223' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3224) == 0x0000C0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3224' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __IntProperty_3225) == 0x0000C8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__IntProperty_3225' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3226) == 0x0000CC, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3226' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __IntProperty_3227) == 0x0000D4, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__IntProperty_3227' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3228) == 0x0000D8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3228' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __IntProperty_3229) == 0x0000E0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__IntProperty_3229' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3230) == 0x0000E8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3230' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3231) == 0x0000F8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3231' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3232) == 0x000108, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3232' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3233) == 0x000110, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3233' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3234) == 0x000120, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3234' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3235) == 0x000128, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3235' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3236) == 0x000130, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3236' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3237) == 0x000138, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3237' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3238) == 0x000140, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3238' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __EnumProperty_3239) == 0x000148, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__EnumProperty_3239' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __EnumProperty_3240) == 0x000149, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__EnumProperty_3240' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3241) == 0x000150, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3241' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __BlendProfile_3242) == 0x000160, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__BlendProfile_3242' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __CurveFloat_3243) == 0x000168, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__CurveFloat_3243' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __EnumProperty_3244) == 0x000170, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__EnumProperty_3244' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __EnumProperty_3245) == 0x000171, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__EnumProperty_3245' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3246) == 0x000178, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3246' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ArrayProperty_3247) == 0x000188, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ArrayProperty_3247' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __FloatProperty_3248) == 0x000198, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__FloatProperty_3248' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __BoolProperty_3249) == 0x00019C, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__BoolProperty_3249' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __FloatProperty_3250) == 0x0001A0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__FloatProperty_3250' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __StructProperty_3251) == 0x0001A4, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__StructProperty_3251' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __FloatProperty_3252) == 0x0001D0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__FloatProperty_3252' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __FloatProperty_3253) == 0x0001D4, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__FloatProperty_3253' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __BoolProperty_3254) == 0x0001D8, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__BoolProperty_3254' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __EnumProperty_3255) == 0x0001D9, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__EnumProperty_3255' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __ByteProperty_3256) == 0x0001DA, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__ByteProperty_3256' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __StructProperty_3257) == 0x0001E0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__StructProperty_3257' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3258) == 0x000200, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3258' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, __NameProperty_3259) == 0x000208, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::__NameProperty_3259' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000210, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x000290, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000298, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002B0, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_TGF_ItemAnimLayers_Base_3rd_V2.ABP_TGF_ItemAnimLayers_Base_3rd_V2_C.AnimBlueprintGeneratedMutableData
// 0x007F (0x0080 - 0x0001)
struct ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_1;                              // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_4;                                  // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_6;                                 // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_7;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_10;                                 // 0x002B(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_11;                                // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_12;                                 // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0041(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0042(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0043(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_16;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_18;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_20;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_21;                                // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_22;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_23;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_24;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_26;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_27;                                 // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x0066(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_29;                                 // 0x0067(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_30;                                // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_31;                                 // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_32;                                 // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_33;                                 // 0x007A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData) == 0x000080, "Wrong size on ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'ABP_TGF_ItemAnimLayers_Base_3rd_V2::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
