#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SceneCapture_Character_Panther

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_SceneCapture_Character_Panther.ABP_SceneCapture_Character_Panther_C.AnimBlueprintGeneratedConstantData
// 0x010F (0x0110 - 0x0001)
struct ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_7;                                  // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_8;                                // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_9;                                  // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_10;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_11;                               // 0x0038(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_12;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_14;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_15;                                 // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_16;                                 // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0078(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00F8(0x0018)()
};
static_assert(alignof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData) == 0x000110, "Wrong size on ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __NameProperty_7) == 0x000004, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__NameProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __StructProperty_8) == 0x000010, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__StructProperty_8' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __BoolProperty_9) == 0x000030, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__BoolProperty_9' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __FloatProperty_10) == 0x000034, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __StructProperty_11) == 0x000038, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__StructProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __FloatProperty_12) == 0x000064, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __BoolProperty_13) == 0x000068, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__BoolProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __EnumProperty_14) == 0x000069, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__EnumProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __ByteProperty_15) == 0x00006A, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__ByteProperty_15' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, __NameProperty_16) == 0x00006C, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::__NameProperty_16' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000078, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000F8, "Member 'ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_SceneCapture_Character_Panther.ABP_SceneCapture_Character_Panther_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on ABP_SceneCapture_Character_Panther::FAnimBlueprintGeneratedMutableData");

}

