#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_TGF_Character_Base

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_TGF_Character_Base.ABP_TGF_Character_Base_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_324;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_325;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_326;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_327;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_328;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_329;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_330;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_331;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_332;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_333;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_334;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_335;                                // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_336;                                // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_337;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_338;                                // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_339;                               // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_340;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_341;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_342;                                 // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_343;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_344;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_345;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_346;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_347;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_348;                                 // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_349;                                // 0x00CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_350;                                 // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_351;                                // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_352;                                 // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_353;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_354;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_355;                                 // 0x00F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_356;                                // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_357;                                  // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_358;                                // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_359;                                // 0x0109(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_360;                                // 0x010A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_361;                               // 0x0110(0x0010)(BlueprintVisible, EditFixedSize)
	ERefPoseType                                  __ByteProperty_362;                                // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_363;                              // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_324) == 0x000004, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_324' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_325) == 0x00000C, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_325' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_326) == 0x000014, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_326' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_327) == 0x00001C, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_327' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_328) == 0x000024, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_328' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_329) == 0x00002C, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_329' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_330) == 0x000034, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_330' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_331) == 0x00003C, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_331' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_332) == 0x000044, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_332' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_333) == 0x00004C, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_333' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_334) == 0x000054, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_334' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_335) == 0x00005C, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_335' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_336) == 0x000064, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_336' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_337) == 0x00006C, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_337' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_338) == 0x000074, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_338' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __ArrayProperty_339) == 0x000080, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__ArrayProperty_339' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_340) == 0x000090, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_340' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_341) == 0x000098, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_341' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __IntProperty_342) == 0x0000A0, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__IntProperty_342' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_343) == 0x0000A4, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_343' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __IntProperty_344) == 0x0000AC, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__IntProperty_344' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_345) == 0x0000B0, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_345' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_346) == 0x0000B8, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_346' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_347) == 0x0000C0, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_347' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __IntProperty_348) == 0x0000C8, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__IntProperty_348' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_349) == 0x0000CC, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_349' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __IntProperty_350) == 0x0000D4, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__IntProperty_350' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_351) == 0x0000D8, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_351' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __IntProperty_352) == 0x0000E0, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__IntProperty_352' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_353) == 0x0000E4, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_353' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __NameProperty_354) == 0x0000EC, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__NameProperty_354' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __IntProperty_355) == 0x0000F4, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__IntProperty_355' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __BlendProfile_356) == 0x0000F8, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__BlendProfile_356' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __CurveFloat_357) == 0x000100, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__CurveFloat_357' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __BoolProperty_358) == 0x000108, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__BoolProperty_358' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __EnumProperty_359) == 0x000109, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__EnumProperty_359' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __EnumProperty_360) == 0x00010A, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__EnumProperty_360' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __ArrayProperty_361) == 0x000110, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__ArrayProperty_361' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __ByteProperty_362) == 0x000120, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__ByteProperty_362' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, __StructProperty_363) == 0x000128, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::__StructProperty_363' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_TGF_Character_Base.ABP_TGF_Character_Base_C.AnimBlueprintGeneratedMutableData
// 0x0002 (0x0003 - 0x0001)
struct ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData) == 0x000003, "Wrong size on ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_TGF_Character_Base::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");

}

