#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIC_Monster_Default

#include "Basic.hpp"

#include "TGF_FAbilitySelectorAlternativeEntry_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TGF_FAbilityTargetAlternateEntry_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "TGF_FAbilitySelectorEntry_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterBoss
// 0x0020 (0x0020 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterBoss final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterBoss) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterBoss");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterBoss) == 0x000020, "Wrong size on AIC_Monster_Default_C_AbilityFilterBoss");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterBoss, Result) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterBoss::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterBoss, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'AIC_Monster_Default_C_AbilityFilterBoss::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterBoss, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterBoss::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterBoss, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AIC_Monster_Default_C_AbilityFilterBoss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterBoss, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'AIC_Monster_Default_C_AbilityFilterBoss::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterEnemyBehind
// 0x00D8 (0x00D8 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterEnemyBehind final
{
public:
	TArray<int32>                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_RangeQueryActors_Actors;                  // 0x0020(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostile_Result;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngleBetweenTwoVectors_ReturnValue;    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RangeQueryActors_Range_ImplicitCast;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterEnemyBehind) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterEnemyBehind");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterEnemyBehind) == 0x0000D8, "Wrong size on AIC_Monster_Default_C_AbilityFilterEnemyBehind");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, Args) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::Args' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, Result) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, Temp_int_Array_Index_Variable) == 0x000014, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_SafeGetArg_Arg) == 0x000018, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_SafeGetArg_Arg' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_RangeQueryActors_Actors) == 0x000020, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_RangeQueryActors_Actors' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Array_Get_Item) == 0x000030, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_IsHostile_Result) == 0x00003C, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_IsHostile_Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_K2_GetPawn_ReturnValue) == 0x000068, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000A8, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_GetAngleBetweenTwoVectors_ReturnValue) == 0x0000C0, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_GetAngleBetweenTwoVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000C4, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_RangeQueryActors_Range_ImplicitCast) == 0x0000C8, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_RangeQueryActors_Range_ImplicitCast' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterEnemyBehind, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000D0, "Member 'AIC_Monster_Default_C_AbilityFilterEnemyBehind::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterFriendlyCount
// 0x0078 (0x0078 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterFriendlyCount final
{
public:
	TArray<int32>                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_RangeQueryActors_Actors;                  // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostile_Result;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SafeGetArg_Arg_1;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg_2;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RangeQueryActors_Range_ImplicitCast;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterFriendlyCount) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterFriendlyCount");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterFriendlyCount) == 0x000078, "Wrong size on AIC_Monster_Default_C_AbilityFilterFriendlyCount");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, Args) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::Args' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, Result) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, Count) == 0x000014, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::Count' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_SafeGetArg_Arg) == 0x00001C, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_SafeGetArg_Arg' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000024, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_RangeQueryActors_Actors) == 0x000028, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_RangeQueryActors_Actors' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, Temp_int_Array_Index_Variable) == 0x000040, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Array_Get_Item) == 0x000048, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_IsHostile_Result) == 0x000050, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_IsHostile_Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_SafeGetArg_Arg_1) == 0x000054, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_SafeGetArg_Arg_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_SafeGetArg_Arg_2) == 0x000058, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_SafeGetArg_Arg_2' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, Temp_int_Variable) == 0x00005C, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterFriendlyCount, CallFunc_RangeQueryActors_Range_ImplicitCast) == 0x000070, "Member 'AIC_Monster_Default_C_AbilityFilterFriendlyCount::CallFunc_RangeQueryActors_Range_ImplicitCast' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterHealthHigh
// 0x0050 (0x0050 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterHealthHigh final
{
public:
	TArray<int32>                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetHealthPercent_Result;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterHealthHigh) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterHealthHigh");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterHealthHigh) == 0x000050, "Wrong size on AIC_Monster_Default_C_AbilityFilterHealthHigh");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, Args) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::Args' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, Result) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, CallFunc_SafeGetArg_Arg) == 0x000020, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::CallFunc_SafeGetArg_Arg' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, CallFunc_GetHealthPercent_Result) == 0x000028, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::CallFunc_GetHealthPercent_Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthHigh, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'AIC_Monster_Default_C_AbilityFilterHealthHigh::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterHealthLow
// 0x0050 (0x0050 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterHealthLow final
{
public:
	TArray<int32>                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetHealthPercent_Result;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterHealthLow) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterHealthLow");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterHealthLow) == 0x000050, "Wrong size on AIC_Monster_Default_C_AbilityFilterHealthLow");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, Args) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::Args' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, Result) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, CallFunc_SafeGetArg_Arg) == 0x000020, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::CallFunc_SafeGetArg_Arg' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, CallFunc_GetHealthPercent_Result) == 0x000028, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::CallFunc_GetHealthPercent_Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHealthLow, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'AIC_Monster_Default_C_AbilityFilterHealthLow::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterHostileCount
// 0x0078 (0x0078 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterHostileCount final
{
public:
	TArray<int32>                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_RangeQueryActors_Actors;                  // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostile_Result;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SafeGetArg_Arg_1;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg_2;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RangeQueryActors_Range_ImplicitCast;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterHostileCount) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterHostileCount");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterHostileCount) == 0x000078, "Wrong size on AIC_Monster_Default_C_AbilityFilterHostileCount");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, Args) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::Args' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, Result) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, Count) == 0x000014, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::Count' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_SafeGetArg_Arg) == 0x00001C, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_SafeGetArg_Arg' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000024, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_RangeQueryActors_Actors) == 0x000028, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_RangeQueryActors_Actors' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, Temp_int_Array_Index_Variable) == 0x000040, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Array_Get_Item) == 0x000048, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_IsHostile_Result) == 0x000050, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_IsHostile_Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_SafeGetArg_Arg_1) == 0x000054, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_SafeGetArg_Arg_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_SafeGetArg_Arg_2) == 0x000058, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_SafeGetArg_Arg_2' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, Temp_int_Variable) == 0x00005C, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterHostileCount, CallFunc_RangeQueryActors_Range_ImplicitCast) == 0x000070, "Member 'AIC_Monster_Default_C_AbilityFilterHostileCount::CallFunc_RangeQueryActors_Range_ImplicitCast' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterNone
// 0x0001 (0x0001 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterNone final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterNone) == 0x000001, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterNone");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterNone) == 0x000001, "Wrong size on AIC_Monster_Default_C_AbilityFilterNone");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterNone, Result) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterNone::Result' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterSummonsCount
// 0x0048 (0x0048 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterSummonsCount final
{
public:
	TArray<int32>                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SafeGetArg_Arg;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg_1;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfCharacterSummonComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummonActorsCount_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterSummonsCount) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterSummonsCount");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterSummonsCount) == 0x000048, "Wrong size on AIC_Monster_Default_C_AbilityFilterSummonsCount");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, Args) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::Args' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, Result) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_SafeGetArg_Arg) == 0x000014, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_SafeGetArg_Arg' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_SafeGetArg_Arg_1) == 0x000018, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_SafeGetArg_Arg_1' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, K2Node_DynamicCast_AsLyra_Character) == 0x000028, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_GetSummonActorsCount_ReturnValue) == 0x000040, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_GetSummonActorsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000045, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_Less_IntInt_ReturnValue) == 0x000046, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterSummonsCount, CallFunc_BooleanAND_ReturnValue) == 0x000047, "Member 'AIC_Monster_Default_C_AbilityFilterSummonsCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityFilterTags
// 0x0048 (0x0048 - 0x0000)
struct AIC_Monster_Default_C_AbilityFilterTags final
{
public:
	TArray<int32>                                 Args;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  Param_Tags;                                        // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SafeGetArg_Arg;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AIC_Monster_Default_C_AbilityFilterTags) == 0x000008, "Wrong alignment on AIC_Monster_Default_C_AbilityFilterTags");
static_assert(sizeof(AIC_Monster_Default_C_AbilityFilterTags) == 0x000048, "Wrong size on AIC_Monster_Default_C_AbilityFilterTags");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, Args) == 0x000000, "Member 'AIC_Monster_Default_C_AbilityFilterTags::Args' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, Param_Tags) == 0x000010, "Member 'AIC_Monster_Default_C_AbilityFilterTags::Param_Tags' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, Result) == 0x000030, "Member 'AIC_Monster_Default_C_AbilityFilterTags::Result' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, CallFunc_K2_GetPawn_ReturnValue) == 0x000038, "Member 'AIC_Monster_Default_C_AbilityFilterTags::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, CallFunc_SafeGetArg_Arg) == 0x000040, "Member 'AIC_Monster_Default_C_AbilityFilterTags::CallFunc_SafeGetArg_Arg' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'AIC_Monster_Default_C_AbilityFilterTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000045, "Member 'AIC_Monster_Default_C_AbilityFilterTags::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000046, "Member 'AIC_Monster_Default_C_AbilityFilterTags::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIC_Monster_Default_C_AbilityFilterTags, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000047, "Member 'AIC_Monster_Default_C_AbilityFilterTags::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function AIC_Monster_Default.AIC_Monster_Default_C.AbilityTargetFilterAlternately
// 0x0170 (0x0170 - 0x0000)
struct AIC_Monster_Default_C_AbilityTargetFilterAlternately final
{
public:
	class UClass*                                 Param_Ability;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Targets;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 LastCandidate;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Candidate;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Candidates;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         ActorsUnavailable;                                 // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         ActorsBackup;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         Actors;                                            // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
