#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_Tgf_Fighter_AddSpeed_PPM

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AN_Tgf_Fighter_AddSpeed_PPM.AN_Tgf_Fighter_AddSpeed_PPM_C.Received_NotifyBegin
// 0x0750 (0x0750 - 0x0000)
struct AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0018(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraCameraComponent*                   CallFunc_FindCameraComponent_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendables                    CallFunc_InsertPostProcessMaterial_ReturnValue;    // 0x0058(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0070(0x06E0)()
};
static_assert(alignof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin) == 0x000010, "Wrong alignment on AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin");
static_assert(sizeof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin) == 0x000750, "Wrong size on AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, EventReference) == 0x000018, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::EventReference' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, ReturnValue) == 0x000040, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, CallFunc_FindCameraComponent_ReturnValue) == 0x000050, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, CallFunc_InsertPostProcessMaterial_ReturnValue) == 0x000058, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::CallFunc_InsertPostProcessMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin, K2Node_MakeStruct_PostProcessSettings) == 0x000070, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyBegin::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

// Function AN_Tgf_Fighter_AddSpeed_PPM.AN_Tgf_Fighter_AddSpeed_PPM_C.Received_NotifyEnd
// 0x0750 (0x0750 - 0x0000)
struct AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraCameraComponent*                   CallFunc_FindCameraComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendables                    CallFunc_DeletePostProcessMaterial_ReturnValue;    // 0x0050(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0070(0x06E0)()
};
static_assert(alignof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd) == 0x000010, "Wrong alignment on AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd");
static_assert(sizeof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd) == 0x000750, "Wrong size on AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, EventReference) == 0x000010, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::EventReference' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, ReturnValue) == 0x000038, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, CallFunc_FindCameraComponent_ReturnValue) == 0x000048, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, CallFunc_DeletePostProcessMaterial_ReturnValue) == 0x000050, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::CallFunc_DeletePostProcessMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd, K2Node_MakeStruct_PostProcessSettings) == 0x000070, "Member 'AN_Tgf_Fighter_AddSpeed_PPM_C_Received_NotifyEnd::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

}

