#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_Tgf_Footstep

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AN_Tgf_Footstep.AN_Tgf_Footstep_C.Get Shoe Name
// 0x0058 (0x0058 - 0x0000)
struct AN_Tgf_Footstep_C_Get_Shoe_Name final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 ShoeName;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraEquipmentInstance*                 CallFunc_GetEquipBySlot_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_Tgf_Footstep_C_Get_Shoe_Name) == 0x000008, "Wrong alignment on AN_Tgf_Footstep_C_Get_Shoe_Name");
static_assert(sizeof(AN_Tgf_Footstep_C_Get_Shoe_Name) == 0x000058, "Wrong size on AN_Tgf_Footstep_C_Get_Shoe_Name");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, Actor) == 0x000000, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::Actor' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, ShoeName) == 0x000008, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::ShoeName' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, Temp_bool_Variable) == 0x000018, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000020, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000031, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, CallFunc_GetEquipBySlot_ReturnValue) == 0x000048, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::CallFunc_GetEquipBySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Get_Shoe_Name, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'AN_Tgf_Footstep_C_Get_Shoe_Name::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AN_Tgf_Footstep.AN_Tgf_Footstep_C.GetChestName
// 0x00D0 (0x00D0 - 0x0000)
struct AN_Tgf_Footstep_C_GetChestName final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 SurfaceName;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<EPhysicalSurface>                      AllowedSurfaceType;                                // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<struct FTgfCharaPartChangeConfig>      Temp_struct_Variable;                              // 0x0028(0x0010)(ReferenceParm)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraEquipmentInstance*                 CallFunc_GetEquipBySlot_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULyraEquipmentDefinition>   CallFunc_GetEquipDef_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsTgf_Armor_Definition;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTgfCharaPartChangeConfig              CallFunc_Array_Get_Item;                           // 0x0088(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_Tgf_Footstep_C_GetChestName) == 0x000008, "Wrong alignment on AN_Tgf_Footstep_C_GetChestName");
static_assert(sizeof(AN_Tgf_Footstep_C_GetChestName) == 0x0000D0, "Wrong size on AN_Tgf_Footstep_C_GetChestName");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, Actor) == 0x000000, "Member 'AN_Tgf_Footstep_C_GetChestName::Actor' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, SurfaceName) == 0x000008, "Member 'AN_Tgf_Footstep_C_GetChestName::SurfaceName' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, AllowedSurfaceType) == 0x000018, "Member 'AN_Tgf_Footstep_C_GetChestName::AllowedSurfaceType' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, Temp_struct_Variable) == 0x000028, "Member 'AN_Tgf_Footstep_C_GetChestName::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000038, "Member 'AN_Tgf_Footstep_C_GetChestName::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AN_Tgf_Footstep_C_GetChestName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000058, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_GetEquipBySlot_ReturnValue) == 0x000060, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_GetEquipBySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_GetEquipDef_ReturnValue) == 0x000070, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_GetEquipDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, K2Node_ClassDynamicCast_AsTgf_Armor_Definition) == 0x000078, "Member 'AN_Tgf_Footstep_C_GetChestName::K2Node_ClassDynamicCast_AsTgf_Armor_Definition' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, K2Node_ClassDynamicCast_bSuccess) == 0x000080, "Member 'AN_Tgf_Footstep_C_GetChestName::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, Temp_int_Array_Index_Variable) == 0x000084, "Member 'AN_Tgf_Footstep_C_GetChestName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_Array_Get_Item) == 0x000088, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, Temp_bool_Variable) == 0x0000BC, "Member 'AN_Tgf_Footstep_C_GetChestName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000BD, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000BE, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000BF, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'AN_Tgf_Footstep_C_GetChestName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetChestName, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'AN_Tgf_Footstep_C_GetChestName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AN_Tgf_Footstep.AN_Tgf_Footstep_C.GetSurfaceName
// 0x01F8 (0x01F8 - 0x0000)
struct AN_Tgf_Footstep_C_GetSurfaceName final
{
public:
	struct FHitResult                             SurfaceType;                                       // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 SurfaceName;                                       // 0x00E8(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<EPhysicalSurface>                      AllowedSurfaceType;                                // 0x00F8(0x0010)(Edit, BlueprintVisible)
	TArray<EPhysicalSurface>                      K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_Tgf_Footstep_C_GetSurfaceName) == 0x000008, "Wrong alignment on AN_Tgf_Footstep_C_GetSurfaceName");
static_assert(sizeof(AN_Tgf_Footstep_C_GetSurfaceName) == 0x0001F8, "Wrong size on AN_Tgf_Footstep_C_GetSurfaceName");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, SurfaceType) == 0x000000, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::SurfaceType' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, SurfaceName) == 0x0000E8, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::SurfaceName' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, AllowedSurfaceType) == 0x0000F8, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::AllowedSurfaceType' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, K2Node_MakeArray_Array) == 0x000108, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_bBlockingHit) == 0x000118, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_bInitialOverlap) == 0x000119, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_Location) == 0x000128, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_ImpactPoint) == 0x000140, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_Normal) == 0x000158, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_BoneName) == 0x0001A8, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_HitItem) == 0x0001B0, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_ElementIndex) == 0x0001B4, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_FaceIndex) == 0x0001B8, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, K2Node_SwitchEnum_CmpSuccess) == 0x0001F0, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_GetSurfaceName, CallFunc_Array_Contains_ReturnValue) == 0x0001F1, "Member 'AN_Tgf_Footstep_C_GetSurfaceName::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function AN_Tgf_Footstep.AN_Tgf_Footstep_C.Received_Notify
// 0x04E0 (0x04E0 - 0x0000)
struct AN_Tgf_Footstep_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartPosition;                                     // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  UnwalkTag;                                         // 0x0058(0x0020)(Edit, BlueprintVisible)
	bool                                          IsStealth;                                         // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           AkComponent;                                       // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0090(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x00B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x00C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x00D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x00E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0120(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput_1;    // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_1;      // 0x0178(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput_2;    // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_2;      // 0x01B8(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput_3;    // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_3;      // 0x01F8(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_4;  // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput_4;    // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_4;      // 0x0238(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue_1;                 // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_Shoe_Name_ShoeName;                   // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6;                          // 0x0294(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7;                          // 0x02C8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetChestName_SurfaceName;                 // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_7;                // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x034C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Shoe_Name_ShoeName_1;                 // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x03B0(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x03C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSurfaceName_SurfaceName;               // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast_1;        // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_Tgf_Footstep_C_Received_Notify) == 0x000008, "Wrong alignment on AN_Tgf_Footstep_C_Received_Notify");
static_assert(sizeof(AN_Tgf_Footstep_C_Received_Notify) == 0x0004E0, "Wrong size on AN_Tgf_Footstep_C_Received_Notify");
static_assert(offsetof(AN_Tgf_Footstep_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_Tgf_Footstep_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Received_Notify, Animation) == 0x000008, "Member 'AN_Tgf_Footstep_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_Tgf_Footstep_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AN_Tgf_Footstep_C_Received_Notify, ReturnValue) == 0x000038, "Member 'AN_Tgf_Footstep_C_Received_Notify::ReturnValue' has a wrong offset!");
