#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_Tgf_AkEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function AN_Tgf_AkEvent.AN_Tgf_AkEvent_C.Received_Notify
// 0x0180 (0x0180 - 0x0000)
struct AN_Tgf_AkEvent_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           Ak;                                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraEquipmentInstance*                 CallFunc_GetAnimWeaponInstances_OutRightWeapon;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraEquipmentInstance*                 CallFunc_GetAnimWeaponInstances_OutLeftWeapon;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraInventoryItemInstance*             CallFunc_GetInventory_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInventoryFragment_Sound*         CallFunc_FindFragmentByClass_ReturnValue;          // 0x0088(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0094(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraEquipmentInstance*                 CallFunc_GetAnimWeaponInstances_OutRightWeapon_1;  // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraEquipmentInstance*                 CallFunc_GetAnimWeaponInstances_OutLeftWeapon_1;   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraInventoryItemInstance*             CallFunc_GetInventory_ReturnValue_1;               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInventoryFragment_Sound*         CallFunc_FindFragmentByClass_ReturnValue_1;        // 0x00E8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_Tgf_AkEvent_C_Received_Notify) == 0x000008, "Wrong alignment on AN_Tgf_AkEvent_C_Received_Notify");
static_assert(sizeof(AN_Tgf_AkEvent_C_Received_Notify) == 0x000180, "Wrong size on AN_Tgf_AkEvent_C_Received_Notify");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_Tgf_AkEvent_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, Animation) == 0x000008, "Member 'AN_Tgf_AkEvent_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, EventReference) == 0x000010, "Member 'AN_Tgf_AkEvent_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, ReturnValue) == 0x000038, "Member 'AN_Tgf_AkEvent_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, Ak) == 0x000040, "Member 'AN_Tgf_AkEvent_C_Received_Notify::Ak' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetComponentByClass_ReturnValue) == 0x000058, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetAnimWeaponInstances_OutRightWeapon) == 0x000068, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetAnimWeaponInstances_OutRightWeapon' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetAnimWeaponInstances_OutLeftWeapon) == 0x000070, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetAnimWeaponInstances_OutLeftWeapon' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetInventory_ReturnValue) == 0x000078, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_FindFragmentByClass_ReturnValue) == 0x000088, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_FindFragmentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, Temp_delegate_Variable) == 0x000094, "Member 'AN_Tgf_AkEvent_C_Received_Notify::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_4) == 0x0000A4, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetOwner_ReturnValue_1) == 0x0000A8, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000B0, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000B8, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_5) == 0x0000C0, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetAnimWeaponInstances_OutRightWeapon_1) == 0x0000C8, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetAnimWeaponInstances_OutRightWeapon_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetAnimWeaponInstances_OutLeftWeapon_1) == 0x0000D0, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetAnimWeaponInstances_OutLeftWeapon_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetInventory_ReturnValue_1) == 0x0000D8, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_6) == 0x0000E0, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_FindFragmentByClass_ReturnValue_1) == 0x0000E8, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_FindFragmentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_IsValid_ReturnValue_7) == 0x0000F0, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetOwner_ReturnValue_2) == 0x0000F8, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue) == 0x000100, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetDisplayName_ReturnValue_1) == 0x000110, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue) == 0x000120, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000130, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000140, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000150, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_Conv_StringToName_ReturnValue) == 0x000160, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetAkComponent_ComponentCreated) == 0x000168, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_GetAkComponent_ReturnValue) == 0x000170, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_GetAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_Received_Notify, CallFunc_PostAkEvent_ReturnValue) == 0x000178, "Member 'AN_Tgf_AkEvent_C_Received_Notify::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function AN_Tgf_AkEvent.AN_Tgf_AkEvent_C.SetDiffraction
// 0x0020 (0x0020 - 0x0000)
struct AN_Tgf_AkEvent_C_SetDiffraction final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UAkComponent*                     SpeakerComponent;                                  // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioObstacleDetectionComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_Tgf_AkEvent_C_SetDiffraction) == 0x000008, "Wrong alignment on AN_Tgf_AkEvent_C_SetDiffraction");
static_assert(sizeof(AN_Tgf_AkEvent_C_SetDiffraction) == 0x000020, "Wrong size on AN_Tgf_AkEvent_C_SetDiffraction");
static_assert(offsetof(AN_Tgf_AkEvent_C_SetDiffraction, OwnerActor) == 0x000000, "Member 'AN_Tgf_AkEvent_C_SetDiffraction::OwnerActor' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_SetDiffraction, SpeakerComponent) == 0x000008, "Member 'AN_Tgf_AkEvent_C_SetDiffraction::SpeakerComponent' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_SetDiffraction, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'AN_Tgf_AkEvent_C_SetDiffraction::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Tgf_AkEvent_C_SetDiffraction, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AN_Tgf_AkEvent_C_SetDiffraction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

