#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimStruct_AnimationSet_3rd

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AnimStruct_AnimationSet_3rd.AnimStruct_AnimationSet_3rd
// 0x0050 (0x0050 - 0x0000)
struct FAnimStruct_AnimationSet_3rd final
{
public:
	class UAnimSequenceBase*                      JumpStart_2_9DD780114DE2E210DFF928A1863677ED;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      JumpLoop_7_F9A385224F5D7044F7F26F85FFFF6BFC;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      JumpApex_8_EDBD5A1D4617C66641713397DDB34A5B;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      FallLoop_9_F8CDC8E443BD09BE9CB0D7A4285702D1;       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      FallLand_10_A49306B24F7C6BAC3109BAB6D93DE145;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CrouchStart_14_1EB22EA446C8C6CA1688F38C7373798D;   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CrouchEnd_15_484D17B645A0A05E4430519B0DC26232;     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CrouchIdle_16_3E3F329540D90DC0B923079BBD61027C;    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Idle_24_CE322DD04773C5DCE8742BAF88FDFF77;          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                   AO_Aiming_39_DD76423646B938C8E7F881B44643D536;     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAnimStruct_AnimationSet_3rd) == 0x000008, "Wrong alignment on FAnimStruct_AnimationSet_3rd");
static_assert(sizeof(FAnimStruct_AnimationSet_3rd) == 0x000050, "Wrong size on FAnimStruct_AnimationSet_3rd");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, JumpStart_2_9DD780114DE2E210DFF928A1863677ED) == 0x000000, "Member 'FAnimStruct_AnimationSet_3rd::JumpStart_2_9DD780114DE2E210DFF928A1863677ED' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, JumpLoop_7_F9A385224F5D7044F7F26F85FFFF6BFC) == 0x000008, "Member 'FAnimStruct_AnimationSet_3rd::JumpLoop_7_F9A385224F5D7044F7F26F85FFFF6BFC' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, JumpApex_8_EDBD5A1D4617C66641713397DDB34A5B) == 0x000010, "Member 'FAnimStruct_AnimationSet_3rd::JumpApex_8_EDBD5A1D4617C66641713397DDB34A5B' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, FallLoop_9_F8CDC8E443BD09BE9CB0D7A4285702D1) == 0x000018, "Member 'FAnimStruct_AnimationSet_3rd::FallLoop_9_F8CDC8E443BD09BE9CB0D7A4285702D1' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, FallLand_10_A49306B24F7C6BAC3109BAB6D93DE145) == 0x000020, "Member 'FAnimStruct_AnimationSet_3rd::FallLand_10_A49306B24F7C6BAC3109BAB6D93DE145' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, CrouchStart_14_1EB22EA446C8C6CA1688F38C7373798D) == 0x000028, "Member 'FAnimStruct_AnimationSet_3rd::CrouchStart_14_1EB22EA446C8C6CA1688F38C7373798D' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, CrouchEnd_15_484D17B645A0A05E4430519B0DC26232) == 0x000030, "Member 'FAnimStruct_AnimationSet_3rd::CrouchEnd_15_484D17B645A0A05E4430519B0DC26232' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, CrouchIdle_16_3E3F329540D90DC0B923079BBD61027C) == 0x000038, "Member 'FAnimStruct_AnimationSet_3rd::CrouchIdle_16_3E3F329540D90DC0B923079BBD61027C' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, Idle_24_CE322DD04773C5DCE8742BAF88FDFF77) == 0x000040, "Member 'FAnimStruct_AnimationSet_3rd::Idle_24_CE322DD04773C5DCE8742BAF88FDFF77' has a wrong offset!");
static_assert(offsetof(FAnimStruct_AnimationSet_3rd, AO_Aiming_39_DD76423646B938C8E7F881B44643D536) == 0x000048, "Member 'FAnimStruct_AnimationSet_3rd::AO_Aiming_39_DD76423646B938C8E7F881B44643D536' has a wrong offset!");

}

