#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttrBuffMap

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// UserDefinedStruct AttrBuffMap.AttrBuffMap
// 0x0068 (0x0068 - 0x0000)
struct FAttrBuffMap final
{
public:
	struct FGameplayAttribute                     Attr_4_E0896BED4BA9AD00BA4A29A483D839ED;           // 0x0000(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UClass*                                 Buff_7_48D3B77A4364835691F299978956D472;           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BuffAssetTag_10_83CE9C69497923F70BF25E8C05C1781E;  // 0x0040(0x0020)(Edit, BlueprintVisible)
	class UClass*                                 TriggerEffect_13_13B7408F4D4830FBC2713EB59D435385; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAttrBuffMap) == 0x000008, "Wrong alignment on FAttrBuffMap");
static_assert(sizeof(FAttrBuffMap) == 0x000068, "Wrong size on FAttrBuffMap");
static_assert(offsetof(FAttrBuffMap, Attr_4_E0896BED4BA9AD00BA4A29A483D839ED) == 0x000000, "Member 'FAttrBuffMap::Attr_4_E0896BED4BA9AD00BA4A29A483D839ED' has a wrong offset!");
static_assert(offsetof(FAttrBuffMap, Buff_7_48D3B77A4364835691F299978956D472) == 0x000038, "Member 'FAttrBuffMap::Buff_7_48D3B77A4364835691F299978956D472' has a wrong offset!");
static_assert(offsetof(FAttrBuffMap, BuffAssetTag_10_83CE9C69497923F70BF25E8C05C1781E) == 0x000040, "Member 'FAttrBuffMap::BuffAssetTag_10_83CE9C69497923F70BF25E8C05C1781E' has a wrong offset!");
static_assert(offsetof(FAttrBuffMap, TriggerEffect_13_13B7408F4D4830FBC2713EB59D435385) == 0x000060, "Member 'FAttrBuffMap::TriggerEffect_13_13B7408F4D4830FBC2713EB59D435385' has a wrong offset!");

}

