#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Aura_TGF_DruidPanther_Tanlent_HuntersSense

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function Aura_TGF_DruidPanther_Tanlent_HuntersSense.Aura_TGF_DruidPanther_Tanlent_HuntersSense_C.ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense
// 0x0210 (0x0210 - 0x0000)
struct Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_Event_Target;                               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfAuraManagerComponent*               K2Node_Event_AuraManagerComponent_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfAuraManagerComponent*               K2Node_Event_AuraManagerComponent;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALyraCharacter*>                 CallFunc_GetTargetCharacters_OutTargets;           // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_CustomEvent_Target_1;                       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetSourceCharacter_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0090(0x0020)()
	struct FAuraMessageVerb                       K2Node_MakeStruct_AuraMessageVerb;                 // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetSourceCharacter_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x00D0(0x0020)()
	class ALyraCharacter*                         K2Node_CustomEvent_Target;                         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetSourceCharacter_ReturnValue_2;         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuraMessageVerb                       K2Node_MakeStruct_AuraMessageVerb_1;               // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1;        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetSourceCharacter_ReturnValue_3;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3;  // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_3;     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetSourceCharacter_ReturnValue_4;         // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_4;  // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_4;     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetSourceCharacter_ReturnValue_5;         // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense) == 0x000008, "Wrong alignment on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense");
static_assert(sizeof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense) == 0x000210, "Wrong size on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, EntryPoint) == 0x000000, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::EntryPoint' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_Event_Target) == 0x000020, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_Event_AuraManagerComponent_1) == 0x000028, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_Event_AuraManagerComponent_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_Event_AuraManagerComponent) == 0x000030, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_Event_AuraManagerComponent' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_Event_DeltaTime) == 0x000038, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_GetTargetCharacters_OutTargets) == 0x000040, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_GetTargetCharacters_OutTargets' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Not_PreBool_ReturnValue) == 0x000054, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_CustomEvent_Target_1) == 0x000058, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000060, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000070, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_DynamicCast_AsBP_Tgf_Hero_Default) == 0x000078, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_DynamicCast_AsBP_Tgf_Hero_Default' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_GetSourceCharacter_ReturnValue) == 0x000088, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_GetSourceCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000090, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_MakeStruct_AuraMessageVerb) == 0x0000B0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_MakeStruct_AuraMessageVerb' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x0000C0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_GetSourceCharacter_ReturnValue_1) == 0x0000C8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_GetSourceCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x0000D0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_CustomEvent_Target) == 0x0000F0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_GetSourceCharacter_ReturnValue_2) == 0x0000F8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_GetSourceCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000100, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000108, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_IsValid_ReturnValue_1) == 0x000111, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_MakeStruct_AuraMessageVerb_1) == 0x000118, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_MakeStruct_AuraMessageVerb_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000128, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000138, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1) == 0x000140, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, Temp_int_Array_Index_Variable) == 0x00014C, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Array_Get_Item) == 0x000150, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000158, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000168, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_BooleanAND_ReturnValue) == 0x000169, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_IsValid_ReturnValue_2) == 0x00016A, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_GetSourceCharacter_ReturnValue_3) == 0x000170, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_GetSourceCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_IsValid_ReturnValue_3) == 0x000178, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_self_CastInput_3) == 0x000180, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_ReturnValue_3) == 0x000190, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_GetSourceCharacter_ReturnValue_4) == 0x000198, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_GetSourceCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_IsValid_ReturnValue_4) == 0x0001A0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_self_CastInput_4) == 0x0001A8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_HasMatchingGameplayTag_ReturnValue_4) == 0x0001B8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_HasMatchingGameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_BooleanAND_ReturnValue_1) == 0x0001B9, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001C0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_FMin_ReturnValue) == 0x0001D0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_FMin_ReturnValue_1) == 0x0001E0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_GetSourceCharacter_ReturnValue_5) == 0x0001E8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_GetSourceCharacter_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0001F0, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_IsValid_ReturnValue_5) == 0x0001F8, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000200, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000208, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x00020C, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ExecuteUbergraph_Aura_TGF_DruidPanther_Tanlent_HuntersSense::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");

// Function Aura_TGF_DruidPanther_Tanlent_HuntersSense.Aura_TGF_DruidPanther_Tanlent_HuntersSense_C.K2_OnAuraAdded
// 0x0008 (0x0008 - 0x0000)
struct Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraAdded final
{
public:
	class UTgfAuraManagerComponent*               AuraManagerComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraAdded) == 0x000008, "Wrong alignment on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraAdded");
static_assert(sizeof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraAdded) == 0x000008, "Wrong size on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraAdded");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraAdded, AuraManagerComponent) == 0x000000, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraAdded::AuraManagerComponent' has a wrong offset!");

// Function Aura_TGF_DruidPanther_Tanlent_HuntersSense.Aura_TGF_DruidPanther_Tanlent_HuntersSense_C.K2_OnAuraRemoved
// 0x0008 (0x0008 - 0x0000)
struct Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraRemoved final
{
public:
	class UTgfAuraManagerComponent*               AuraManagerComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraRemoved) == 0x000008, "Wrong alignment on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraRemoved");
static_assert(sizeof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraRemoved) == 0x000008, "Wrong size on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraRemoved");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraRemoved, AuraManagerComponent) == 0x000000, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnAuraRemoved::AuraManagerComponent' has a wrong offset!");

// Function Aura_TGF_DruidPanther_Tanlent_HuntersSense.Aura_TGF_DruidPanther_Tanlent_HuntersSense_C.K2_OnCharacterLeave
// 0x0008 (0x0008 - 0x0000)
struct Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnCharacterLeave final
{
public:
	class ALyraCharacter*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnCharacterLeave) == 0x000008, "Wrong alignment on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnCharacterLeave");
static_assert(sizeof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnCharacterLeave) == 0x000008, "Wrong size on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnCharacterLeave");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnCharacterLeave, Target) == 0x000000, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_OnCharacterLeave::Target' has a wrong offset!");

// Function Aura_TGF_DruidPanther_Tanlent_HuntersSense.Aura_TGF_DruidPanther_Tanlent_HuntersSense_C.K2_TickAura
// 0x0004 (0x0004 - 0x0000)
struct Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_TickAura final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_TickAura) == 0x000004, "Wrong alignment on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_TickAura");
static_assert(sizeof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_TickAura) == 0x000004, "Wrong size on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_TickAura");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_TickAura, DeltaTime) == 0x000000, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_K2_TickAura::DeltaTime' has a wrong offset!");

// Function Aura_TGF_DruidPanther_Tanlent_HuntersSense.Aura_TGF_DruidPanther_Tanlent_HuntersSense_C.ProcessSensedTargetEnter
// 0x0008 (0x0008 - 0x0000)
struct Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetEnter final
{
public:
	class ALyraCharacter*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetEnter) == 0x000008, "Wrong alignment on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetEnter");
static_assert(sizeof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetEnter) == 0x000008, "Wrong size on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetEnter");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetEnter, Target) == 0x000000, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetEnter::Target' has a wrong offset!");

// Function Aura_TGF_DruidPanther_Tanlent_HuntersSense.Aura_TGF_DruidPanther_Tanlent_HuntersSense_C.ProcessSensedTargetLeave
// 0x0008 (0x0008 - 0x0000)
struct Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetLeave final
{
public:
	class ALyraCharacter*                         Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetLeave) == 0x000008, "Wrong alignment on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetLeave");
static_assert(sizeof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetLeave) == 0x000008, "Wrong size on Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetLeave");
static_assert(offsetof(Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetLeave, Target) == 0x000000, "Member 'Aura_TGF_DruidPanther_Tanlent_HuntersSense_C_ProcessSensedTargetLeave::Target' has a wrong offset!");

}

