#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_AI_Controller_LyraShooter

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_AI_Controller_LyraShooter.B_AI_Controller_LyraShooter_C.ExecuteUbergraph_B_AI_Controller_LyraShooter
// 0x00A8 (0x00A8 - 0x0000)
struct B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OwningActor;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bTeamSet;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TeamId;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bTeamSet, int32 TeamId)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OwningActor)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfAttributeComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ObserveTeam*               CallFunc_ObserveTeam_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_UnpossessedPawn;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ExperienceReady*           CallFunc_WaitForExperienceReady_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter) == 0x000008, "Wrong alignment on B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter");
static_assert(sizeof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter) == 0x0000A8, "Wrong size on B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, EntryPoint) == 0x000000, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_CustomEvent_OwningActor) == 0x000008, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_CustomEvent_OwningActor' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_CustomEvent_bTeamSet) == 0x000010, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_CustomEvent_bTeamSet' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_CustomEvent_TeamId) == 0x000014, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_CustomEvent_TeamId' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, Temp_int_Variable) == 0x000028, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, Temp_bool_Variable) == 0x00002C, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_K2_GetPawn_ReturnValue) == 0x000040, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_ObserveTeam_ReturnValue) == 0x000050, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_ObserveTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_Event_PossessedPawn) == 0x000060, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_Event_PossessedPawn' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_GetBlackboard_ReturnValue) == 0x000070, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_IsValid_ReturnValue_3) == 0x000078, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_Event_UnpossessedPawn) == 0x000080, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_Event_UnpossessedPawn' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_WaitForExperienceReady_ReturnValue) == 0x000098, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_WaitForExperienceReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_IsValid_ReturnValue_4) == 0x0000A0, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter, CallFunc_RunBehaviorTree_ReturnValue) == 0x0000A1, "Member 'B_AI_Controller_LyraShooter_C_ExecuteUbergraph_B_AI_Controller_LyraShooter::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");

// Function B_AI_Controller_LyraShooter.B_AI_Controller_LyraShooter_C.OnDeathStarted
// 0x0008 (0x0008 - 0x0000)
struct B_AI_Controller_LyraShooter_C_OnDeathStarted final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_AI_Controller_LyraShooter_C_OnDeathStarted) == 0x000008, "Wrong alignment on B_AI_Controller_LyraShooter_C_OnDeathStarted");
static_assert(sizeof(B_AI_Controller_LyraShooter_C_OnDeathStarted) == 0x000008, "Wrong size on B_AI_Controller_LyraShooter_C_OnDeathStarted");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_OnDeathStarted, OwningActor) == 0x000000, "Member 'B_AI_Controller_LyraShooter_C_OnDeathStarted::OwningActor' has a wrong offset!");

// Function B_AI_Controller_LyraShooter.B_AI_Controller_LyraShooter_C.OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917
// 0x0008 (0x0008 - 0x0000)
struct B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917 final
{
public:
	bool                                          bTeamSet;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TeamId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917) == 0x000004, "Wrong alignment on B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917");
static_assert(sizeof(B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917) == 0x000008, "Wrong size on B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917, bTeamSet) == 0x000000, "Member 'B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917::bTeamSet' has a wrong offset!");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917, TeamId) == 0x000004, "Member 'B_AI_Controller_LyraShooter_C_OnTeamChanged_40BFDA4D461E82BC70C0ACB574632917::TeamId' has a wrong offset!");

// Function B_AI_Controller_LyraShooter.B_AI_Controller_LyraShooter_C.ReceivePossess
// 0x0008 (0x0008 - 0x0000)
struct B_AI_Controller_LyraShooter_C_ReceivePossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_AI_Controller_LyraShooter_C_ReceivePossess) == 0x000008, "Wrong alignment on B_AI_Controller_LyraShooter_C_ReceivePossess");
static_assert(sizeof(B_AI_Controller_LyraShooter_C_ReceivePossess) == 0x000008, "Wrong size on B_AI_Controller_LyraShooter_C_ReceivePossess");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ReceivePossess, PossessedPawn) == 0x000000, "Member 'B_AI_Controller_LyraShooter_C_ReceivePossess::PossessedPawn' has a wrong offset!");

// Function B_AI_Controller_LyraShooter.B_AI_Controller_LyraShooter_C.ReceiveUnPossess
// 0x0008 (0x0008 - 0x0000)
struct B_AI_Controller_LyraShooter_C_ReceiveUnPossess final
{
public:
	class APawn*                                  UnpossessedPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_AI_Controller_LyraShooter_C_ReceiveUnPossess) == 0x000008, "Wrong alignment on B_AI_Controller_LyraShooter_C_ReceiveUnPossess");
static_assert(sizeof(B_AI_Controller_LyraShooter_C_ReceiveUnPossess) == 0x000008, "Wrong size on B_AI_Controller_LyraShooter_C_ReceiveUnPossess");
static_assert(offsetof(B_AI_Controller_LyraShooter_C_ReceiveUnPossess, UnpossessedPawn) == 0x000000, "Member 'B_AI_Controller_LyraShooter_C_ReceiveUnPossess::UnpossessedPawn' has a wrong offset!");

}

