#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_LyraGameMode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function B_LyraGameMode.B_LyraGameMode_C.ExecuteUbergraph_B_LyraGameMode
// 0x0260 (0x0260 - 0x0000)
struct B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTgfNotificationMessageSpawnMonster    Temp_struct_Variable;                              // 0x0028(0x0028)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Tgf_Monster;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_SpawnMonster_Controller;                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTgfNotificationMessageSpawnActor      Temp_struct_Variable_2;                            // 0x00E8(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTgfNotificationMessageSpawnActor      Temp_struct_Variable_3;                            // 0x0130(0x0020)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ExperienceReady*           CallFunc_WaitForExperienceReady_ReturnValue;       // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraGamePhaseSubsystem*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULyraGamePhaseAbility* Phase)> Temp_delegate_Variable;                            // 0x020C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTgfNotificationMessageSpawnMonster    Temp_struct_Variable_5;                            // 0x0220(0x0028)(NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode) == 0x000010, "Wrong alignment on B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode");
static_assert(sizeof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode) == 0x000260, "Wrong size on B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, EntryPoint) == 0x000000, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_CustomEvent_ProxyObject_1) == 0x000008, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_CustomEvent_ActualChannel_1) == 0x000010, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_struct_Variable) == 0x000028, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_struct_Variable_1) == 0x000050, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_ClassDynamicCast_AsBP_Tgf_Monster) == 0x0000C0, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_ClassDynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_ClassDynamicCast_bSuccess) == 0x0000C8, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_object_Variable) == 0x0000D0, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_SpawnMonster_Controller) == 0x0000D8, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_SpawnMonster_Controller' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x0000E0, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_struct_Variable_2) == 0x0000E8, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_CreateDelegate_OutputDelegate_1) == 0x00010C, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_CustomEvent_ProxyObject) == 0x000120, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_CustomEvent_ActualChannel) == 0x000128, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_struct_Variable_3) == 0x000130, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_struct_Variable_4) == 0x000150, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_object_Variable_1) == 0x000158, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_MakeTransform_ReturnValue_1) == 0x000160, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_GetPayload_ReturnValue) == 0x0001C0, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C8, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D0, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x0001D8, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001E0, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_IsValid_ReturnValue_1) == 0x0001F0, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_WaitForExperienceReady_ReturnValue) == 0x0001F8, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_WaitForExperienceReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000200, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_IsValid_ReturnValue_2) == 0x000208, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_delegate_Variable) == 0x00020C, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_HasAuthority_ReturnValue) == 0x00021C, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, Temp_struct_Variable_5) == 0x000220, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_GetGameState_ReturnValue) == 0x000248, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_DynamicCast_AsLyra_Game_State) == 0x000250, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode, CallFunc_GetPayload_ReturnValue_1) == 0x000259, "Member 'B_LyraGameMode_C_ExecuteUbergraph_B_LyraGameMode::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");

// Function B_LyraGameMode.B_LyraGameMode_C.GetDefaultPawnClassForController
// 0x0030 (0x0030 - 0x0000)
struct B_LyraGameMode_C_GetDefaultPawnClassForController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetDefaultPawnClassForController_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATGF_AIController_C*                    K2Node_DynamicCast_AsTGF_AIController;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPawnClass_Result;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetPawnClass_Pawn;                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LyraGameMode_C_GetDefaultPawnClassForController) == 0x000008, "Wrong alignment on B_LyraGameMode_C_GetDefaultPawnClassForController");
static_assert(sizeof(B_LyraGameMode_C_GetDefaultPawnClassForController) == 0x000030, "Wrong size on B_LyraGameMode_C_GetDefaultPawnClassForController");
static_assert(offsetof(B_LyraGameMode_C_GetDefaultPawnClassForController, InController) == 0x000000, "Member 'B_LyraGameMode_C_GetDefaultPawnClassForController::InController' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_GetDefaultPawnClassForController, ReturnValue) == 0x000008, "Member 'B_LyraGameMode_C_GetDefaultPawnClassForController::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_GetDefaultPawnClassForController, CallFunc_GetDefaultPawnClassForController_ReturnValue) == 0x000010, "Member 'B_LyraGameMode_C_GetDefaultPawnClassForController::CallFunc_GetDefaultPawnClassForController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_GetDefaultPawnClassForController, K2Node_DynamicCast_AsTGF_AIController) == 0x000018, "Member 'B_LyraGameMode_C_GetDefaultPawnClassForController::K2Node_DynamicCast_AsTGF_AIController' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_GetDefaultPawnClassForController, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_LyraGameMode_C_GetDefaultPawnClassForController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_GetDefaultPawnClassForController, CallFunc_GetPawnClass_Result) == 0x000021, "Member 'B_LyraGameMode_C_GetDefaultPawnClassForController::CallFunc_GetPawnClass_Result' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_GetDefaultPawnClassForController, CallFunc_GetPawnClass_Pawn) == 0x000028, "Member 'B_LyraGameMode_C_GetDefaultPawnClassForController::CallFunc_GetPawnClass_Pawn' has a wrong offset!");

// Function B_LyraGameMode.B_LyraGameMode_C.OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E
// 0x0010 (0x0010 - 0x0000)
struct B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E) == 0x000008, "Wrong alignment on B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E");
static_assert(sizeof(B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E) == 0x000010, "Wrong size on B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E");
static_assert(offsetof(B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E, ProxyObject) == 0x000000, "Member 'B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E::ProxyObject' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E, ActualChannel) == 0x000008, "Member 'B_LyraGameMode_C_OnMessageReceived_10FCC0BF4F5D0C5CA96B87AC944B416E::ActualChannel' has a wrong offset!");

// Function B_LyraGameMode.B_LyraGameMode_C.OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84
// 0x0010 (0x0010 - 0x0000)
struct B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84) == 0x000008, "Wrong alignment on B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84");
static_assert(sizeof(B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84) == 0x000010, "Wrong size on B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84");
static_assert(offsetof(B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84, ProxyObject) == 0x000000, "Member 'B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84::ProxyObject' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84, ActualChannel) == 0x000008, "Member 'B_LyraGameMode_C_OnMessageReceived_498BF20E4A53CBF6E2ECE48522E98E84::ActualChannel' has a wrong offset!");

// Function B_LyraGameMode.B_LyraGameMode_C.SpawnMonster
// 0x0220 (0x0220 - 0x0000)
struct B_LyraGameMode_C_SpawnMonster final
{
public:
	class UClass*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ActorSpawnPoint_C*                  ActorSpawnPoint;                                   // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamId;                                            // 0x0078(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dormant;                                           // 0x007C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          Controller;                                        // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGF_AIControllerData_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Tgf_Monster;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Monster_C*                      CallFunc_GetClassDefaultObject_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsLyra_AIController;       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_SelectTransform_ReturnValue;              // 0x0190(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_SpawnCharacter_ReturnValue;               // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_LyraGameMode_C_SpawnMonster) == 0x000010, "Wrong alignment on B_LyraGameMode_C_SpawnMonster");
static_assert(sizeof(B_LyraGameMode_C_SpawnMonster) == 0x000220, "Wrong size on B_LyraGameMode_C_SpawnMonster");
static_assert(offsetof(B_LyraGameMode_C_SpawnMonster, Actor) == 0x000000, "Member 'B_LyraGameMode_C_SpawnMonster::Actor' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_SpawnMonster, Transform) == 0x000010, "Member 'B_LyraGameMode_C_SpawnMonster::Transform' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_SpawnMonster, ActorSpawnPoint) == 0x000070, "Member 'B_LyraGameMode_C_SpawnMonster::ActorSpawnPoint' has a wrong offset!");
static_assert(offsetof(B_LyraGameMode_C_SpawnMonster, TeamId) == 0x000078, "Member 'B_LyraGameMode_C_SpawnMonster::TeamId' has a wrong offset!");
