#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_MarkPoint_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_MarkPoint_Base.B_MarkPoint_Base_C
// 0x0090 (0x0328 - 0x0298)
class AB_MarkPoint_Base_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialBillboardComponent*            DangerBillboard;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialBillboardComponent*            CommonBillboard;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SelectedNiagara;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UNiagaraSystem*                         CommonMarkPointNiagara;                            // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DangerMarkPointNiagara;                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MaxExistTime;                                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDangerType;                                      // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CommonMarkPoint;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DangerMarkPoint;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeHandle;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CommonMarkColor;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CommonMID;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DangerMID;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          MarkSound;                                         // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AlertSound;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_MarkPoint_Base(int32 EntryPoint);
	void HideAll();
	void OnTimeOut();
	void ReceiveBeginPlay();
	void ShowMarkPoint(const struct FVector& Location, bool Param_IsDangerType);
	void UpdateType();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_MarkPoint_Base_C">();
	}
	static class AB_MarkPoint_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_MarkPoint_Base_C>();
	}
};
static_assert(alignof(AB_MarkPoint_Base_C) == 0x000008, "Wrong alignment on AB_MarkPoint_Base_C");
static_assert(sizeof(AB_MarkPoint_Base_C) == 0x000328, "Wrong size on AB_MarkPoint_Base_C");
static_assert(offsetof(AB_MarkPoint_Base_C, UberGraphFrame) == 0x000298, "Member 'AB_MarkPoint_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, Ak) == 0x0002A0, "Member 'AB_MarkPoint_Base_C::Ak' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, DangerBillboard) == 0x0002A8, "Member 'AB_MarkPoint_Base_C::DangerBillboard' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, CommonBillboard) == 0x0002B0, "Member 'AB_MarkPoint_Base_C::CommonBillboard' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, Root) == 0x0002B8, "Member 'AB_MarkPoint_Base_C::Root' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, SelectedNiagara) == 0x0002C0, "Member 'AB_MarkPoint_Base_C::SelectedNiagara' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, CommonMarkPointNiagara) == 0x0002C8, "Member 'AB_MarkPoint_Base_C::CommonMarkPointNiagara' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, DangerMarkPointNiagara) == 0x0002D0, "Member 'AB_MarkPoint_Base_C::DangerMarkPointNiagara' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, MaxExistTime) == 0x0002D8, "Member 'AB_MarkPoint_Base_C::MaxExistTime' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, IsDangerType) == 0x0002DC, "Member 'AB_MarkPoint_Base_C::IsDangerType' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, CommonMarkPoint) == 0x0002E0, "Member 'AB_MarkPoint_Base_C::CommonMarkPoint' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, DangerMarkPoint) == 0x0002E8, "Member 'AB_MarkPoint_Base_C::DangerMarkPoint' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, TimeHandle) == 0x0002F0, "Member 'AB_MarkPoint_Base_C::TimeHandle' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, CommonMarkColor) == 0x0002F8, "Member 'AB_MarkPoint_Base_C::CommonMarkColor' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, CommonMID) == 0x000308, "Member 'AB_MarkPoint_Base_C::CommonMID' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, DangerMID) == 0x000310, "Member 'AB_MarkPoint_Base_C::DangerMID' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, MarkSound) == 0x000318, "Member 'AB_MarkPoint_Base_C::MarkSound' has a wrong offset!");
static_assert(offsetof(AB_MarkPoint_Base_C, AlertSound) == 0x000320, "Member 'AB_MarkPoint_Base_C::AlertSound' has a wrong offset!");

}

