#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Staff_Laser_Effect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Staff_Laser_Effect.B_Staff_Laser_Effect_C
// 0x0090 (0x0738 - 0x06A8)
class AB_Staff_Laser_Effect_C final : public ATgfProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UB_Staff_Laser_BeamDecal_C*             B_Staff_Laser_BeamDecal;                           // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Common_Fire_Skill01_Hit;                        // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpawnedNiagara;                                    // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCableComponent*                        CableComp;                                         // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpawnSocketName;                                   // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         LineNiagaraSystem;                                 // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   HookSocketName;                                    // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StartSound;                                        // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinished;                                         // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurTime;                                           // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedBeamDecal;                                     // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          LoopSound;                                         // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          EndSound;                                          // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ExtraExplodeEffect;                                // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DetachEffect();
	void ExecuteUbergraph_B_Staff_Laser_Effect(int32 EntryPoint);
	void HideEffect();
	void InitCable();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void ShouldShowInGame(bool* bShow);
	void SpawnExtraExplodeFx();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Staff_Laser_Effect_C">();
	}
	static class AB_Staff_Laser_Effect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Staff_Laser_Effect_C>();
	}
};
static_assert(alignof(AB_Staff_Laser_Effect_C) == 0x000008, "Wrong alignment on AB_Staff_Laser_Effect_C");
static_assert(sizeof(AB_Staff_Laser_Effect_C) == 0x000738, "Wrong size on AB_Staff_Laser_Effect_C");
static_assert(offsetof(AB_Staff_Laser_Effect_C, UberGraphFrame) == 0x0006A8, "Member 'AB_Staff_Laser_Effect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, B_Staff_Laser_BeamDecal) == 0x0006B0, "Member 'AB_Staff_Laser_Effect_C::B_Staff_Laser_BeamDecal' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, FX_Common_Fire_Skill01_Hit) == 0x0006B8, "Member 'AB_Staff_Laser_Effect_C::FX_Common_Fire_Skill01_Hit' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, Ak) == 0x0006C0, "Member 'AB_Staff_Laser_Effect_C::Ak' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, Sphere) == 0x0006C8, "Member 'AB_Staff_Laser_Effect_C::Sphere' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, ProjectileMovement) == 0x0006D0, "Member 'AB_Staff_Laser_Effect_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, SpawnedNiagara) == 0x0006D8, "Member 'AB_Staff_Laser_Effect_C::SpawnedNiagara' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, CableComp) == 0x0006E0, "Member 'AB_Staff_Laser_Effect_C::CableComp' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, SpawnSocketName) == 0x0006E8, "Member 'AB_Staff_Laser_Effect_C::SpawnSocketName' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, LineNiagaraSystem) == 0x0006F0, "Member 'AB_Staff_Laser_Effect_C::LineNiagaraSystem' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, HookSocketName) == 0x0006F8, "Member 'AB_Staff_Laser_Effect_C::HookSocketName' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, StartSound) == 0x000700, "Member 'AB_Staff_Laser_Effect_C::StartSound' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, bFinished) == 0x000708, "Member 'AB_Staff_Laser_Effect_C::bFinished' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, CurTime) == 0x000710, "Member 'AB_Staff_Laser_Effect_C::CurTime' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, NeedBeamDecal) == 0x000718, "Member 'AB_Staff_Laser_Effect_C::NeedBeamDecal' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, LoopSound) == 0x000720, "Member 'AB_Staff_Laser_Effect_C::LoopSound' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, EndSound) == 0x000728, "Member 'AB_Staff_Laser_Effect_C::EndSound' has a wrong offset!");
static_assert(offsetof(AB_Staff_Laser_Effect_C, ExtraExplodeEffect) == 0x000730, "Member 'AB_Staff_Laser_Effect_C::ExtraExplodeEffect' has a wrong offset!");

}

