#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Staff_Laser_Effect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Staff_Laser_Effect.B_Staff_Laser_Effect_C.ExecuteUbergraph_B_Staff_Laser_Effect
// 0x0228 (0x0228 - 0x0000)
struct B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter_1;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowInGame_bShow;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCurrentWeaponFirstActor_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x01DC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExecuteActionImp_ReturnValue;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect) == 0x000008, "Wrong alignment on B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect");
static_assert(sizeof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect) == 0x000228, "Wrong size on B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, EntryPoint) == 0x000000, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, Temp_delegate_Variable) == 0x000004, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, Temp_delegate_Variable_1) == 0x000018, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, K2Node_DynamicCast_AsCharacter) == 0x000028, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, K2Node_DynamicCast_AsCharacter_1) == 0x000040, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::K2Node_DynamicCast_AsCharacter_1' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_2) == 0x000049, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_3) == 0x00004A, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_4) == 0x00004B, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_ShouldShowInGame_bShow) == 0x00004C, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_ShouldShowInGame_bShow' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_GetOwner_ReturnValue_1) == 0x000050, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_GetCurrentWeaponFirstActor_ReturnValue) == 0x000058, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_GetCurrentWeaponFirstActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_GetSocketLocation_ReturnValue) == 0x000080, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000A0, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0000B8, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_5) == 0x0000C0, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000C8, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000E0, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_6) == 0x0001C8, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001D0, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_7) == 0x0001D8, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, Temp_delegate_Variable_2) == 0x0001DC, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_8) == 0x0001EC, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_IsValid_ReturnValue_9) == 0x0001ED, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_PostAkEvent_ReturnValue) == 0x0001F0, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001F4, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_ExecuteActionImp_ReturnValue) == 0x0001F8, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_ExecuteActionImp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_PostAkEvent_ReturnValue_2) == 0x0001FC, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000200, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000218, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000220, "Member 'B_Staff_Laser_Effect_C_ExecuteUbergraph_B_Staff_Laser_Effect::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function B_Staff_Laser_Effect.B_Staff_Laser_Effect_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Staff_Laser_Effect_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Staff_Laser_Effect_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Staff_Laser_Effect_C_ReceiveTick");
static_assert(sizeof(B_Staff_Laser_Effect_C_ReceiveTick) == 0x000004, "Wrong size on B_Staff_Laser_Effect_C_ReceiveTick");
static_assert(offsetof(B_Staff_Laser_Effect_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Staff_Laser_Effect_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Staff_Laser_Effect.B_Staff_Laser_Effect_C.ShouldShowInGame
// 0x0020 (0x0020 - 0x0000)
struct B_Staff_Laser_Effect_C_ShouldShowInGame final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Staff_Laser_Effect_C_ShouldShowInGame) == 0x000008, "Wrong alignment on B_Staff_Laser_Effect_C_ShouldShowInGame");
static_assert(sizeof(B_Staff_Laser_Effect_C_ShouldShowInGame) == 0x000020, "Wrong size on B_Staff_Laser_Effect_C_ShouldShowInGame");
static_assert(offsetof(B_Staff_Laser_Effect_C_ShouldShowInGame, bShow) == 0x000000, "Member 'B_Staff_Laser_Effect_C_ShouldShowInGame::bShow' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ShouldShowInGame, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'B_Staff_Laser_Effect_C_ShouldShowInGame::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ShouldShowInGame, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'B_Staff_Laser_Effect_C_ShouldShowInGame::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ShouldShowInGame, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'B_Staff_Laser_Effect_C_ShouldShowInGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ShouldShowInGame, CallFunc_IsLocallyControlled_ReturnValue) == 0x000019, "Member 'B_Staff_Laser_Effect_C_ShouldShowInGame::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Staff_Laser_Effect_C_ShouldShowInGame, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'B_Staff_Laser_Effect_C_ShouldShowInGame::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

