#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TGF_MatchGameState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_TGF_MatchGameState.B_TGF_MatchGameState_C
// 0x0020 (0x03A0 - 0x0380)
class AB_TGF_MatchGameState_C final : public ALyraGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTgfInteractorEventComponent*           TgfInteractorEvent;                                // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UB_ShooterBotSpawner_C*                 BotCreationComponent;                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void AssignOptionIds();
	void ExecuteUbergraph_B_TGF_MatchGameState(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_TGF_MatchGameState_C">();
	}
	static class AB_TGF_MatchGameState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_TGF_MatchGameState_C>();
	}
};
static_assert(alignof(AB_TGF_MatchGameState_C) == 0x000008, "Wrong alignment on AB_TGF_MatchGameState_C");
static_assert(sizeof(AB_TGF_MatchGameState_C) == 0x0003A0, "Wrong size on AB_TGF_MatchGameState_C");
static_assert(offsetof(AB_TGF_MatchGameState_C, UberGraphFrame) == 0x000380, "Member 'AB_TGF_MatchGameState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_TGF_MatchGameState_C, TgfInteractorEvent) == 0x000388, "Member 'AB_TGF_MatchGameState_C::TgfInteractorEvent' has a wrong offset!");
static_assert(offsetof(AB_TGF_MatchGameState_C, BotCreationComponent) == 0x000390, "Member 'AB_TGF_MatchGameState_C::BotCreationComponent' has a wrong offset!");
static_assert(offsetof(AB_TGF_MatchGameState_C, DefaultSceneRoot) == 0x000398, "Member 'AB_TGF_MatchGameState_C::DefaultSceneRoot' has a wrong offset!");

}

