#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TGF_ArmorInstance_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function B_TGF_ArmorInstance_Base.B_TGF_ArmorInstance_Base_C.DetermineCosmeticTags
// 0x0048 (0x0048 - 0x0000)
struct B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags final
{
public:
	class ULyraPawnComponent_CharacterParts*      CosmeticComponent;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetCombinedTags_ReturnValue;              // 0x0008(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraPawnComponent_CharacterParts*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags) == 0x000008, "Wrong alignment on B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags");
static_assert(sizeof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags) == 0x000048, "Wrong size on B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags");
static_assert(offsetof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags, CosmeticComponent) == 0x000000, "Member 'B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags::CosmeticComponent' has a wrong offset!");
static_assert(offsetof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags, CallFunc_GetCombinedTags_ReturnValue) == 0x000008, "Member 'B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags::CallFunc_GetCombinedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags, CallFunc_GetPawn_ReturnValue) == 0x000030, "Member 'B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'B_TGF_ArmorInstance_Base_C_DetermineCosmeticTags::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function B_TGF_ArmorInstance_Base.B_TGF_ArmorInstance_Base_C.ExecuteUbergraph_B_TGF_ArmorInstance_Base
// 0x0004 (0x0004 - 0x0000)
struct B_TGF_ArmorInstance_Base_C_ExecuteUbergraph_B_TGF_ArmorInstance_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_ArmorInstance_Base_C_ExecuteUbergraph_B_TGF_ArmorInstance_Base) == 0x000004, "Wrong alignment on B_TGF_ArmorInstance_Base_C_ExecuteUbergraph_B_TGF_ArmorInstance_Base");
static_assert(sizeof(B_TGF_ArmorInstance_Base_C_ExecuteUbergraph_B_TGF_ArmorInstance_Base) == 0x000004, "Wrong size on B_TGF_ArmorInstance_Base_C_ExecuteUbergraph_B_TGF_ArmorInstance_Base");
static_assert(offsetof(B_TGF_ArmorInstance_Base_C_ExecuteUbergraph_B_TGF_ArmorInstance_Base, EntryPoint) == 0x000000, "Member 'B_TGF_ArmorInstance_Base_C_ExecuteUbergraph_B_TGF_ArmorInstance_Base::EntryPoint' has a wrong offset!");

}

