#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TGF_Normal_ProjectileBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function B_TGF_Normal_ProjectileBase.B_TGF_Normal_ProjectileBase_C.ChangeMesh
// 0x0008 (0x0008 - 0x0000)
struct B_TGF_Normal_ProjectileBase_C_ChangeMesh final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Normal_ProjectileBase_C_ChangeMesh) == 0x000008, "Wrong alignment on B_TGF_Normal_ProjectileBase_C_ChangeMesh");
static_assert(sizeof(B_TGF_Normal_ProjectileBase_C_ChangeMesh) == 0x000008, "Wrong size on B_TGF_Normal_ProjectileBase_C_ChangeMesh");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ChangeMesh, Mesh) == 0x000000, "Member 'B_TGF_Normal_ProjectileBase_C_ChangeMesh::Mesh' has a wrong offset!");

// Function B_TGF_Normal_ProjectileBase.B_TGF_Normal_ProjectileBase_C.CheckHitInteractEnvironment
// 0x0100 (0x0100 - 0x0000)
struct B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment final
{
public:
	struct FHitResult                             Result;                                            // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEnvSurfaceTypeDataAsset*            AllowedSurfaceTypes;                               // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment) == 0x000008, "Wrong alignment on B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment");
static_assert(sizeof(B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment) == 0x000100, "Wrong size on B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment, Result) == 0x000000, "Member 'B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment::Result' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment, ReturnValue) == 0x0000E8, "Member 'B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment, AllowedSurfaceTypes) == 0x0000F0, "Member 'B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment::AllowedSurfaceTypes' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment, CallFunc_GetSurfaceType_ReturnValue) == 0x0000F8, "Member 'B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment, CallFunc_Array_Contains_ReturnValue) == 0x0000F9, "Member 'B_TGF_Normal_ProjectileBase_C_CheckHitInteractEnvironment::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function B_TGF_Normal_ProjectileBase.B_TGF_Normal_ProjectileBase_C.Detonate
// 0x0020 (0x0020 - 0x0000)
struct B_TGF_Normal_ProjectileBase_C_Detonate final
{
public:
	class AActor*                                 ExcludedActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExplodeCenter;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Normal_ProjectileBase_C_Detonate) == 0x000008, "Wrong alignment on B_TGF_Normal_ProjectileBase_C_Detonate");
static_assert(sizeof(B_TGF_Normal_ProjectileBase_C_Detonate) == 0x000020, "Wrong size on B_TGF_Normal_ProjectileBase_C_Detonate");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_Detonate, ExcludedActor) == 0x000000, "Member 'B_TGF_Normal_ProjectileBase_C_Detonate::ExcludedActor' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_Detonate, ExplodeCenter) == 0x000008, "Member 'B_TGF_Normal_ProjectileBase_C_Detonate::ExplodeCenter' has a wrong offset!");

// Function B_TGF_Normal_ProjectileBase.B_TGF_Normal_ProjectileBase_C.DoChangeMesh
// 0x0008 (0x0008 - 0x0000)
struct B_TGF_Normal_ProjectileBase_C_DoChangeMesh final
{
public:
	class USkeletalMesh*                          Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Normal_ProjectileBase_C_DoChangeMesh) == 0x000008, "Wrong alignment on B_TGF_Normal_ProjectileBase_C_DoChangeMesh");
static_assert(sizeof(B_TGF_Normal_ProjectileBase_C_DoChangeMesh) == 0x000008, "Wrong size on B_TGF_Normal_ProjectileBase_C_DoChangeMesh");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_DoChangeMesh, Mesh) == 0x000000, "Member 'B_TGF_Normal_ProjectileBase_C_DoChangeMesh::Mesh' has a wrong offset!");

// Function B_TGF_Normal_ProjectileBase.B_TGF_Normal_ProjectileBase_C.ExecuteUbergraph_B_TGF_Normal_ProjectileBase
// 0x0890 (0x0890 - 0x0000)
struct B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00E0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_Event_Mesh;                                 // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_ExcludedActor;                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ExplodeCenter;                  // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_CustomEvent_Mesh;                           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue_3;                     // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue_1;                // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_VelocityMag;                    // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_4;                     // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0400(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_Explode_OutActors;                        // 0x0508(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51A[0x6];                                      // 0x051A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_Array_Get_Item;                           // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A[0x6];                                      // 0x055A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0560(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0580(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0598(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6[0xA];                                      // 0x05C6(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_NewTransform;                   // 0x05D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0630(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0640(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CallFunc_Array_Get_Item_1;                         // 0x0648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0659(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x065A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65B[0x5];                                      // 0x065B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_StartPos;                       // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TraceActor;                     // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_DistanceFromCameraToTarget;     // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x06A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x06CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_5;       // 0x06CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CE[0x2];                                      // 0x06CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ExecuteActionImp_ReturnValue;             // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSpeed_ReturnValue_2;                // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x06D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_2;         // 0x07C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x07E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x07F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0810(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0828(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0840(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0858(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85C[0x4];                                      // 0x085C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0874(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2;  // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x087C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase) == 0x000010, "Wrong alignment on B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase");
static_assert(sizeof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase) == 0x000890, "Wrong size on B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, EntryPoint) == 0x000000, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_int_Array_Index_Variable) == 0x000004, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_delegate_Variable) == 0x000020, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_delegate_Variable_1) == 0x000030, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_HasAuthority_ReturnValue_1) == 0x000040, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_DynamicCast_AsCharacter) == 0x000048, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_delegate_Variable_2) == 0x000054, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_IsValid_ReturnValue_1) == 0x000064, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, Temp_delegate_Variable_3) == 0x000068, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_MyComp) == 0x000078, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_Other) == 0x000080, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_OtherComp) == 0x000088, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_bSelfMoved) == 0x000090, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_HitLocation) == 0x000098, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_HitNormal) == 0x0000B0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_NormalImpulse) == 0x0000C8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_Hit) == 0x0000E0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_CreateDelegate_OutputDelegate) == 0x0001C8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001D8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_Mesh) == 0x0001E0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_Mesh' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Not_PreBool_ReturnValue) == 0x0001E8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_HasAuthority_ReturnValue_2) == 0x0001E9, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_CustomEvent_Velocity) == 0x0001F0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_CustomEvent_ExcludedActor) == 0x000208, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_CustomEvent_ExcludedActor' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_CustomEvent_ExplodeCenter) == 0x000210, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_CustomEvent_ExplodeCenter' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_CustomEvent_Mesh) == 0x000228, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_CustomEvent_Mesh' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_EndPlayReason) == 0x000230, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_IsValid_ReturnValue_2) == 0x000231, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_Event_DeltaSeconds) == 0x000234, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_VSize_ReturnValue) == 0x000238, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Normal_ReturnValue) == 0x000240, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000258, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000270, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000278, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_IsValid_ReturnValue_3) == 0x000288, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000290, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002A8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Normal_ReturnValue_1) == 0x0002C0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002D8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0002E0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_PostAkEvent_ReturnValue) == 0x0002E8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0002F0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Normal_ReturnValue_2) == 0x0002F8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_GetMaxSpeed_ReturnValue) == 0x000310, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_VSize_ReturnValue_1) == 0x000318, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000320, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Normal_ReturnValue_3) == 0x000328, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Normal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_GetMaxSpeed_ReturnValue_1) == 0x000340, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_GetMaxSpeed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000348, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000360, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000378, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000380, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, K2Node_CustomEvent_VelocityMag) == 0x000398, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::K2Node_CustomEvent_VelocityMag' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0003A0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0003B8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Add_VectorVector_ReturnValue) == 0x0003D0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Normal_ReturnValue_4) == 0x0003E8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Normal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000400, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0004E8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0004F0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Explode_OutActors) == 0x000508, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Explode_OutActors' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_HasAuthority_ReturnValue_3) == 0x000518, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x000519, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000520, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_BooleanOR_ReturnValue) == 0x000538, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Array_Get_Item) == 0x000540, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Array_Length_ReturnValue) == 0x000548, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_PostAkEvent_ReturnValue_1) == 0x00054C, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Greater_IntInt_ReturnValue) == 0x000550, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Array_Length_ReturnValue_1) == 0x000554, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Less_IntInt_ReturnValue) == 0x000558, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000559, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000560, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Conv_FloatToVector_ReturnValue_1) == 0x000568, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Conv_FloatToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_GetActorForwardVector_ReturnValue) == 0x000580, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000598, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0005B0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0005B8, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase, CallFunc_PostAkEvent_ReturnValue_2) == 0x0005C0, "Member 'B_TGF_Normal_ProjectileBase_C_ExecuteUbergraph_B_TGF_Normal_ProjectileBase::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
