#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TGF_Soul

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function B_TGF_Soul.B_TGF_Soul_C.ExecuteUbergraph_B_TGF_Soul
// 0x0430 (0x0430 - 0x0000)
struct B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckVisibilityToLocalPlayer_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0138(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0150(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0180(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0220(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0240(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0258(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckVisibilityToLocalPlayer_ReturnValue_1; // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default;     // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSoulHarvest_Result;                  // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue; // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x035C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0370(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x038C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x03B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x2];                                      // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character_1;             // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSoulEnergyFull_ReturnValue;             // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3[0x5];                                      // 0x03D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423[0x1];                                      // 0x0423(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast; // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul) == 0x000008, "Wrong alignment on B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul");
static_assert(sizeof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul) == 0x000430, "Wrong size on B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, EntryPoint) == 0x000000, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, Temp_object_Variable) == 0x000008, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_CustomEvent_TargetActor) == 0x000028, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_CheckVisibilityToLocalPlayer_ReturnValue) == 0x000030, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_CheckVisibilityToLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_MakeArray_Array) == 0x000068, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_SphereOverlapActors_OutActors) == 0x000078, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_SphereOverlapActors_ReturnValue) == 0x000088, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000098, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_Event_DeltaSeconds) == 0x0000B4, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000C8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BreakVector_X) == 0x0000E0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BreakVector_Y) == 0x0000E8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000100, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_HasAuthority_ReturnValue_1) == 0x000118, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsValid_ReturnValue_3) == 0x000119, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000120, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, Temp_delegate_Variable) == 0x000138, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Vector_Distance_ReturnValue) == 0x000148, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000150, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000168, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_MakeStruct_FormatArgumentData) == 0x000180, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001D0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_MakeArray_Array_1) == 0x000220, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_MakeArray_Array_2) == 0x000230, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Format_ReturnValue) == 0x000240, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Format_ReturnValue_1) == 0x000258, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Conv_TextToString_ReturnValue) == 0x000270, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000280, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000290, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000298, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x0002B0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0002C8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002E0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Normal_ReturnValue) == 0x0002F8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000310, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsStandalone_ReturnValue) == 0x000328, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_CheckVisibilityToLocalPlayer_ReturnValue_1) == 0x000329, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_CheckVisibilityToLocalPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_DynamicCast_AsBP_Tgf_Character_Default) == 0x000330, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_DynamicCast_AsBP_Tgf_Character_Default' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_DynamicCast_bSuccess) == 0x000338, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_CheckSoulHarvest_Result) == 0x000339, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_CheckSoulHarvest_Result' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_DynamicCast_AsLyra_Character) == 0x000340, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_DynamicCast_bSuccess_1) == 0x000348, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_GetLyraAbilitySystemComponent_ReturnValue) == 0x000350, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_GetLyraAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsValid_ReturnValue_4) == 0x000358, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_CreateDelegate_OutputDelegate_1) == 0x00035C, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000370, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000378, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000388, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00038C, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000398, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0003B0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x0003B8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsValidClass_ReturnValue) == 0x0003C0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BooleanAND_ReturnValue) == 0x0003C1, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x0003C4, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_DynamicCast_AsLyra_Character_1) == 0x0003C8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_DynamicCast_AsLyra_Character_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, K2Node_DynamicCast_bSuccess_2) == 0x0003D0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsDeadOrDying_ReturnValue) == 0x0003D1, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_IsSoulEnergyFull_ReturnValue) == 0x0003D2, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_IsSoulEnergyFull_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_GetActorLocation_ReturnValue_8) == 0x0003D8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_GetActorLocation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BreakVector_X_1) == 0x0003F0, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BreakVector_Y_1) == 0x0003F8, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_BreakVector_Z_1) == 0x000400, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000408, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Vector_Distance_ReturnValue_1) == 0x000410, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Abs_ReturnValue) == 0x000418, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000420, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000421, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000422, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000424, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast) == 0x000428, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x00042C, "Member 'B_TGF_Soul_C_ExecuteUbergraph_B_TGF_Soul::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function B_TGF_Soul.B_TGF_Soul_C.MoveToTarget
// 0x0008 (0x0008 - 0x0000)
struct B_TGF_Soul_C_MoveToTarget final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Soul_C_MoveToTarget) == 0x000008, "Wrong alignment on B_TGF_Soul_C_MoveToTarget");
static_assert(sizeof(B_TGF_Soul_C_MoveToTarget) == 0x000008, "Wrong size on B_TGF_Soul_C_MoveToTarget");
static_assert(offsetof(B_TGF_Soul_C_MoveToTarget, TargetActor) == 0x000000, "Member 'B_TGF_Soul_C_MoveToTarget::TargetActor' has a wrong offset!");

// Function B_TGF_Soul.B_TGF_Soul_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_TGF_Soul_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Soul_C_ReceiveTick) == 0x000004, "Wrong alignment on B_TGF_Soul_C_ReceiveTick");
static_assert(sizeof(B_TGF_Soul_C_ReceiveTick) == 0x000004, "Wrong size on B_TGF_Soul_C_ReceiveTick");
static_assert(offsetof(B_TGF_Soul_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_TGF_Soul_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

