#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TGF_GameMode_Onboarding

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_TGF_GameMode_Onboarding.B_TGF_GameMode_Onboarding_C.ExecuteUbergraph_B_TGF_GameMode_Onboarding
// 0x0020 (0x0020 - 0x0000)
struct B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ParseOption_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding) == 0x000008, "Wrong alignment on B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding");
static_assert(sizeof(B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding) == 0x000020, "Wrong size on B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding");
static_assert(offsetof(B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding, EntryPoint) == 0x000000, "Member 'B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding, CallFunc_ParseOption_ReturnValue) == 0x000008, "Member 'B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding::CallFunc_ParseOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000018, "Member 'B_TGF_GameMode_Onboarding_C_ExecuteUbergraph_B_TGF_GameMode_Onboarding::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");

}

