#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TGF_WeaponInstance_Anim_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function B_TGF_WeaponInstance_Anim_Base.B_TGF_WeaponInstance_Anim_Base_C.DetermineCosmeticTags
// 0x0048 (0x0048 - 0x0000)
struct B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags final
{
public:
	class ULyraPawnComponent_CharacterParts*      CosmeticComponent;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetCombinedTags_ReturnValue;              // 0x0008(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraPawnComponent_CharacterParts*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags) == 0x000008, "Wrong alignment on B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags");
static_assert(sizeof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags) == 0x000048, "Wrong size on B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags, CosmeticComponent) == 0x000000, "Member 'B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags::CosmeticComponent' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags, CallFunc_GetCombinedTags_ReturnValue) == 0x000008, "Member 'B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags::CallFunc_GetCombinedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags, CallFunc_GetPawn_ReturnValue) == 0x000030, "Member 'B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'B_TGF_WeaponInstance_Anim_Base_C_DetermineCosmeticTags::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function B_TGF_WeaponInstance_Anim_Base.B_TGF_WeaponInstance_Anim_Base_C.ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base
// 0x0338 (0x0338 - 0x0000)
struct B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnDedicatedServer_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            CallFunc_GetTypedPawn_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimInstance>              CallFunc_PickBestAnimLayer_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            CallFunc_GetTypedPawn_ReturnValue_1;               // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3;  // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_3;     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_4;  // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_4;     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_5;  // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_5;     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              CallFunc_PickBestAnimLayer_ReturnValue_1;          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0234(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x023C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0244(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            CallFunc_GetTypedPawn_ReturnValue_2;               // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_6;  // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_6;     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_7;  // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_7;     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_8;  // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_8;     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              CallFunc_PickBestAnimLayer_ReturnValue_2;          // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_2;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x02E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x02EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x02F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0304(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickBestEquipMontage_isRight;             // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_316[0x2];                                      // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickBestEquipMontage_ReturnValue;         // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_IsDead;                     // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_IsDead_1;                   // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_IsDead_2;                   // 0x0336(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base) == 0x000008, "Wrong alignment on B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base");
static_assert(sizeof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base) == 0x000338, "Wrong size on B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, EntryPoint) == 0x000000, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsOnDedicatedServer_ReturnValue) == 0x000004, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsOnDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_9) == 0x000018, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_8) == 0x000020, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_7) == 0x000038, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_6) == 0x000050, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_5) == 0x000068, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, Temp_name_Variable) == 0x000080, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_5) == 0x000088, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_4) == 0x000098, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_3) == 0x0000A0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_2) == 0x0000B8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_1) == 0x0000D0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000D8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName) == 0x0000E8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000F0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, Temp_name_Variable_1) == 0x000100, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetTypedPawn_ReturnValue) == 0x000108, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetTypedPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000118, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000128, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000138, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000140, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000150, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000158, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000168, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_BooleanOR_ReturnValue) == 0x000169, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_Not_PreBool_ReturnValue) == 0x00016A, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_BooleanOR_ReturnValue_1) == 0x00016B, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000170, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_2) == 0x000178, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetAnimInstance_ReturnValue) == 0x000180, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_12) == 0x000188, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_PickBestAnimLayer_ReturnValue) == 0x000190, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_PickBestAnimLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, Temp_name_Variable_2) == 0x000198, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValidClass_ReturnValue) == 0x0001A0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetTypedPawn_ReturnValue_1) == 0x0001A8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetTypedPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001B0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_3) == 0x0001C0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0001C8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_4) == 0x0001D0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0001D8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_3) == 0x0001E0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_3) == 0x0001F0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_4) == 0x0001F8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_4' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_4) == 0x000208, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_5) == 0x000210, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_5' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_5) == 0x000220, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_BooleanOR_ReturnValue_2) == 0x000221, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x000222, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_BooleanOR_ReturnValue_3) == 0x000223, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_PickBestAnimLayer_ReturnValue_1) == 0x000228, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_PickBestAnimLayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValidClass_ReturnValue_1) == 0x000230, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_13) == 0x000234, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_10) == 0x00023C, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_11) == 0x000244, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetTypedPawn_ReturnValue_2) == 0x000258, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetTypedPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_12) == 0x000260, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_5) == 0x000270, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000278, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_6) == 0x000280, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000288, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_6) == 0x000290, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_6' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_6) == 0x0002A0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_7) == 0x0002A8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_7' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_7) == 0x0002B8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_self_CastInput_8) == 0x0002C0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_self_CastInput_8' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_HasMatchingGameplayTag_ReturnValue_8) == 0x0002D0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_HasMatchingGameplayTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_BooleanOR_ReturnValue_4) == 0x0002D1, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002D2, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_BooleanOR_ReturnValue_5) == 0x0002D3, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_PickBestAnimLayer_ReturnValue_2) == 0x0002D8, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_PickBestAnimLayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValidClass_ReturnValue_2) == 0x0002E0, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValidClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_14) == 0x0002E4, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CustomEvent_NotifyName_11) == 0x0002EC, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_13) == 0x0002F4, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, K2Node_CreateDelegate_OutputDelegate_14) == 0x000304, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_7) == 0x000314, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_PickBestEquipMontage_isRight) == 0x000315, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_PickBestEquipMontage_isRight' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_PickBestEquipMontage_ReturnValue) == 0x000318, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_PickBestEquipMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000320, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2) == 0x000328, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_8) == 0x000330, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_9) == 0x000331, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_10) == 0x000332, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsValid_ReturnValue_11) == 0x000333, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsDeadOrDying_IsDead) == 0x000334, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsDeadOrDying_IsDead' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsDeadOrDying_IsDead_1) == 0x000335, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsDeadOrDying_IsDead_1' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base, CallFunc_IsDeadOrDying_IsDead_2) == 0x000336, "Member 'B_TGF_WeaponInstance_Anim_Base_C_ExecuteUbergraph_B_TGF_WeaponInstance_Anim_Base::CallFunc_IsDeadOrDying_IsDead_2' has a wrong offset!");

// Function B_TGF_WeaponInstance_Anim_Base.B_TGF_WeaponInstance_Anim_Base_C.IsDeadOrDying
// 0x0018 (0x0018 - 0x0000)
struct B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying final
{
public:
	bool                                          IsDead;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetTypedPawn_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfDeathState                                CallFunc_GetDeathState_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying) == 0x000008, "Wrong alignment on B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying");
static_assert(sizeof(B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying) == 0x000018, "Wrong size on B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying, IsDead) == 0x000000, "Member 'B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying::IsDead' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying, CallFunc_GetTypedPawn_ReturnValue) == 0x000008, "Member 'B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying::CallFunc_GetTypedPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying, CallFunc_GetDeathState_ReturnValue) == 0x000011, "Member 'B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying::CallFunc_GetDeathState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'B_TGF_WeaponInstance_Anim_Base_C_IsDeadOrDying::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function B_TGF_WeaponInstance_Anim_Base.B_TGF_WeaponInstance_Anim_Base_C.OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554
// 0x0008 (0x0008 - 0x0000)
struct B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554) == 0x000004, "Wrong alignment on B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554");
static_assert(sizeof(B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554) == 0x000008, "Wrong size on B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554");
static_assert(offsetof(B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554, NotifyName) == 0x000000, "Member 'B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B8981E6E554::NotifyName' has a wrong offset!");

// Function B_TGF_WeaponInstance_Anim_Base.B_TGF_WeaponInstance_Anim_Base_C.OnBlendOut_9C8FD1704F365F705D5E0B89EE0057BA
// 0x0008 (0x0008 - 0x0000)
struct B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B89EE0057BA final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B89EE0057BA) == 0x000004, "Wrong alignment on B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B89EE0057BA");
static_assert(sizeof(B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B89EE0057BA) == 0x000008, "Wrong size on B_TGF_WeaponInstance_Anim_Base_C_OnBlendOut_9C8FD1704F365F705D5E0B89EE0057BA");
