#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TGF_Static_OverlapCheck_ProjectileBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function B_TGF_Static_OverlapCheck_ProjectileBase.B_TGF_Static_OverlapCheck_ProjectileBase_C.ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase
// 0x02F0 (0x02F0 - 0x0000)
struct B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_GetCheckResult_Hits;                      // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_GetCheckResult_Result;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExecuteActionImp_ReturnValue;             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase) == 0x000008, "Wrong alignment on B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase");
static_assert(sizeof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase) == 0x0002F0, "Wrong size on B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, EntryPoint) == 0x000000, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, Temp_delegate_Variable) == 0x000004, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, Temp_int_Array_Index_Variable) == 0x000018, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_HasAuthority_ReturnValue) == 0x00001C, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_GetCheckResult_Hits) == 0x000020, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_GetCheckResult_Hits' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_GetCheckResult_Result) == 0x000030, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_GetCheckResult_Result' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Array_Get_Item) == 0x000038, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, K2Node_CreateDelegate_OutputDelegate) == 0x000124, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000134, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000138, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000140, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000150, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000158, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_HasAuthority_ReturnValue_1) == 0x000159, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000160, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakVector_X) == 0x000178, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakVector_Y) == 0x000180, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakVector_Z) == 0x000188, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_bBlockingHit) == 0x000190, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_bInitialOverlap) == 0x000191, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_Time) == 0x000194, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_Distance) == 0x000198, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_Location) == 0x0001A0, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B8, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_Normal) == 0x0001D0, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E8, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_PhysMat) == 0x000200, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_HitActor) == 0x000208, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_HitComponent) == 0x000210, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_HitBoneName) == 0x000218, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_BoneName) == 0x000220, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_TraceStart) == 0x000238, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakHitResult_TraceEnd) == 0x000250, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000268, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakVector_X_1) == 0x000280, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakVector_Y_1) == 0x000288, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BreakVector_Z_1) == 0x000290, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000298, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Abs_ReturnValue) == 0x0002A0, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0002A8, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002A9, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_BooleanOR_ReturnValue) == 0x0002AA, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0002B0, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_CompareTeams_TeamIdA) == 0x0002B8, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_CompareTeams_TeamIdB) == 0x0002BC, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_CompareTeams_ReturnValue) == 0x0002C0, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002C1, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, K2Node_SwitchEnum_CmpSuccess) == 0x0002C2, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0002C3, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Array_Contains_ReturnValue) == 0x0002C4, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Array_Add_ReturnValue) == 0x0002C8, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, K2Node_Event_EndPlayReason) == 0x0002CC, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_PostAkEvent_ReturnValue) == 0x0002D0, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, Temp_int_Loop_Counter_Variable) == 0x0002D4, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_ExecuteActionImp_ReturnValue) == 0x0002D8, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_ExecuteActionImp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Less_IntInt_ReturnValue) == 0x0002DC, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Add_IntInt_ReturnValue) == 0x0002E0, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_Delay_Duration_ImplicitCast) == 0x0002E4, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002E8, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x0002EC, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ExecuteUbergraph_B_TGF_Static_OverlapCheck_ProjectileBase::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function B_TGF_Static_OverlapCheck_ProjectileBase.B_TGF_Static_OverlapCheck_ProjectileBase_C.GetCheckResult
// 0x0070 (0x0070 - 0x0000)
struct B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult final
{
public:
	TArray<struct FHitResult>                     Hits;                                              // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMulti_OutHits;                // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMulti_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult) == 0x000008, "Wrong alignment on B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult");
static_assert(sizeof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult) == 0x000070, "Wrong size on B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult, Hits) == 0x000000, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult::Hits' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult, Result) == 0x000010, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult::Result' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult, Temp_object_Variable) == 0x000018, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult, CallFunc_CapsuleTraceMulti_OutHits) == 0x000058, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult::CallFunc_CapsuleTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult, CallFunc_CapsuleTraceMulti_ReturnValue) == 0x000068, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_GetCheckResult::CallFunc_CapsuleTraceMulti_ReturnValue' has a wrong offset!");

// Function B_TGF_Static_OverlapCheck_ProjectileBase.B_TGF_Static_OverlapCheck_ProjectileBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct B_TGF_Static_OverlapCheck_ProjectileBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on B_TGF_Static_OverlapCheck_ProjectileBase_C_ReceiveEndPlay");
static_assert(sizeof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ReceiveEndPlay) == 0x000001, "Wrong size on B_TGF_Static_OverlapCheck_ProjectileBase_C_ReceiveEndPlay");
static_assert(offsetof(B_TGF_Static_OverlapCheck_ProjectileBase_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'B_TGF_Static_OverlapCheck_ProjectileBase_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

