#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Torch_001

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "LyraGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_TGF_MeleeWeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Torch_001.B_Torch_001_C
// 0x00A0 (0x0850 - 0x07B0)
class AB_Torch_001_C final : public AB_TGF_MeleeWeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Torch_001_C;                      // 0x07A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTgfCollectableLightComponent*          TgfCollectableLight;                               // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VFX;                                               // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AkAudio;                                           // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Torch_Handheld_01;                              // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TimelineTorchRange_TorchRange_24EEBB9D412BE78491FD7BB7EC43415A; // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimelineTorchRange__Direction_24EEBB9D412BE78491FD7BB7EC43415A; // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E5[0x3];                                      // 0x07E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimelineTorchRange;                                // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TimelineBrighten_TorchIntensity_B0360F4C4152913BC83ED2A325564979; // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimelineBrighten__Direction_B0360F4C4152913BC83ED2A325564979; // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F5[0x3];                                      // 0x07F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimelineBrighten;                                  // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Torch;                                         // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MID_Emissive_Color;                                // 0x0808(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      TorchMaterial;                                     // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTorchParam>                    TorchParameters;                                   // 0x0820(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTorchParam                            CurParam;                                          // 0x0830(0x0014)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AudioActive();
	void AudioDeactive();
	void BndEvt__B_Torch_001_AkAudio_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature(class UActorComponent* Component, bool bReset);
	void BndEvt__B_Torch_001_AkAudio_K2Node_ComponentBoundEvent_1_ActorComponentDeactivateSignature__DelegateSignature(class UActorComponent* Component);
	void DoBrighten();
	void DoDarken();
	void ExecuteUbergraph_B_Torch_001(int32 EntryPoint);
	class USkeletalMeshComponent* GetMesh();
	void K2_OnWeaponVisibleChanged(bool Visiblity);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RecoverBrighten();
	void Set_Light_Intensity(double Alpha);
	void ShutDownPLShadow();
	void TimelineBrighten__FinishedFunc();
	void TimelineBrighten__UpdateFunc();
	void TimelineTorchRange__FinishedFunc();
	void TimelineTorchRange__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Torch_001_C">();
	}
	static class AB_Torch_001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Torch_001_C>();
	}
};
static_assert(alignof(AB_Torch_001_C) == 0x000010, "Wrong alignment on AB_Torch_001_C");
static_assert(sizeof(AB_Torch_001_C) == 0x000850, "Wrong size on AB_Torch_001_C");
static_assert(offsetof(AB_Torch_001_C, UberGraphFrame_B_Torch_001_C) == 0x0007A8, "Member 'AB_Torch_001_C::UberGraphFrame_B_Torch_001_C' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TgfCollectableLight) == 0x0007B0, "Member 'AB_Torch_001_C::TgfCollectableLight' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, VFX) == 0x0007B8, "Member 'AB_Torch_001_C::VFX' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, SpotLight) == 0x0007C0, "Member 'AB_Torch_001_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, AkAudio) == 0x0007C8, "Member 'AB_Torch_001_C::AkAudio' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, PointLight) == 0x0007D0, "Member 'AB_Torch_001_C::PointLight' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, SM_Torch_Handheld_01) == 0x0007D8, "Member 'AB_Torch_001_C::SM_Torch_Handheld_01' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TimelineTorchRange_TorchRange_24EEBB9D412BE78491FD7BB7EC43415A) == 0x0007E0, "Member 'AB_Torch_001_C::TimelineTorchRange_TorchRange_24EEBB9D412BE78491FD7BB7EC43415A' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TimelineTorchRange__Direction_24EEBB9D412BE78491FD7BB7EC43415A) == 0x0007E4, "Member 'AB_Torch_001_C::TimelineTorchRange__Direction_24EEBB9D412BE78491FD7BB7EC43415A' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TimelineTorchRange) == 0x0007E8, "Member 'AB_Torch_001_C::TimelineTorchRange' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TimelineBrighten_TorchIntensity_B0360F4C4152913BC83ED2A325564979) == 0x0007F0, "Member 'AB_Torch_001_C::TimelineBrighten_TorchIntensity_B0360F4C4152913BC83ED2A325564979' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TimelineBrighten__Direction_B0360F4C4152913BC83ED2A325564979) == 0x0007F4, "Member 'AB_Torch_001_C::TimelineBrighten__Direction_B0360F4C4152913BC83ED2A325564979' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TimelineBrighten) == 0x0007F8, "Member 'AB_Torch_001_C::TimelineBrighten' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, MID_Torch) == 0x000800, "Member 'AB_Torch_001_C::MID_Torch' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, MID_Emissive_Color) == 0x000808, "Member 'AB_Torch_001_C::MID_Emissive_Color' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TorchMaterial) == 0x000818, "Member 'AB_Torch_001_C::TorchMaterial' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, TorchParameters) == 0x000820, "Member 'AB_Torch_001_C::TorchParameters' has a wrong offset!");
static_assert(offsetof(AB_Torch_001_C, CurParam) == 0x000830, "Member 'AB_Torch_001_C::CurParam' has a wrong offset!");

}

