#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_WeaponBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function B_WeaponBase.B_WeaponBase_C.ExecuteUbergraph_B_WeaponBase
// 0x0004 (0x0004 - 0x0000)
struct B_WeaponBase_C_ExecuteUbergraph_B_WeaponBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WeaponBase_C_ExecuteUbergraph_B_WeaponBase) == 0x000004, "Wrong alignment on B_WeaponBase_C_ExecuteUbergraph_B_WeaponBase");
static_assert(sizeof(B_WeaponBase_C_ExecuteUbergraph_B_WeaponBase) == 0x000004, "Wrong size on B_WeaponBase_C_ExecuteUbergraph_B_WeaponBase");
static_assert(offsetof(B_WeaponBase_C_ExecuteUbergraph_B_WeaponBase, EntryPoint) == 0x000000, "Member 'B_WeaponBase_C_ExecuteUbergraph_B_WeaponBase::EntryPoint' has a wrong offset!");

// Function B_WeaponBase.B_WeaponBase_C.IsFirstPersonActor
// 0x0050 (0x0050 - 0x0000)
struct B_WeaponBase_C_IsFirstPersonActor final
{
public:
	bool                                          bRet;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraPawnComponent_CharacterParts*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetCombinedTags_ReturnValue;              // 0x0028(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WeaponBase_C_IsFirstPersonActor) == 0x000008, "Wrong alignment on B_WeaponBase_C_IsFirstPersonActor");
static_assert(sizeof(B_WeaponBase_C_IsFirstPersonActor) == 0x000050, "Wrong size on B_WeaponBase_C_IsFirstPersonActor");
static_assert(offsetof(B_WeaponBase_C_IsFirstPersonActor, bRet) == 0x000000, "Member 'B_WeaponBase_C_IsFirstPersonActor::bRet' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_IsFirstPersonActor, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'B_WeaponBase_C_IsFirstPersonActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_IsFirstPersonActor, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'B_WeaponBase_C_IsFirstPersonActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_IsFirstPersonActor, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'B_WeaponBase_C_IsFirstPersonActor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_IsFirstPersonActor, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'B_WeaponBase_C_IsFirstPersonActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_IsFirstPersonActor, CallFunc_GetCombinedTags_ReturnValue) == 0x000028, "Member 'B_WeaponBase_C_IsFirstPersonActor::CallFunc_GetCombinedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_IsFirstPersonActor, CallFunc_HasTag_ReturnValue) == 0x000048, "Member 'B_WeaponBase_C_IsFirstPersonActor::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function B_WeaponBase.B_WeaponBase_C.RenderStaticForOneBoneMesh
// 0x0010 (0x0010 - 0x0000)
struct B_WeaponBase_C_RenderStaticForOneBoneMesh final
{
public:
	class USkeletalMeshComponent*                 InMeshComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumBones_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_WeaponBase_C_RenderStaticForOneBoneMesh) == 0x000008, "Wrong alignment on B_WeaponBase_C_RenderStaticForOneBoneMesh");
static_assert(sizeof(B_WeaponBase_C_RenderStaticForOneBoneMesh) == 0x000010, "Wrong size on B_WeaponBase_C_RenderStaticForOneBoneMesh");
static_assert(offsetof(B_WeaponBase_C_RenderStaticForOneBoneMesh, InMeshComponent) == 0x000000, "Member 'B_WeaponBase_C_RenderStaticForOneBoneMesh::InMeshComponent' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_RenderStaticForOneBoneMesh, CallFunc_GetNumBones_ReturnValue) == 0x000008, "Member 'B_WeaponBase_C_RenderStaticForOneBoneMesh::CallFunc_GetNumBones_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_WeaponBase_C_RenderStaticForOneBoneMesh, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'B_WeaponBase_C_RenderStaticForOneBoneMesh::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

