#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorSpawnSet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActorSpawnSet.BP_ActorSpawnSet_C
// 0x0040 (0x02D8 - 0x0298)
class ABP_ActorSpawnSet_C final : public ATgfModularActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ActorSpawnOptionComponent_C*        ActorSpawnOptionComponent;                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Chance;                                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         AttachedActors;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         SpawnIndex;                                        // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnsPerTick;                                     // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumSpawned;                                        // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ActorSpawnSet(int32 EntryPoint);
	void Spawn(const struct FVector& PlayerLocation, int32 SpawnNumber);
	void SpawnFixedNumberActors(int32 FixedNumber);
	void SpawnOneActor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActorSpawnSet_C">();
	}
	static class ABP_ActorSpawnSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ActorSpawnSet_C>();
	}
};
static_assert(alignof(ABP_ActorSpawnSet_C) == 0x000008, "Wrong alignment on ABP_ActorSpawnSet_C");
static_assert(sizeof(ABP_ActorSpawnSet_C) == 0x0002D8, "Wrong size on ABP_ActorSpawnSet_C");
static_assert(offsetof(ABP_ActorSpawnSet_C, UberGraphFrame) == 0x000298, "Member 'ABP_ActorSpawnSet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ActorSpawnSet_C, ActorSpawnOptionComponent) == 0x0002A0, "Member 'ABP_ActorSpawnSet_C::ActorSpawnOptionComponent' has a wrong offset!");
static_assert(offsetof(ABP_ActorSpawnSet_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_ActorSpawnSet_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ActorSpawnSet_C, Chance) == 0x0002B0, "Member 'ABP_ActorSpawnSet_C::Chance' has a wrong offset!");
static_assert(offsetof(ABP_ActorSpawnSet_C, AttachedActors) == 0x0002B8, "Member 'ABP_ActorSpawnSet_C::AttachedActors' has a wrong offset!");
static_assert(offsetof(ABP_ActorSpawnSet_C, SpawnIndex) == 0x0002C8, "Member 'ABP_ActorSpawnSet_C::SpawnIndex' has a wrong offset!");
static_assert(offsetof(ABP_ActorSpawnSet_C, SpawnsPerTick) == 0x0002CC, "Member 'ABP_ActorSpawnSet_C::SpawnsPerTick' has a wrong offset!");
static_assert(offsetof(ABP_ActorSpawnSet_C, NumSpawned) == 0x0002D0, "Member 'ABP_ActorSpawnSet_C::NumSpawned' has a wrong offset!");

}

