#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Arrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Arrow.BP_Arrow_C.CheckHitInteractEnvironment
// 0x0100 (0x0100 - 0x0000)
struct BP_Arrow_C_CheckHitInteractEnvironment final
{
public:
	struct FHitResult                             Result;                                            // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEnvSurfaceTypeDataAsset*            AllowedSurfaceTypes;                               // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Arrow_C_CheckHitInteractEnvironment) == 0x000008, "Wrong alignment on BP_Arrow_C_CheckHitInteractEnvironment");
static_assert(sizeof(BP_Arrow_C_CheckHitInteractEnvironment) == 0x000100, "Wrong size on BP_Arrow_C_CheckHitInteractEnvironment");
static_assert(offsetof(BP_Arrow_C_CheckHitInteractEnvironment, Result) == 0x000000, "Member 'BP_Arrow_C_CheckHitInteractEnvironment::Result' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_CheckHitInteractEnvironment, ReturnValue) == 0x0000E8, "Member 'BP_Arrow_C_CheckHitInteractEnvironment::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_CheckHitInteractEnvironment, AllowedSurfaceTypes) == 0x0000F0, "Member 'BP_Arrow_C_CheckHitInteractEnvironment::AllowedSurfaceTypes' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_CheckHitInteractEnvironment, CallFunc_GetSurfaceType_ReturnValue) == 0x0000F8, "Member 'BP_Arrow_C_CheckHitInteractEnvironment::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_CheckHitInteractEnvironment, CallFunc_Array_Contains_ReturnValue) == 0x0000F9, "Member 'BP_Arrow_C_CheckHitInteractEnvironment::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function BP_Arrow.BP_Arrow_C.ExecuteUbergraph_BP_Arrow
// 0x0378 (0x0378 - 0x0000)
struct BP_Arrow_C_ExecuteUbergraph_BP_Arrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0020(0x0018)()
	struct FGameplayEffectContextHandle           K2Node_SetFieldsInStruct_StructOut;                // 0x0038(0x0018)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Speed;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0150(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CheckHitInteractEnvironment_ReturnValue;  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23B[0x1];                                      // 0x023B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0336(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337[0x1];                                      // 0x0337(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default;     // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0354(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ExecuteActionImp_ReturnValue;             // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow) == 0x000008, "Wrong alignment on BP_Arrow_C_ExecuteUbergraph_BP_Arrow");
static_assert(sizeof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow) == 0x000378, "Wrong size on BP_Arrow_C_ExecuteUbergraph_BP_Arrow");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, EntryPoint) == 0x000000, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_MakeEffectContext_ReturnValue) == 0x000020, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_SetFieldsInStruct_StructOut) == 0x000038, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, Temp_delegate_Variable) == 0x000050, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, Temp_delegate_Variable_1) == 0x000060, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_CustomEvent_Speed) == 0x000070, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_CustomEvent_Speed' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_GetActorForwardVector_ReturnValue) == 0x000078, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000090, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValidClass_ReturnValue) == 0x0000C0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000C4, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_GetGameState_ReturnValue_1) == 0x0000D0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0000D8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValidClass_ReturnValue_1) == 0x0000E1, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_MyComp) == 0x0000E8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_Other) == 0x0000F0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_OtherComp) == 0x0000F8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_bSelfMoved) == 0x000100, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_HitLocation) == 0x000108, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_HitNormal) == 0x000120, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_NormalImpulse) == 0x000138, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_Hit) == 0x000150, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_CheckHitInteractEnvironment_ReturnValue) == 0x000238, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_CheckHitInteractEnvironment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_bBlockingHit) == 0x000239, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_bInitialOverlap) == 0x00023A, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_Time) == 0x00023C, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_Distance) == 0x000240, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_Location) == 0x000248, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_ImpactPoint) == 0x000260, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_Normal) == 0x000278, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_ImpactNormal) == 0x000290, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_PhysMat) == 0x0002A8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_HitActor) == 0x0002B0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_HitComponent) == 0x0002B8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_HitBoneName) == 0x0002C0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_BoneName) == 0x0002C8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_HitItem) == 0x0002D0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_ElementIndex) == 0x0002D4, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_FaceIndex) == 0x0002D8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_TraceStart) == 0x0002E0, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BreakHitResult_TraceEnd) == 0x0002F8, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000310, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_DynamicCast_bSuccess) == 0x000318, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_NotEqual_NameName_ReturnValue) == 0x000319, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_Conv_NameToString_ReturnValue) == 0x000320, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_Contains_ReturnValue) == 0x000330, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_Contains_ReturnValue_1) == 0x000331, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_Not_PreBool_ReturnValue) == 0x000332, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_Not_PreBool_ReturnValue_1) == 0x000333, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BooleanAND_ReturnValue) == 0x000334, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_ObjectIsA_ReturnValue) == 0x000335, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BooleanAND_ReturnValue_1) == 0x000336, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_DynamicCast_AsBP_Tgf_Character_Default) == 0x000338, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_DynamicCast_AsBP_Tgf_Character_Default' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_DynamicCast_bSuccess_1) == 0x000340, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_HasAuthority_ReturnValue_1) == 0x000341, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000348, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValid_ReturnValue_1) == 0x000350, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000354, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_HasAuthority_ReturnValue_2) == 0x00035C, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValid_ReturnValue_2) == 0x00035D, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_PostAkEvent_ReturnValue) == 0x000360, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValid_ReturnValue_3) == 0x000364, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_ExecuteActionImp_ReturnValue) == 0x000368, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_ExecuteActionImp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, K2Node_Event_EndPlayReason) == 0x00036C, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValid_ReturnValue_4) == 0x00036D, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_PostAkEvent_ReturnValue_1) == 0x000370, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ExecuteUbergraph_BP_Arrow, CallFunc_IsValid_ReturnValue_5) == 0x000374, "Member 'BP_Arrow_C_ExecuteUbergraph_BP_Arrow::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function BP_Arrow.BP_Arrow_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Arrow_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Arrow_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Arrow_C_ReceiveEndPlay");
static_assert(sizeof(BP_Arrow_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Arrow_C_ReceiveEndPlay");
static_assert(offsetof(BP_Arrow_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Arrow_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Arrow.BP_Arrow_C.ReceiveHit
// 0x0150 (0x0150 - 0x0000)
struct BP_Arrow_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0068(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Arrow_C_ReceiveHit) == 0x000008, "Wrong alignment on BP_Arrow_C_ReceiveHit");
static_assert(sizeof(BP_Arrow_C_ReceiveHit) == 0x000150, "Wrong size on BP_Arrow_C_ReceiveHit");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, MyComp) == 0x000000, "Member 'BP_Arrow_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, Other) == 0x000008, "Member 'BP_Arrow_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BP_Arrow_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BP_Arrow_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, HitLocation) == 0x000020, "Member 'BP_Arrow_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, HitNormal) == 0x000038, "Member 'BP_Arrow_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, NormalImpulse) == 0x000050, "Member 'BP_Arrow_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_Arrow_C_ReceiveHit, Hit) == 0x000068, "Member 'BP_Arrow_C_ReceiveHit::Hit' has a wrong offset!");

// Function BP_Arrow.BP_Arrow_C.SetArrowSpeed
// 0x0008 (0x0008 - 0x0000)
struct BP_Arrow_C_SetArrowSpeed final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Arrow_C_SetArrowSpeed) == 0x000008, "Wrong alignment on BP_Arrow_C_SetArrowSpeed");
static_assert(sizeof(BP_Arrow_C_SetArrowSpeed) == 0x000008, "Wrong size on BP_Arrow_C_SetArrowSpeed");
static_assert(offsetof(BP_Arrow_C_SetArrowSpeed, Speed) == 0x000000, "Member 'BP_Arrow_C_SetArrowSpeed::Speed' has a wrong offset!");

}

