#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorSpawnRoom

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ActorSpawnRoom.BP_ActorSpawnRoom_C.BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_ActorSpawnRoom_C_BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature final
{
public:
	struct FVector                                PlayerLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnRoom_C_BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature) == 0x000008, "Wrong alignment on BP_ActorSpawnRoom_C_BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature");
static_assert(sizeof(BP_ActorSpawnRoom_C_BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature) == 0x000018, "Wrong size on BP_ActorSpawnRoom_C_BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature");
static_assert(offsetof(BP_ActorSpawnRoom_C_BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature, PlayerLocation) == 0x000000, "Member 'BP_ActorSpawnRoom_C_BndEvt__BP_ActorSpawnRoom_PlayerDistanceChecker_K2Node_ComponentBoundEvent_1_Event_SomePlayerComesClose__DelegateSignature::PlayerLocation' has a wrong offset!");

// Function BP_ActorSpawnRoom.BP_ActorSpawnRoom_C.ExecuteUbergraph_BP_ActorSpawnRoom
// 0x0110 (0x0110 - 0x0000)
struct BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_LevelReady*                CallFunc_WaitForLevelReady_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_PlayerLocation;                 // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0070(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ActorSpawnSet_C*                    K2Node_DynamicCast_AsBP_Actor_Spawn_Set;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSpawn_Result;                          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_PlayerLocation;         // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSpawn_Result_1;                        // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PhaseTag;                       // 0x00C0(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraGamePhaseSubsystem*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayTag& PhaseTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ExperienceReady*           CallFunc_WaitForExperienceReady_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom) == 0x000008, "Wrong alignment on BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom");
static_assert(sizeof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom) == 0x000110, "Wrong size on BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, EntryPoint) == 0x000000, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_WaitForLevelReady_ReturnValue) == 0x000018, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_WaitForLevelReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, Temp_int_Variable) == 0x00002C, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, Temp_int_Variable_1) == 0x000034, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_CustomEvent_PlayerLocation) == 0x000040, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_CustomEvent_PlayerLocation' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_GetAttachedActors_OutActors) == 0x000070, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_DynamicCast_AsBP_Actor_Spawn_Set) == 0x000090, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_DynamicCast_AsBP_Actor_Spawn_Set' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_CanSpawn_Result) == 0x00009A, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_CanSpawn_Result' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Add_IntInt_ReturnValue_2) == 0x00009C, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_ComponentBoundEvent_PlayerLocation) == 0x0000A0, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_ComponentBoundEvent_PlayerLocation' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_HasAuthority_ReturnValue_1) == 0x0000B8, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_CanSpawn_Result_1) == 0x0000B9, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_CanSpawn_Result_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_CustomEvent_PhaseTag) == 0x0000C0, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_CustomEvent_PhaseTag' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Divide_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000D0, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Percent_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000DC, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E4, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000E5, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0000E8, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F0, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_WaitForExperienceReady_ReturnValue) == 0x000100, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_WaitForExperienceReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000109, "Member 'BP_ActorSpawnRoom_C_ExecuteUbergraph_BP_ActorSpawnRoom::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ActorSpawnRoom.BP_ActorSpawnRoom_C.Spawn
// 0x0018 (0x0018 - 0x0000)
struct BP_ActorSpawnRoom_C_Spawn final
{
public:
	struct FVector                                PlayerLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnRoom_C_Spawn) == 0x000008, "Wrong alignment on BP_ActorSpawnRoom_C_Spawn");
static_assert(sizeof(BP_ActorSpawnRoom_C_Spawn) == 0x000018, "Wrong size on BP_ActorSpawnRoom_C_Spawn");
static_assert(offsetof(BP_ActorSpawnRoom_C_Spawn, PlayerLocation) == 0x000000, "Member 'BP_ActorSpawnRoom_C_Spawn::PlayerLocation' has a wrong offset!");

// Function BP_ActorSpawnRoom.BP_ActorSpawnRoom_C.SpawnOneSet
// 0x0098 (0x0098 - 0x0000)
struct BP_ActorSpawnRoom_C_SpawnOneSet final
{
public:
	struct FVector                                PlayerLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnNumber;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TotalChance;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ActorSpawnSet_C*                    CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ActorSpawnSet_C*                    CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnRoom_C_SpawnOneSet) == 0x000008, "Wrong alignment on BP_ActorSpawnRoom_C_SpawnOneSet");
static_assert(sizeof(BP_ActorSpawnRoom_C_SpawnOneSet) == 0x000098, "Wrong size on BP_ActorSpawnRoom_C_SpawnOneSet");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, PlayerLocation) == 0x000000, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::PlayerLocation' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, SpawnNumber) == 0x000018, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::SpawnNumber' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, TotalChance) == 0x000020, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::TotalChance' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Array_RemoveItem_ReturnValue) == 0x000060, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_RandomFloat_ReturnValue) == 0x000080, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_SpawnOneSet, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_ActorSpawnRoom_C_SpawnOneSet::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_ActorSpawnRoom.BP_ActorSpawnRoom_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_ActorSpawnRoom_C_UserConstructionScript final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnRoom_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ActorSpawnRoom_C_UserConstructionScript");
static_assert(sizeof(BP_ActorSpawnRoom_C_UserConstructionScript) == 0x000010, "Wrong size on BP_ActorSpawnRoom_C_UserConstructionScript");
static_assert(offsetof(BP_ActorSpawnRoom_C_UserConstructionScript, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_ActorSpawnRoom_C_UserConstructionScript::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'BP_ActorSpawnRoom_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnRoom_C_UserConstructionScript, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x00000C, "Member 'BP_ActorSpawnRoom_C_UserConstructionScript::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");

// Function BP_ActorSpawnRoom.BP_ActorSpawnRoom_C.WhenPhaseStarts
// 0x0008 (0x0008 - 0x0000)
struct BP_ActorSpawnRoom_C_WhenPhaseStarts final
{
public:
	struct FGameplayTag                           PhaseTag;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnRoom_C_WhenPhaseStarts) == 0x000004, "Wrong alignment on BP_ActorSpawnRoom_C_WhenPhaseStarts");
static_assert(sizeof(BP_ActorSpawnRoom_C_WhenPhaseStarts) == 0x000008, "Wrong size on BP_ActorSpawnRoom_C_WhenPhaseStarts");
static_assert(offsetof(BP_ActorSpawnRoom_C_WhenPhaseStarts, PhaseTag) == 0x000000, "Member 'BP_ActorSpawnRoom_C_WhenPhaseStarts::PhaseTag' has a wrong offset!");

}

