#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorSpawnPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"
#include "FActorSpawn_structs.hpp"


namespace SDK::Params
{

// Function BP_ActorSpawnPoint.BP_ActorSpawnPoint_C.AddToSpawnedActors
// 0x0028 (0x0028 - 0x0000)
struct BP_ActorSpawnPoint_C_AddToSpawnedActors final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnPoint_C_AddToSpawnedActors) == 0x000008, "Wrong alignment on BP_ActorSpawnPoint_C_AddToSpawnedActors");
static_assert(sizeof(BP_ActorSpawnPoint_C_AddToSpawnedActors) == 0x000028, "Wrong size on BP_ActorSpawnPoint_C_AddToSpawnedActors");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, Actor) == 0x000000, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::Actor' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_AddToSpawnedActors, CallFunc_Array_RemoveItem_ReturnValue) == 0x000026, "Member 'BP_ActorSpawnPoint_C_AddToSpawnedActors::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function BP_ActorSpawnPoint.BP_ActorSpawnPoint_C.BroadcastMonsterSpawningMessage
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage final
{
public:
	struct FGameplayTag                           Channel;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      Monster;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       K2Node_MakeStruct_LyraVerbMessage;                 // 0x0020(0x0080)()
};
static_assert(alignof(BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage) == 0x000008, "Wrong alignment on BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage");
static_assert(sizeof(BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage) == 0x0000A0, "Wrong size on BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage");
static_assert(offsetof(BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage, Channel) == 0x000000, "Member 'BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage::Channel' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage, Monster) == 0x000008, "Member 'BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage::Monster' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage, K2Node_MakeStruct_LyraVerbMessage) == 0x000020, "Member 'BP_ActorSpawnPoint_C_BroadcastMonsterSpawningMessage::K2Node_MakeStruct_LyraVerbMessage' has a wrong offset!");

// Function BP_ActorSpawnPoint.BP_ActorSpawnPoint_C.ChooseRowFromDataTable
// 0x0120 (0x0120 - 0x0000)
struct BP_ActorSpawnPoint_C_ChooseRowFromDataTable final
{
public:
	struct FFActorSpawn                           Out_Row;                                           // 0x0000(0x0030)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	double                                        Roll;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalChance;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0060(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFActorSpawn                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0030)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFActorSpawn                           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00B8(0x0030)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable) == 0x000008, "Wrong alignment on BP_ActorSpawnPoint_C_ChooseRowFromDataTable");
static_assert(sizeof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable) == 0x000120, "Wrong size on BP_ActorSpawnPoint_C_ChooseRowFromDataTable");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, Out_Row) == 0x000000, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::Out_Row' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, Roll) == 0x000030, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::Roll' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, TotalChance) == 0x000038, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::TotalChance' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, Temp_bool_True_if_break_was_hit_Variable) == 0x00004C, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Not_PreBool_ReturnValue) == 0x000054, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000055, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000060, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B0, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000B8, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000E8, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0000F8, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Array_Length_ReturnValue_1) == 0x000104, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Less_IntInt_ReturnValue_1) == 0x000109, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_BooleanAND_ReturnValue) == 0x00010A, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Add_IntInt_ReturnValue_1) == 0x00010C, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_RandomFloat_ReturnValue) == 0x000110, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ChooseRowFromDataTable, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000118, "Member 'BP_ActorSpawnPoint_C_ChooseRowFromDataTable::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_ActorSpawnPoint.BP_ActorSpawnPoint_C.ExecuteUbergraph_BP_ActorSpawnPoint
// 0x02D0 (0x02D0 - 0x0000)
struct BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugName_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Tgf_Monster;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Monster_C*                      CallFunc_GetClassDefaultObject_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ExperienceReady*           CallFunc_WaitForExperienceReady_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ActorSpawnRoom_C*                   K2Node_DynamicCast_AsBP_Actor_Spawn_Room;          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFActorSpawn                           CallFunc_ChooseRowFromDataTable_Out_Row;           // 0x0158(0x0030)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Tgf_Monster_1;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      CallFunc_GetClassDefaultObject_ReturnValue_1;      // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_2;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AB_LyraGameMode_C*                      K2Node_DynamicCast_AsB_Lyra_Game_Mode;             // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SpawnActor_Result;                        // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AB_LyraGameMode_C*                      K2Node_DynamicCast_AsB_Lyra_Game_Mode_1;           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x026C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnySpawnedActor_ReturnValue;           // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27E[0x2];                                      // 0x027E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugName_ReturnValue_1;               // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_2;        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RetriggerableDelay_Duration_ImplicitCast_1; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint) == 0x000010, "Wrong alignment on BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint");
static_assert(sizeof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint) == 0x0002D0, "Wrong size on BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, EntryPoint) == 0x000000, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetDebugName_ReturnValue) == 0x000008, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetDebugName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_ClassDynamicCast_AsBP_Tgf_Monster) == 0x000028, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_ClassDynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_ClassDynamicCast_bSuccess) == 0x000030, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetClassDefaultObject_ReturnValue) == 0x000038, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetClassDefaultObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_WaitForExperienceReady_ReturnValue) == 0x000040, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_WaitForExperienceReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_HasAuthority_ReturnValue) == 0x000048, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00004A, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_HasAuthority_ReturnValue_1) == 0x00004B, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_BreakTransform_Location) == 0x0000C8, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_BreakTransform_Rotation) == 0x0000E0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_BreakTransform_Scale) == 0x0000F8, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_BreakRotator_Roll) == 0x000110, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_BreakRotator_Pitch) == 0x000114, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_BreakRotator_Yaw) == 0x000118, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, Temp_bool_Has_Been_Initd_Variable) == 0x00011C, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_IsValidClass_ReturnValue) == 0x00011D, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_IsValid_ReturnValue_2) == 0x00011E, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00011F, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000120, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetAttachParentActor_ReturnValue) == 0x000128, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_IsValid_ReturnValue_3) == 0x000130, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Less_IntInt_ReturnValue) == 0x000131, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x000138, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, Temp_bool_IsClosed_Variable) == 0x000140, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_DynamicCast_AsBP_Actor_Spawn_Room) == 0x000148, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_DynamicCast_AsBP_Actor_Spawn_Room' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_ChooseRowFromDataTable_Out_Row) == 0x000158, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_ChooseRowFromDataTable_Out_Row' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000188, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_IsValidClass_ReturnValue_1) == 0x000190, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000198, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0001A0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_MakeRotator_ReturnValue) == 0x0001A8, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_ClassDynamicCast_AsBP_Tgf_Monster_1) == 0x0001C0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_ClassDynamicCast_AsBP_Tgf_Monster_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_ClassDynamicCast_bSuccess_1) == 0x0001C8, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_ClassDynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_MakeTransform_ReturnValue) == 0x0001D0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetClassDefaultObject_ReturnValue_1) == 0x000230, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetClassDefaultObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_IsValidClass_ReturnValue_2) == 0x000238, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_IsValidClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetGameMode_ReturnValue) == 0x000240, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_DynamicCast_AsB_Lyra_Game_Mode) == 0x000248, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_DynamicCast_AsB_Lyra_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_SpawnActor_Result) == 0x000251, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_SpawnActor_Result' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Greater_IntInt_ReturnValue) == 0x000252, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetGameMode_ReturnValue_1) == 0x000258, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_DynamicCast_AsB_Lyra_Game_Mode_1) == 0x000260, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_DynamicCast_AsB_Lyra_Game_Mode_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_DynamicCast_bSuccess_2) == 0x000268, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, K2Node_CreateDelegate_OutputDelegate_1) == 0x00026C, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_HasAnySpawnedActor_ReturnValue) == 0x00027C, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_HasAnySpawnedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Not_PreBool_ReturnValue) == 0x00027D, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_GetDebugName_ReturnValue_1) == 0x000280, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_GetDebugName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000290, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0002A0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0002A8, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_Add_DoubleDouble_B_ImplicitCast_2) == 0x0002B0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_Add_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_RetriggerableDelay_Duration_ImplicitCast) == 0x0002B8, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_RetriggerableDelay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_RetriggerableDelay_Duration_ImplicitCast_1) == 0x0002BC, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_RetriggerableDelay_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0002C0, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0002C4, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0002C8, "Member 'BP_ActorSpawnPoint_C_ExecuteUbergraph_BP_ActorSpawnPoint::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");

// Function BP_ActorSpawnPoint.BP_ActorSpawnPoint_C.GetDisplayText
// 0x01E0 (0x01E0 - 0x0000)
struct BP_ActorSpawnPoint_C_GetDisplayText final
{
public:
	class FString                                 Result;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	double                                        CallFunc_BreakVector_X;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0158(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnPoint_C_GetDisplayText) == 0x000008, "Wrong alignment on BP_ActorSpawnPoint_C_GetDisplayText");
static_assert(sizeof(BP_ActorSpawnPoint_C_GetDisplayText) == 0x0001E0, "Wrong size on BP_ActorSpawnPoint_C_GetDisplayText");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, Result) == 0x000000, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::Result' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_BreakVector_X) == 0x000050, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_BreakVector_Y) == 0x000058, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_BreakVector_Z) == 0x000060, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000158, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, K2Node_MakeArray_Array) == 0x0001A8, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_Format_ReturnValue) == 0x0001B8, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetDisplayText, CallFunc_Conv_TextToString_ReturnValue) == 0x0001D0, "Member 'BP_ActorSpawnPoint_C_GetDisplayText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BP_ActorSpawnPoint.BP_ActorSpawnPoint_C.GetTransformToSpawn
// 0x0060 (0x0060 - 0x0000)
struct BP_ActorSpawnPoint_C_GetTransformToSpawn final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnPoint_C_GetTransformToSpawn) == 0x000010, "Wrong alignment on BP_ActorSpawnPoint_C_GetTransformToSpawn");
static_assert(sizeof(BP_ActorSpawnPoint_C_GetTransformToSpawn) == 0x000060, "Wrong size on BP_ActorSpawnPoint_C_GetTransformToSpawn");
static_assert(offsetof(BP_ActorSpawnPoint_C_GetTransformToSpawn, Transform) == 0x000000, "Member 'BP_ActorSpawnPoint_C_GetTransformToSpawn::Transform' has a wrong offset!");

// Function BP_ActorSpawnPoint.BP_ActorSpawnPoint_C.HasAnySpawnedActor
// 0x0030 (0x0030 - 0x0000)
struct BP_ActorSpawnPoint_C_HasAnySpawnedActor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnPoint_C_HasAnySpawnedActor) == 0x000008, "Wrong alignment on BP_ActorSpawnPoint_C_HasAnySpawnedActor");
static_assert(sizeof(BP_ActorSpawnPoint_C_HasAnySpawnedActor) == 0x000030, "Wrong size on BP_ActorSpawnPoint_C_HasAnySpawnedActor");
