#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorSpawnSet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ActorSpawnSet.BP_ActorSpawnSet_C.ExecuteUbergraph_BP_ActorSpawnSet
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_PlayerLocation;                 // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SpawnNumber;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ActorSpawnPoint_C*                  K2Node_DynamicCast_AsBP_Actor_Spawn_Point;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSpawn_Result;                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SortActorsByDistance_ReturnValue;         // 0x0080(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetDebugName_ReturnValue;                 // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet) == 0x000008, "Wrong alignment on BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet");
static_assert(sizeof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet) == 0x0000B0, "Wrong size on BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, EntryPoint) == 0x000000, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, Temp_int_Variable) == 0x000004, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, K2Node_CustomEvent_PlayerLocation) == 0x000008, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::K2Node_CustomEvent_PlayerLocation' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, K2Node_CustomEvent_SpawnNumber) == 0x000020, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::K2Node_CustomEvent_SpawnNumber' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_RandomFloat_ReturnValue) == 0x000028, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000031, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_GetAttachedActors_OutActors) == 0x000038, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, K2Node_DynamicCast_AsBP_Actor_Spawn_Point) == 0x000060, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::K2Node_DynamicCast_AsBP_Actor_Spawn_Point' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, Temp_int_Variable_1) == 0x00006C, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_CanSpawn_Result) == 0x000070, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_CanSpawn_Result' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000071, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_Percent_IntInt_ReturnValue) == 0x000078, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_SortActorsByDistance_ReturnValue) == 0x000080, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_SortActorsByDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_GetDebugName_ReturnValue) == 0x000090, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_GetDebugName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'BP_ActorSpawnSet_C_ExecuteUbergraph_BP_ActorSpawnSet::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_ActorSpawnSet.BP_ActorSpawnSet_C.Spawn
// 0x0020 (0x0020 - 0x0000)
struct BP_ActorSpawnSet_C_Spawn final
{
public:
	struct FVector                                PlayerLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnNumber;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnSet_C_Spawn) == 0x000008, "Wrong alignment on BP_ActorSpawnSet_C_Spawn");
static_assert(sizeof(BP_ActorSpawnSet_C_Spawn) == 0x000020, "Wrong size on BP_ActorSpawnSet_C_Spawn");
static_assert(offsetof(BP_ActorSpawnSet_C_Spawn, PlayerLocation) == 0x000000, "Member 'BP_ActorSpawnSet_C_Spawn::PlayerLocation' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_Spawn, SpawnNumber) == 0x000018, "Member 'BP_ActorSpawnSet_C_Spawn::SpawnNumber' has a wrong offset!");

// Function BP_ActorSpawnSet.BP_ActorSpawnSet_C.SpawnFixedNumberActors
// 0x0010 (0x0010 - 0x0000)
struct BP_ActorSpawnSet_C_SpawnFixedNumberActors final
{
public:
	int32                                         FixedNumber;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnSet_C_SpawnFixedNumberActors) == 0x000004, "Wrong alignment on BP_ActorSpawnSet_C_SpawnFixedNumberActors");
static_assert(sizeof(BP_ActorSpawnSet_C_SpawnFixedNumberActors) == 0x000010, "Wrong size on BP_ActorSpawnSet_C_SpawnFixedNumberActors");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnFixedNumberActors, FixedNumber) == 0x000000, "Member 'BP_ActorSpawnSet_C_SpawnFixedNumberActors::FixedNumber' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnFixedNumberActors, Temp_int_Variable) == 0x000004, "Member 'BP_ActorSpawnSet_C_SpawnFixedNumberActors::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnFixedNumberActors, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ActorSpawnSet_C_SpawnFixedNumberActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnFixedNumberActors, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ActorSpawnSet_C_SpawnFixedNumberActors::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ActorSpawnSet.BP_ActorSpawnSet_C.SpawnOneActor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ActorSpawnSet_C_SpawnOneActor final
{
public:
	double                                        Roll;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalChance;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ActorSpawnPoint_C*                  K2Node_DynamicCast_AsBP_Actor_Spawn_Point;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ActorSpawnPoint_C*                  K2Node_DynamicCast_AsBP_Actor_Spawn_Point_1;       // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnSet_C_SpawnOneActor) == 0x000008, "Wrong alignment on BP_ActorSpawnSet_C_SpawnOneActor");
static_assert(sizeof(BP_ActorSpawnSet_C_SpawnOneActor) == 0x0000A0, "Wrong size on BP_ActorSpawnSet_C_SpawnOneActor");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, Roll) == 0x000000, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::Roll' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, TotalChance) == 0x000008, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::TotalChance' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, Temp_bool_True_if_break_was_hit_Variable) == 0x000014, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_RandomFloat_ReturnValue) == 0x000030, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Array_RemoveItem_ReturnValue) == 0x000059, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, K2Node_DynamicCast_AsBP_Actor_Spawn_Point) == 0x000060, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::K2Node_DynamicCast_AsBP_Actor_Spawn_Point' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, K2Node_DynamicCast_AsBP_Actor_Spawn_Point_1) == 0x000078, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::K2Node_DynamicCast_AsBP_Actor_Spawn_Point_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000088, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000090, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009C, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnSet_C_SpawnOneActor, CallFunc_BooleanAND_ReturnValue) == 0x00009D, "Member 'BP_ActorSpawnSet_C_SpawnOneActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

