#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AvatarActor

#include "Basic.hpp"

#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function BP_AvatarActor.BP_AvatarActor_C.ExecuteUbergraph_BP_AvatarActor
// 0x0028 (0x0028 - 0x0000)
struct BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorGender                               K2Node_Event_Gender;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorRace                                 K2Node_Event_Race;                                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor) == 0x000008, "Wrong alignment on BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor");
static_assert(sizeof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor) == 0x000028, "Wrong size on BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, EntryPoint) == 0x000000, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, K2Node_Event_Gender) == 0x000008, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::K2Node_Event_Gender' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, K2Node_Event_Race) == 0x000009, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::K2Node_Event_Race' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_AvatarActor_C_ExecuteUbergraph_BP_AvatarActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AvatarActor.BP_AvatarActor_C.OnUpdateAvatarDataMesh
// 0x0002 (0x0002 - 0x0000)
struct BP_AvatarActor_C_OnUpdateAvatarDataMesh final
{
public:
	ETgfActorGender                               Gender;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorRace                                 Race;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AvatarActor_C_OnUpdateAvatarDataMesh) == 0x000001, "Wrong alignment on BP_AvatarActor_C_OnUpdateAvatarDataMesh");
static_assert(sizeof(BP_AvatarActor_C_OnUpdateAvatarDataMesh) == 0x000002, "Wrong size on BP_AvatarActor_C_OnUpdateAvatarDataMesh");
static_assert(offsetof(BP_AvatarActor_C_OnUpdateAvatarDataMesh, Gender) == 0x000000, "Member 'BP_AvatarActor_C_OnUpdateAvatarDataMesh::Gender' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_OnUpdateAvatarDataMesh, Race) == 0x000001, "Member 'BP_AvatarActor_C_OnUpdateAvatarDataMesh::Race' has a wrong offset!");

// Function BP_AvatarActor.BP_AvatarActor_C.SetLODLevelOnDS
// 0x0008 (0x0008 - 0x0000)
struct BP_AvatarActor_C_SetLODLevelOnDS final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumLODs_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AvatarActor_C_SetLODLevelOnDS) == 0x000004, "Wrong alignment on BP_AvatarActor_C_SetLODLevelOnDS");
static_assert(sizeof(BP_AvatarActor_C_SetLODLevelOnDS) == 0x000008, "Wrong size on BP_AvatarActor_C_SetLODLevelOnDS");
static_assert(offsetof(BP_AvatarActor_C_SetLODLevelOnDS, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_AvatarActor_C_SetLODLevelOnDS::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_SetLODLevelOnDS, CallFunc_GetNumLODs_ReturnValue) == 0x000004, "Member 'BP_AvatarActor_C_SetLODLevelOnDS::CallFunc_GetNumLODs_ReturnValue' has a wrong offset!");

// Function BP_AvatarActor.BP_AvatarActor_C.UpdateFaceConfig
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AvatarActor_C_UpdateFaceConfig final
{
public:
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFaceData_C*                            CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTGFTableManager*                       CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentGroupAPI_IsValid;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UExcelLoaderConfigGroupWrapper*         CallFunc_GetCurrentGroupAPI_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFaceConfigs_Completed;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTgfFaceConfig                         CallFunc_GetFaceConfigs_FaceConfig;                // 0x0040(0x0068)()
};
static_assert(alignof(BP_AvatarActor_C_UpdateFaceConfig) == 0x000008, "Wrong alignment on BP_AvatarActor_C_UpdateFaceConfig");
static_assert(sizeof(BP_AvatarActor_C_UpdateFaceConfig) == 0x0000A8, "Wrong size on BP_AvatarActor_C_UpdateFaceConfig");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_GetParentActor_ReturnValue) == 0x000000, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, K2Node_DynamicCast_AsLyra_Character) == 0x000010, "Member 'BP_AvatarActor_C_UpdateFaceConfig::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_AvatarActor_C_UpdateFaceConfig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_GetEngineSubsystem_ReturnValue) == 0x000020, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_GetEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_GetCurrentGroupAPI_IsValid) == 0x000029, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_GetCurrentGroupAPI_IsValid' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_GetCurrentGroupAPI_ReturnValue) == 0x000030, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_GetCurrentGroupAPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_GetFaceConfigs_Completed) == 0x000038, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_GetFaceConfigs_Completed' has a wrong offset!");
static_assert(offsetof(BP_AvatarActor_C_UpdateFaceConfig, CallFunc_GetFaceConfigs_FaceConfig) == 0x000040, "Member 'BP_AvatarActor_C_UpdateFaceConfig::CallFunc_GetFaceConfigs_FaceConfig' has a wrong offset!");

}

