#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AltarBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_AltarBase.BP_AltarBase_C.ExecuteUbergraph_BP_AltarBase
// 0x0330 (0x0330 - 0x0000)
struct BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraGamePhaseSubsystem*                CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_InteractingPawn;                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Fighter_HeroSample_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Fighter_HeroSample_C*               CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0104(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item_2;                         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2; // 0x011C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0150(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0xC];                                      // 0x0214(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0220(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0280(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CollectableBase_C*                  CallFunc_SpawnCollectable_SpawnedItem;             // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_PhaseTag;                       // 0x02F0(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayTag& PhaseTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase) == 0x000010, "Wrong alignment on BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase");
static_assert(sizeof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase) == 0x000330, "Wrong size on BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, EntryPoint) == 0x000000, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Loop_Counter_Variable_2) == 0x00003C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Array_Index_Variable_2) == 0x000044, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Loop_Counter_Variable_3) == 0x000048, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Add_IntInt_ReturnValue_3) == 0x00004C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000050, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000058, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Array_Index_Variable_3) == 0x000060, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Loop_Counter_Variable_4) == 0x000064, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Add_IntInt_ReturnValue_4) == 0x000068, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_int_Array_Index_Variable_4) == 0x00006C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000071, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, K2Node_Event_InteractingPawn) == 0x000078, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetGameState_ReturnValue) == 0x000080, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000088, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000A0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0000C0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CC, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x0000D0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000D8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_CompareTeams_TeamIdA) == 0x0000E0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_CompareTeams_TeamIdB) == 0x0000E4, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_CompareTeams_ReturnValue) == 0x0000E8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, K2Node_SwitchEnum_CmpSuccess) == 0x0000E9, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetGameState_ReturnValue_1) == 0x0000F0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x0000F8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Length_ReturnValue_2) == 0x000100, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000104, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Less_IntInt_ReturnValue_2) == 0x00010C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Get_Item_2) == 0x000110, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000118, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2) == 0x00011C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Length_ReturnValue_3) == 0x000124, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Less_IntInt_ReturnValue_3) == 0x000128, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Get_Item_3) == 0x00012C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Length_ReturnValue_4) == 0x000130, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Array_Length_ReturnValue_5) == 0x000134, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Less_IntInt_ReturnValue_4) == 0x000138, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Subtract_IntInt_ReturnValue) == 0x00013C, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000140, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000148, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_delegate_Variable) == 0x000150, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000160, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_BreakVector_X) == 0x000168, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_BreakVector_Y) == 0x000170, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_BreakVector_Z) == 0x000178, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000180, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000188, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_MakeVector_ReturnValue) == 0x000190, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_MakeTransform_ReturnValue) == 0x0001B0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000210, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000211, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_bool_Has_Been_Initd_Variable_1) == 0x000212, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, Temp_bool_IsClosed_Variable_1) == 0x000213, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_GetTransform_ReturnValue) == 0x000220, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_ComposeTransforms_ReturnValue) == 0x000280, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_PostAkEvent_ReturnValue) == 0x0002E0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_SpawnCollectable_SpawnedItem) == 0x0002E8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_SpawnCollectable_SpawnedItem' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, K2Node_CustomEvent_PhaseTag) == 0x0002F0, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::K2Node_CustomEvent_PhaseTag' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, K2Node_CreateDelegate_OutputDelegate) == 0x0002F8, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000308, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000310, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000318, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000320, "Member 'BP_AltarBase_C_ExecuteUbergraph_BP_AltarBase::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_AltarBase.BP_AltarBase_C.GetInteractionPromptText
// 0x0050 (0x0050 - 0x0000)
struct BP_AltarBase_C_GetInteractionPromptText final
{
public:
	class APlayerController*                      Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Key;                                               // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_1;                                   // 0x0020(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_2;                                   // 0x0038(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_AltarBase_C_GetInteractionPromptText) == 0x000008, "Wrong alignment on BP_AltarBase_C_GetInteractionPromptText");
static_assert(sizeof(BP_AltarBase_C_GetInteractionPromptText) == 0x000050, "Wrong size on BP_AltarBase_C_GetInteractionPromptText");
static_assert(offsetof(BP_AltarBase_C_GetInteractionPromptText, Param_Instigator) == 0x000000, "Member 'BP_AltarBase_C_GetInteractionPromptText::Param_Instigator' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_GetInteractionPromptText, Key) == 0x000008, "Member 'BP_AltarBase_C_GetInteractionPromptText::Key' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_GetInteractionPromptText, Out_Text_Line_1) == 0x000020, "Member 'BP_AltarBase_C_GetInteractionPromptText::Out_Text_Line_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_GetInteractionPromptText, Out_Text_Line_2) == 0x000038, "Member 'BP_AltarBase_C_GetInteractionPromptText::Out_Text_Line_2' has a wrong offset!");

// Function BP_AltarBase.BP_AltarBase_C.OnFinishCooling
// 0x0018 (0x0018 - 0x0000)
struct BP_AltarBase_C_OnFinishCooling final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarBase_C_OnFinishCooling) == 0x000004, "Wrong alignment on BP_AltarBase_C_OnFinishCooling");
static_assert(sizeof(BP_AltarBase_C_OnFinishCooling) == 0x000018, "Wrong size on BP_AltarBase_C_OnFinishCooling");
static_assert(offsetof(BP_AltarBase_C_OnFinishCooling, Temp_delegate_Variable) == 0x000000, "Member 'BP_AltarBase_C_OnFinishCooling::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnFinishCooling, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AltarBase_C_OnFinishCooling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnFinishCooling, CallFunc_IsDedicatedServer_ReturnValue) == 0x000011, "Member 'BP_AltarBase_C_OnFinishCooling::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnFinishCooling, CallFunc_PostAkEvent_ReturnValue) == 0x000014, "Member 'BP_AltarBase_C_OnFinishCooling::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BP_AltarBase.BP_AltarBase_C.OnStartCooling
// 0x0020 (0x0020 - 0x0000)
struct BP_AltarBase_C_OnStartCooling final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExecuteActionImp_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerformingInteraction_bPerformingInteraction; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarBase_C_OnStartCooling) == 0x000004, "Wrong alignment on BP_AltarBase_C_OnStartCooling");
static_assert(sizeof(BP_AltarBase_C_OnStartCooling) == 0x000020, "Wrong size on BP_AltarBase_C_OnStartCooling");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_AltarBase_C_OnStartCooling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_AltarBase_C_OnStartCooling::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, Temp_delegate_Variable) == 0x000004, "Member 'BP_AltarBase_C_OnStartCooling::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, CallFunc_ExecuteActionImp_ReturnValue) == 0x000014, "Member 'BP_AltarBase_C_OnStartCooling::CallFunc_ExecuteActionImp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BP_AltarBase_C_OnStartCooling::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000019, "Member 'BP_AltarBase_C_OnStartCooling::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, CallFunc_IsPerformingInteraction_bPerformingInteraction) == 0x00001A, "Member 'BP_AltarBase_C_OnStartCooling::CallFunc_IsPerformingInteraction_bPerformingInteraction' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_OnStartCooling, CallFunc_PostAkEvent_ReturnValue) == 0x00001C, "Member 'BP_AltarBase_C_OnStartCooling::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BP_AltarBase.BP_AltarBase_C.PerformInteraction on Server
// 0x0008 (0x0008 - 0x0000)
struct BP_AltarBase_C_PerformInteraction_on_Server final
{
public:
	class APawn*                                  InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarBase_C_PerformInteraction_on_Server) == 0x000008, "Wrong alignment on BP_AltarBase_C_PerformInteraction_on_Server");
static_assert(sizeof(BP_AltarBase_C_PerformInteraction_on_Server) == 0x000008, "Wrong size on BP_AltarBase_C_PerformInteraction_on_Server");
static_assert(offsetof(BP_AltarBase_C_PerformInteraction_on_Server, InteractingPawn) == 0x000000, "Member 'BP_AltarBase_C_PerformInteraction_on_Server::InteractingPawn' has a wrong offset!");

// Function BP_AltarBase.BP_AltarBase_C.ResetAltar
// 0x0008 (0x0008 - 0x0000)
struct BP_AltarBase_C_ResetAltar final
{
public:
	struct FGameplayTag                           PhaseTag;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarBase_C_ResetAltar) == 0x000004, "Wrong alignment on BP_AltarBase_C_ResetAltar");
static_assert(sizeof(BP_AltarBase_C_ResetAltar) == 0x000008, "Wrong size on BP_AltarBase_C_ResetAltar");
static_assert(offsetof(BP_AltarBase_C_ResetAltar, PhaseTag) == 0x000000, "Member 'BP_AltarBase_C_ResetAltar::PhaseTag' has a wrong offset!");

// Function BP_AltarBase.BP_AltarBase_C.SetEnabled
// 0x0005 (0x0005 - 0x0000)
struct BP_AltarBase_C_SetEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarBase_C_SetEnabled) == 0x000001, "Wrong alignment on BP_AltarBase_C_SetEnabled");
static_assert(sizeof(BP_AltarBase_C_SetEnabled) == 0x000005, "Wrong size on BP_AltarBase_C_SetEnabled");
static_assert(offsetof(BP_AltarBase_C_SetEnabled, Enabled) == 0x000000, "Member 'BP_AltarBase_C_SetEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_SetEnabled, Temp_bool_Variable) == 0x000001, "Member 'BP_AltarBase_C_SetEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_SetEnabled, Temp_byte_Variable) == 0x000002, "Member 'BP_AltarBase_C_SetEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_SetEnabled, Temp_byte_Variable_1) == 0x000003, "Member 'BP_AltarBase_C_SetEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_SetEnabled, K2Node_Select_Default) == 0x000004, "Member 'BP_AltarBase_C_SetEnabled::K2Node_Select_Default' has a wrong offset!");

// Function BP_AltarBase.BP_AltarBase_C.SpawnCollectable
// 0x0100 (0x0100 - 0x0000)
struct BP_AltarBase_C_SpawnCollectable final
{
public:
	struct FTransform                             SpawnTransform;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Param_Owner;                                       // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemId;                                            // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CollectableBase_C*                  SpawnedItem;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UTgfInventoryItemInstance*>      CallFunc_CreateItemInstanceForLobby_ReturnValue;   // 0x0090(0x0010)(ReferenceParm)
	class UTgfInventoryItemInstance*              CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class ULyraInventoryItemDefinition> CallFunc_GetItemDef_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsTgf_Inventory_Item_Definition; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInventoryFragment_PickupMesh*    CallFunc_FindFragmentByClass_ReturnValue;          // 0x00C0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_SelectClass_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Collectable_Base;     // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CollectableBase_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AltarBase_C_SpawnCollectable) == 0x000010, "Wrong alignment on BP_AltarBase_C_SpawnCollectable");
static_assert(sizeof(BP_AltarBase_C_SpawnCollectable) == 0x000100, "Wrong size on BP_AltarBase_C_SpawnCollectable");
static_assert(offsetof(BP_AltarBase_C_SpawnCollectable, SpawnTransform) == 0x000000, "Member 'BP_AltarBase_C_SpawnCollectable::SpawnTransform' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_SpawnCollectable, Param_Owner) == 0x000060, "Member 'BP_AltarBase_C_SpawnCollectable::Param_Owner' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_SpawnCollectable, ItemId) == 0x000068, "Member 'BP_AltarBase_C_SpawnCollectable::ItemId' has a wrong offset!");
static_assert(offsetof(BP_AltarBase_C_SpawnCollectable, SpawnedItem) == 0x000070, "Member 'BP_AltarBase_C_SpawnCollectable::SpawnedItem' has a wrong offset!");
