#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorSpawnOptionComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ActorSpawnOptionComponent.BP_ActorSpawnOptionComponent_C.CanSpawn
// 0x0020 (0x0020 - 0x0000)
struct BP_ActorSpawnOptionComponent_C_CanSpawn final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllOptions_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawnOptionComponent_C_CanSpawn) == 0x000008, "Wrong alignment on BP_ActorSpawnOptionComponent_C_CanSpawn");
static_assert(sizeof(BP_ActorSpawnOptionComponent_C_CanSpawn) == 0x000020, "Wrong size on BP_ActorSpawnOptionComponent_C_CanSpawn");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, Result) == 0x000000, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::Result' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000002, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, K2Node_DynamicCast_AsLyra_Game_State) == 0x000010, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, CallFunc_HasAllOptions_ReturnValue) == 0x000019, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::CallFunc_HasAllOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawnOptionComponent_C_CanSpawn, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00001A, "Member 'BP_ActorSpawnOptionComponent_C_CanSpawn::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

}

