#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterSelectionComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterSelectionComponent.BP_CharacterSelectionComponent_C.ClearClientSelection
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterSelectionComponent_C_ClearClientSelection final
{
public:
	bool                                          bTriggerInvalid;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSelectionComponent_C_ClearClientSelection) == 0x000001, "Wrong alignment on BP_CharacterSelectionComponent_C_ClearClientSelection");
static_assert(sizeof(BP_CharacterSelectionComponent_C_ClearClientSelection) == 0x000001, "Wrong size on BP_CharacterSelectionComponent_C_ClearClientSelection");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ClearClientSelection, bTriggerInvalid) == 0x000000, "Member 'BP_CharacterSelectionComponent_C_ClearClientSelection::bTriggerInvalid' has a wrong offset!");

// Function BP_CharacterSelectionComponent.BP_CharacterSelectionComponent_C.ClearServerSelection
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterSelectionComponent_C_ClearServerSelection final
{
public:
	bool                                          bTriggerInvalid;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSelectionComponent_C_ClearServerSelection) == 0x000001, "Wrong alignment on BP_CharacterSelectionComponent_C_ClearServerSelection");
static_assert(sizeof(BP_CharacterSelectionComponent_C_ClearServerSelection) == 0x000001, "Wrong size on BP_CharacterSelectionComponent_C_ClearServerSelection");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ClearServerSelection, bTriggerInvalid) == 0x000000, "Member 'BP_CharacterSelectionComponent_C_ClearServerSelection::bTriggerInvalid' has a wrong offset!");

// Function BP_CharacterSelectionComponent.BP_CharacterSelectionComponent_C.CreateIndicator
// 0x00A0 (0x00A0 - 0x0000)
struct BP_CharacterSelectionComponent_C_CreateIndicator final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSelectionComponent_C_CreateIndicator) == 0x000010, "Wrong alignment on BP_CharacterSelectionComponent_C_CreateIndicator");
static_assert(sizeof(BP_CharacterSelectionComponent_C_CreateIndicator) == 0x0000A0, "Wrong size on BP_CharacterSelectionComponent_C_CreateIndicator");
static_assert(offsetof(BP_CharacterSelectionComponent_C_CreateIndicator, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_CharacterSelectionComponent_C_CreateIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_CreateIndicator, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_CharacterSelectionComponent_C_CreateIndicator::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_CreateIndicator, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_CharacterSelectionComponent_C_CreateIndicator::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_CreateIndicator, CallFunc_K2_GetPawn_ReturnValue) == 0x000080, "Member 'BP_CharacterSelectionComponent_C_CreateIndicator::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_CreateIndicator, CallFunc_IsValidClass_ReturnValue) == 0x000088, "Member 'BP_CharacterSelectionComponent_C_CreateIndicator::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_CreateIndicator, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'BP_CharacterSelectionComponent_C_CreateIndicator::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_CreateIndicator, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'BP_CharacterSelectionComponent_C_CreateIndicator::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_CharacterSelectionComponent.BP_CharacterSelectionComponent_C.EndSelection
// 0x0028 (0x0028 - 0x0000)
struct BP_CharacterSelectionComponent_C_EndSelection final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSelectionComponent_C_EndSelection) == 0x000008, "Wrong alignment on BP_CharacterSelectionComponent_C_EndSelection");
static_assert(sizeof(BP_CharacterSelectionComponent_C_EndSelection) == 0x000028, "Wrong size on BP_CharacterSelectionComponent_C_EndSelection");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_CharacterSelectionComponent_C_EndSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_CharacterSelectionComponent_C_EndSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_CharacterSelectionComponent_C_EndSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_CharacterSelectionComponent_C_EndSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'BP_CharacterSelectionComponent_C_EndSelection::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, CallFunc_Less_IntInt_ReturnValue) == 0x000019, "Member 'BP_CharacterSelectionComponent_C_EndSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_CharacterSelectionComponent_C_EndSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_CharacterSelectionComponent_C_EndSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_EndSelection, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_CharacterSelectionComponent_C_EndSelection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_CharacterSelectionComponent.BP_CharacterSelectionComponent_C.ExecuteUbergraph_BP_CharacterSelectionComponent
// 0x08C8 (0x08C8 - 0x0000)
struct BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_TraceGroundLocation_OutHit;               // 0x0028(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_TraceGroundLocation_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_TraceTarget_OutHit;                       // 0x0118(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_TraceTarget_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            K2Node_CustomEvent_SelectedCharacter;              // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorValid_ReturnValue;                 // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Cur_Chara_Unselectable_bUnselectable;  // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x03C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OwningActor;                    // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_CustomEvent_SelectedChara;                  // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TraceStart;                     // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TraceHit;                       // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TraceBoneName;                  // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_CustomEvent_IgnoreActors;                   // 0x0410(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_CustomEvent_bTriggerInvalid_1;              // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_VerifySelectTarget_bIsValid;              // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bTriggerInvalid;                // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ViewTargetPos_1;                // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraWeaponBase*                        K2Node_DynamicCast_AsLyra_Weapon_Base;             // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0478(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ViewTargetPos;                  // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x04E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NewMaxDistance;                 // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_NewVerifyRate;                  // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OwningActor)>    K2Node_CreateDelegate_OutputDelegate;              // 0x05F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_602[0x6];                                      // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_NewPos_1;                       // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_NewRotation;                    // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_NewPos;                         // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0650(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0740(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_829[0x3];                                      // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorTagsMatch_bMatch;                  // 0x0831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_832[0x2];                                      // 0x0832(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Tgf_Character_Default_C*>    K2Node_CustomEvent_TempTargets;                    // 0x0838(0x0010)(ConstParm, ReferenceParm)
	class ABP_Tgf_Character_Default_C*            CallFunc_Array_Get_Item;                           // 0x0848(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0850(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActorValid_ReturnValue_1;               // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_871[0x7];                                      // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0878(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0880(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue_2;            // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default;     // 0x08B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x3];                                      // 0x08B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Actor_Selectable_bSelectable;          // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent) == 0x000008, "Wrong alignment on BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent");
static_assert(sizeof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent) == 0x0008C8, "Wrong size on BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, EntryPoint) == 0x000000, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000018, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_TraceGroundLocation_OutHit) == 0x000028, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_TraceGroundLocation_OutHit' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_TraceGroundLocation_ReturnValue) == 0x000110, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_TraceGroundLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_TraceTarget_OutHit) == 0x000118, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_TraceTarget_OutHit' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_TraceTarget_ReturnValue) == 0x000200, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_TraceTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_bBlockingHit) == 0x000201, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_bInitialOverlap) == 0x000202, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Time) == 0x000204, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Distance) == 0x000208, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Location) == 0x000210, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_ImpactPoint) == 0x000228, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Normal) == 0x000240, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_ImpactNormal) == 0x000258, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_PhysMat) == 0x000270, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitActor) == 0x000278, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitComponent) == 0x000280, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitBoneName) == 0x000288, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_BoneName) == 0x000290, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitItem) == 0x000298, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_ElementIndex) == 0x00029C, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_FaceIndex) == 0x0002A0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_TraceStart) == 0x0002A8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_TraceEnd) == 0x0002C0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0002D8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0002D9, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Time_1) == 0x0002DC, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Distance_1) == 0x0002E0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Location_1) == 0x0002E8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000300, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_Normal_1) == 0x000318, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000330, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_PhysMat_1) == 0x000348, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitActor_1) == 0x000350, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitComponent_1) == 0x000358, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitBoneName_1) == 0x000360, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_BoneName_1) == 0x000368, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_HitItem_1) == 0x000370, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_ElementIndex_1) == 0x000374, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_FaceIndex_1) == 0x000378, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_TraceStart_1) == 0x000380, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_BreakHitResult_TraceEnd_1) == 0x000398, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, Temp_int_Array_Index_Variable) == 0x0003B0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_SelectedCharacter) == 0x0003B8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_SelectedCharacter' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_IsActorValid_ReturnValue) == 0x0003C0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_IsActorValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_Is_Cur_Chara_Unselectable_bUnselectable) == 0x0003C1, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_Is_Cur_Chara_Unselectable_bUnselectable' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_IsValid_ReturnValue) == 0x0003C2, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0003C3, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_OwningActor) == 0x0003C8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_OwningActor' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_SelectedChara) == 0x0003D0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_SelectedChara' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_TraceStart) == 0x0003D8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_TraceHit) == 0x0003F0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_TraceHit' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_TraceBoneName) == 0x000408, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_TraceBoneName' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_IgnoreActors) == 0x000410, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_IgnoreActors' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_bTriggerInvalid_1) == 0x000420, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_bTriggerInvalid_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_VerifySelectTarget_bIsValid) == 0x000421, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_VerifySelectTarget_bIsValid' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_bTriggerInvalid) == 0x000422, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_bTriggerInvalid' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_IsValid_ReturnValue_1) == 0x000423, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_Location_1) == 0x000428, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_Location_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_ViewTargetPos_1) == 0x000440, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_ViewTargetPos_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_Array_Add_ReturnValue) == 0x000458, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x00045C, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_DynamicCast_AsLyra_Weapon_Base) == 0x000460, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_DynamicCast_AsLyra_Weapon_Base' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_DynamicCast_bSuccess) == 0x000468, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000470, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_Location) == 0x000478, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, K2Node_CustomEvent_ViewTargetPos) == 0x000490, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::K2Node_CustomEvent_ViewTargetPos' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_Vector_Distance_ReturnValue) == 0x0004A8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_GetOwner_ReturnValue_2) == 0x0004B0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_IsValid_ReturnValue_2) == 0x0004B8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004C0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_Vector_Distance_ReturnValue_1) == 0x0004D8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0004E0, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_IsValid_ReturnValue_3) == 0x0004E1, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0004E8, "Member 'BP_CharacterSelectionComponent_C_ExecuteUbergraph_BP_CharacterSelectionComponent::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
