#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CollectableBase_FlowerCoffinItem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CollectableBase_FlowerCoffinItem.BP_CollectableBase_FlowerCoffinItem_C.ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem
// 0x000C (0x000C - 0x0000)
struct BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RefreshNearbyFlowerCoffins_SearchRadius_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem) == 0x000004, "Wrong alignment on BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem");
static_assert(sizeof(BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem) == 0x00000C, "Wrong size on BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem");
static_assert(offsetof(BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem, EntryPoint) == 0x000000, "Member 'BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem, K2Node_Event_EndPlayReason) == 0x000005, "Member 'BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem, CallFunc_RefreshNearbyFlowerCoffins_SearchRadius_ImplicitCast) == 0x000008, "Member 'BP_CollectableBase_FlowerCoffinItem_C_ExecuteUbergraph_BP_CollectableBase_FlowerCoffinItem::CallFunc_RefreshNearbyFlowerCoffins_SearchRadius_ImplicitCast' has a wrong offset!");

// Function BP_CollectableBase_FlowerCoffinItem.BP_CollectableBase_FlowerCoffinItem_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CollectableBase_FlowerCoffinItem_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CollectableBase_FlowerCoffinItem_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CollectableBase_FlowerCoffinItem_C_ReceiveEndPlay");
static_assert(sizeof(BP_CollectableBase_FlowerCoffinItem_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CollectableBase_FlowerCoffinItem_C_ReceiveEndPlay");
static_assert(offsetof(BP_CollectableBase_FlowerCoffinItem_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CollectableBase_FlowerCoffinItem_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

