#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractDevice_OnBoarding

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExtractDevice_OnBoarding.BP_ExtractDevice_OnBoarding_C.SpawnExtractPortal
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal final
{
public:
	class ABP_ExtractPortal_C*                    Portal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExtractPortal_Quit_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal) == 0x000010, "Wrong alignment on BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal");
static_assert(sizeof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal) == 0x0000B0, "Wrong size on BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal");
static_assert(offsetof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal, Portal) == 0x000000, "Member 'BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal::Portal' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'BP_ExtractDevice_OnBoarding_C_SpawnExtractPortal::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

