#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractDevice_Red

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExtractDevice_Red.BP_ExtractDevice_Red_C.ExecuteUbergraph_BP_ExtractDevice_Red
// 0x0048 (0x0048 - 0x0000)
struct BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Interacting_Pawn;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_InteractionPawn;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red) == 0x000008, "Wrong alignment on BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red");
static_assert(sizeof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red) == 0x000048, "Wrong size on BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, EntryPoint) == 0x000000, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, K2Node_Event_Interacting_Pawn) == 0x000008, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::K2Node_Event_Interacting_Pawn' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_Array_Add_ReturnValue_1) == 0x000014, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_Array_Add_ReturnValue_2) == 0x000018, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red, K2Node_Event_InteractionPawn) == 0x000040, "Member 'BP_ExtractDevice_Red_C_ExecuteUbergraph_BP_ExtractDevice_Red::K2Node_Event_InteractionPawn' has a wrong offset!");

// Function BP_ExtractDevice_Red.BP_ExtractDevice_Red_C.GetInteractionPromptText
// 0x0050 (0x0050 - 0x0000)
struct BP_ExtractDevice_Red_C_GetInteractionPromptText final
{
public:
	class APlayerController*                      Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Key;                                               // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_1;                                   // 0x0020(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_2;                                   // 0x0038(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_ExtractDevice_Red_C_GetInteractionPromptText) == 0x000008, "Wrong alignment on BP_ExtractDevice_Red_C_GetInteractionPromptText");
static_assert(sizeof(BP_ExtractDevice_Red_C_GetInteractionPromptText) == 0x000050, "Wrong size on BP_ExtractDevice_Red_C_GetInteractionPromptText");
static_assert(offsetof(BP_ExtractDevice_Red_C_GetInteractionPromptText, Param_Instigator) == 0x000000, "Member 'BP_ExtractDevice_Red_C_GetInteractionPromptText::Param_Instigator' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_GetInteractionPromptText, Key) == 0x000008, "Member 'BP_ExtractDevice_Red_C_GetInteractionPromptText::Key' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_GetInteractionPromptText, Out_Text_Line_1) == 0x000020, "Member 'BP_ExtractDevice_Red_C_GetInteractionPromptText::Out_Text_Line_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_GetInteractionPromptText, Out_Text_Line_2) == 0x000038, "Member 'BP_ExtractDevice_Red_C_GetInteractionPromptText::Out_Text_Line_2' has a wrong offset!");

// Function BP_ExtractDevice_Red.BP_ExtractDevice_Red_C.OnInteractionFinish
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtractDevice_Red_C_OnInteractionFinish final
{
public:
	class APawn*                                  InteractionPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractDevice_Red_C_OnInteractionFinish) == 0x000008, "Wrong alignment on BP_ExtractDevice_Red_C_OnInteractionFinish");
static_assert(sizeof(BP_ExtractDevice_Red_C_OnInteractionFinish) == 0x000008, "Wrong size on BP_ExtractDevice_Red_C_OnInteractionFinish");
static_assert(offsetof(BP_ExtractDevice_Red_C_OnInteractionFinish, InteractionPawn) == 0x000000, "Member 'BP_ExtractDevice_Red_C_OnInteractionFinish::InteractionPawn' has a wrong offset!");

// Function BP_ExtractDevice_Red.BP_ExtractDevice_Red_C.PerformInteraction
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtractDevice_Red_C_PerformInteraction final
{
public:
	class APawn*                                  Interacting_Pawn;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractDevice_Red_C_PerformInteraction) == 0x000008, "Wrong alignment on BP_ExtractDevice_Red_C_PerformInteraction");
static_assert(sizeof(BP_ExtractDevice_Red_C_PerformInteraction) == 0x000008, "Wrong size on BP_ExtractDevice_Red_C_PerformInteraction");
static_assert(offsetof(BP_ExtractDevice_Red_C_PerformInteraction, Interacting_Pawn) == 0x000000, "Member 'BP_ExtractDevice_Red_C_PerformInteraction::Interacting_Pawn' has a wrong offset!");

// Function BP_ExtractDevice_Red.BP_ExtractDevice_Red_C.SpawnExtractPortal
// 0x0190 (0x0190 - 0x0000)
struct BP_ExtractDevice_Red_C_SpawnExtractPortal final
{
public:
	class ABP_ExtractPortal_C*                    Portal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExtractPortal_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractDevice_Red_C_SpawnExtractPortal) == 0x000010, "Wrong alignment on BP_ExtractDevice_Red_C_SpawnExtractPortal");
static_assert(sizeof(BP_ExtractDevice_Red_C_SpawnExtractPortal) == 0x000190, "Wrong size on BP_ExtractDevice_Red_C_SpawnExtractPortal");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, Portal) == 0x000000, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::Portal' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000010, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000020, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_BreakRotator_Roll) == 0x000068, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_BreakRotator_Pitch) == 0x00006C, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_BreakRotator_Yaw) == 0x000070, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000078, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000098, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_MakeRotator_ReturnValue) == 0x0000B0, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_GetForwardVector_ReturnValue) == 0x0000C8, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000E0, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_MakeTransform_ReturnValue) == 0x000110, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000170, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_FinishSpawningActor_ReturnValue) == 0x000178, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000180, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExtractDevice_Red_C_SpawnExtractPortal, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000188, "Member 'BP_ExtractDevice_Red_C_SpawnExtractPortal::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

