#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractDevice_Shadow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_ExtractDevice_Red_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExtractDevice_Shadow.BP_ExtractDevice_Shadow_C
// 0x0048 (0x0448 - 0x0400)
class ABP_ExtractDevice_Shadow_C final : public ABP_ExtractDevice_Red_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ExtractDevice_Shadow_C;          // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_DA_Ore_door2;                                   // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DA_Ore_door1;                                   // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DA_Ore_door;                                    // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TranslateNode;                                     // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LidTranslation;                                    // 0x0428(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LidMoveDuration;                                   // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ExtractDevice_Shadow(int32 EntryPoint);
	void GetInteractionPromptText(class APlayerController* Param_Instigator, class FText* Key, class FText* Out_Text_Line_1, class FText* Out_Text_Line_2);
	void OnReady_84AAA4744BD9A9277625A49CA31ABD6D();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExtractDevice_Shadow_C">();
	}
	static class ABP_ExtractDevice_Shadow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExtractDevice_Shadow_C>();
	}
};
static_assert(alignof(ABP_ExtractDevice_Shadow_C) == 0x000008, "Wrong alignment on ABP_ExtractDevice_Shadow_C");
static_assert(sizeof(ABP_ExtractDevice_Shadow_C) == 0x000448, "Wrong size on ABP_ExtractDevice_Shadow_C");
static_assert(offsetof(ABP_ExtractDevice_Shadow_C, UberGraphFrame_BP_ExtractDevice_Shadow_C) == 0x000400, "Member 'ABP_ExtractDevice_Shadow_C::UberGraphFrame_BP_ExtractDevice_Shadow_C' has a wrong offset!");
static_assert(offsetof(ABP_ExtractDevice_Shadow_C, SM_DA_Ore_door2) == 0x000408, "Member 'ABP_ExtractDevice_Shadow_C::SM_DA_Ore_door2' has a wrong offset!");
static_assert(offsetof(ABP_ExtractDevice_Shadow_C, SM_DA_Ore_door1) == 0x000410, "Member 'ABP_ExtractDevice_Shadow_C::SM_DA_Ore_door1' has a wrong offset!");
static_assert(offsetof(ABP_ExtractDevice_Shadow_C, SM_DA_Ore_door) == 0x000418, "Member 'ABP_ExtractDevice_Shadow_C::SM_DA_Ore_door' has a wrong offset!");
static_assert(offsetof(ABP_ExtractDevice_Shadow_C, TranslateNode) == 0x000420, "Member 'ABP_ExtractDevice_Shadow_C::TranslateNode' has a wrong offset!");
static_assert(offsetof(ABP_ExtractDevice_Shadow_C, LidTranslation) == 0x000428, "Member 'ABP_ExtractDevice_Shadow_C::LidTranslation' has a wrong offset!");
static_assert(offsetof(ABP_ExtractDevice_Shadow_C, LidMoveDuration) == 0x000440, "Member 'ABP_ExtractDevice_Shadow_C::LidMoveDuration' has a wrong offset!");

}

