#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractPortal_Quit

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ExtractPortal_Quit.BP_ExtractPortal_Quit_C.ExecuteUbergraph_BP_ExtractPortal_Quit
// 0x0010 (0x0010 - 0x0000)
struct BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Delay;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit) == 0x000008, "Wrong alignment on BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit");
static_assert(sizeof(BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit) == 0x000010, "Wrong size on BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit");
static_assert(offsetof(BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit, EntryPoint) == 0x000000, "Member 'BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit, K2Node_CustomEvent_Delay) == 0x000008, "Member 'BP_ExtractPortal_Quit_C_ExecuteUbergraph_BP_ExtractPortal_Quit::K2Node_CustomEvent_Delay' has a wrong offset!");

// Function BP_ExtractPortal_Quit.BP_ExtractPortal_Quit_C.SetDelay
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtractPortal_Quit_C_SetDelay final
{
public:
	double                                        Param_Delay;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractPortal_Quit_C_SetDelay) == 0x000008, "Wrong alignment on BP_ExtractPortal_Quit_C_SetDelay");
static_assert(sizeof(BP_ExtractPortal_Quit_C_SetDelay) == 0x000008, "Wrong size on BP_ExtractPortal_Quit_C_SetDelay");
static_assert(offsetof(BP_ExtractPortal_Quit_C_SetDelay, Param_Delay) == 0x000000, "Member 'BP_ExtractPortal_Quit_C_SetDelay::Param_Delay' has a wrong offset!");

}

