#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractPortal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExtractPortal.BP_ExtractPortal_C
// 0x0060 (0x02F8 - 0x0298)
class ABP_ExtractPortal_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        DisappearingDuaration;                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PortalTag;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PlayerCharacter;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MessageTag;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ExtractDevice_C*                    ExtractDevice;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPortalType                                   PortalType;                                        // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay;                                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_ExtractPortal_Box_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BroadCastPortalDestroyMessage(int32 RemainingPortalNum, class APawn* TargetPawn);
	void DeviceInvalid(bool* Valid);
	void DisablePortal();
	void EndExtract();
	void ExecuteUbergraph_BP_ExtractPortal(int32 EntryPoint);
	void OnEnterPortal();
	void OnHitPlayer(class AActor* Pawn);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetDeviceSpawnedFrom(class ABP_ExtractDevice_C* Device);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExtractPortal_C">();
	}
	static class ABP_ExtractPortal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExtractPortal_C>();
	}
};
static_assert(alignof(ABP_ExtractPortal_C) == 0x000008, "Wrong alignment on ABP_ExtractPortal_C");
static_assert(sizeof(ABP_ExtractPortal_C) == 0x0002F8, "Wrong size on ABP_ExtractPortal_C");
static_assert(offsetof(ABP_ExtractPortal_C, UberGraphFrame) == 0x000298, "Member 'ABP_ExtractPortal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, Ak) == 0x0002A0, "Member 'ABP_ExtractPortal_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, Niagara) == 0x0002A8, "Member 'ABP_ExtractPortal_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, Box) == 0x0002B0, "Member 'ABP_ExtractPortal_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, Scene) == 0x0002B8, "Member 'ABP_ExtractPortal_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, DisappearingDuaration) == 0x0002C0, "Member 'ABP_ExtractPortal_C::DisappearingDuaration' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, PortalTag) == 0x0002C8, "Member 'ABP_ExtractPortal_C::PortalTag' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, PlayerCharacter) == 0x0002D0, "Member 'ABP_ExtractPortal_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, MessageTag) == 0x0002D8, "Member 'ABP_ExtractPortal_C::MessageTag' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, ExtractDevice) == 0x0002E0, "Member 'ABP_ExtractPortal_C::ExtractDevice' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, PortalType) == 0x0002E8, "Member 'ABP_ExtractPortal_C::PortalType' has a wrong offset!");
static_assert(offsetof(ABP_ExtractPortal_C, Delay) == 0x0002F0, "Member 'ABP_ExtractPortal_C::Delay' has a wrong offset!");

}

