#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Fighter_HeroSample

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "HitPendingData_structs.hpp"
#include "LyraGame_structs.hpp"
#include "AGRPRO_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.AddTraceMesh
// 0x0048 (0x0048 - 0x0000)
struct BP_Fighter_HeroSample_C_AddTraceMesh final
{
public:
	class FName                                   StartSocketTraceName;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndSocketTraceName;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAGR_CombatColliderType                       CollisionHandling;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TraceMeshInsId;                                    // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResultTraceMeshInsId;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FHitResult& Hit, class UPrimitiveComponent* Mesh)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATgfAvatarActor*                        CallFunc_GetActiveAvatarActor_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTraceMesh_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_AddTraceMesh) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_AddTraceMesh");
static_assert(sizeof(BP_Fighter_HeroSample_C_AddTraceMesh) == 0x000048, "Wrong size on BP_Fighter_HeroSample_C_AddTraceMesh");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, StartSocketTraceName) == 0x000000, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::StartSocketTraceName' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, EndSocketTraceName) == 0x000008, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::EndSocketTraceName' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, CollisionHandling) == 0x000010, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::CollisionHandling' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, TraceMeshInsId) == 0x000014, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::TraceMeshInsId' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, ResultTraceMeshInsId) == 0x000018, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::ResultTraceMeshInsId' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, Temp_int_Variable) == 0x00001C, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, CallFunc_GetActiveAvatarActor_ReturnValue) == 0x000038, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::CallFunc_GetActiveAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, CallFunc_AddTraceMesh_ReturnValue) == 0x000040, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::CallFunc_AddTraceMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AddTraceMesh, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_Fighter_HeroSample_C_AddTraceMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.AttackHitEventHandle
// 0x0790 (0x0790 - 0x0000)
struct BP_Fighter_HeroSample_C_AttackHitEventHandle final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    Param_Mesh;                                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CriticalRandomValue;                               // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0100(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0160(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0188(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01C0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01E0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x01F8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0230(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0250(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x02A0(0x0010)(ReferenceParm)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContextSimple_ReturnValue;      // 0x02B0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x02C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x02F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0308(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0358(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_GetCurrentWeaponFirstActor_ReturnValue;   // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0370(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0398(0x0028)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x03C0(0x00B0)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x0470(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0488(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsReboundEnvironment_Result;              // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x04E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x04F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x0508(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTgfGameplayEffectExtraParam           K2Node_MakeStruct_TgfGameplayEffectExtraParam;     // 0x0518(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_3;          // 0x0530(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0548(0x0050)(HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_7;                          // 0x05A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_7;                     // 0x05B8(0x0018)()
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x05D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHitInteractorEnvironment_Result;        // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHitInteractorBattle_Result;             // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA[0x6];                                      // 0x05EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_4;          // 0x05F0(0x0018)()
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0610(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_8;                          // 0x0660(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_8;                     // 0x0670(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_8;          // 0x0688(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHitInteractorEnvironment_Result_1;      // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x0699(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69A[0x2];                                      // 0x069A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x3];                                      // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATgfAvatarActor*                        CallFunc_GetActiveAvatarActor_ReturnValue;         // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B2[0x2];                                      // 0x06B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x06F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0708(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0728(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0730(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0758(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0770(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0789(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x078A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x078B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_CriticalRandomValue_ImplicitCast; // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_AttackHitEventHandle) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_AttackHitEventHandle");
static_assert(sizeof(BP_Fighter_HeroSample_C_AttackHitEventHandle) == 0x000790, "Wrong size on BP_Fighter_HeroSample_C_AttackHitEventHandle");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, Hit) == 0x000000, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::Hit' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, Param_Mesh) == 0x0000E8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::Param_Mesh' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CriticalRandomValue) == 0x0000F0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CriticalRandomValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_GetOwner_ReturnValue) == 0x0000F8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData) == 0x000100, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array) == 0x000150, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_1) == 0x000160, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue) == 0x000170, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_1) == 0x000188, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue) == 0x0001A0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001B0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_2) == 0x0001C0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_3) == 0x0001D0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_2) == 0x0001E0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_3) == 0x0001F8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000210, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000220, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000230, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_IsValid_ReturnValue) == 0x000248, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000250, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_4) == 0x0002A0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_MakeEffectContextSimple_ReturnValue) == 0x0002B0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_MakeEffectContextSimple_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_4) == 0x0002C8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_4) == 0x0002E0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x0002F0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_2) == 0x000308, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_5) == 0x000358, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_GetCurrentWeaponFirstActor_ReturnValue) == 0x000368, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_GetCurrentWeaponFirstActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_5) == 0x000370, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_5) == 0x000388, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000398, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_GameplayEventData) == 0x0003C0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x000470, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_3) == 0x000488, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_IsReboundEnvironment_Result) == 0x0004D8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_IsReboundEnvironment_Result' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_6) == 0x0004E0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_6) == 0x0004F0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_6) == 0x000508, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_TgfGameplayEffectExtraParam) == 0x000518, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_TgfGameplayEffectExtraParam' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_3) == 0x000530, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_4) == 0x000548, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_DynamicCast_AsLyra_Character) == 0x000598, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_DynamicCast_bSuccess) == 0x0005A0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_7) == 0x0005A8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_7) == 0x0005B8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_IsDeadOrDying_ReturnValue) == 0x0005D0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_7) == 0x0005D8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_IsHitInteractorEnvironment_Result) == 0x0005E8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_IsHitInteractorEnvironment_Result' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_IsHitInteractorBattle_Result) == 0x0005E9, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_IsHitInteractorBattle_Result' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_4) == 0x0005F0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_RandomFloatInRange_ReturnValue) == 0x000608, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_5) == 0x000610, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeArray_Array_8) == 0x000660, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_8) == 0x000670, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_8) == 0x000688, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_IsHitInteractorEnvironment_Result_1) == 0x000698, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_IsHitInteractorEnvironment_Result_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_GetSurfaceType_ReturnValue) == 0x000699, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Array_AddUnique_ReturnValue) == 0x00069C, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Array_Contains_ReturnValue) == 0x0006A0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0006A4, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_GetActiveAvatarActor_ReturnValue) == 0x0006A8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_GetActiveAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_bBlockingHit) == 0x0006B0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_bInitialOverlap) == 0x0006B1, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_Time) == 0x0006B4, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_Distance) == 0x0006B8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_Location) == 0x0006C0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_ImpactPoint) == 0x0006D8, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_Normal) == 0x0006F0, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_ImpactNormal) == 0x000708, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_PhysMat) == 0x000720, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitActor) == 0x000728, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitComponent) == 0x000730, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitBoneName) == 0x000738, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_BoneName) == 0x000740, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitItem) == 0x000748, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_ElementIndex) == 0x00074C, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_FaceIndex) == 0x000750, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_TraceStart) == 0x000758, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_BreakHitResult_TraceEnd) == 0x000770, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000788, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000789, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_Array_Contains_ReturnValue_1) == 0x00078A, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, CallFunc_IsValid_ReturnValue_1) == 0x00078B, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Fighter_HeroSample_C_AttackHitEventHandle, K2Node_MakeStruct_CriticalRandomValue_ImplicitCast) == 0x00078C, "Member 'BP_Fighter_HeroSample_C_AttackHitEventHandle::K2Node_MakeStruct_CriticalRandomValue_ImplicitCast' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature");
static_assert(sizeof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature) == 0x000004, "Wrong size on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature");
static_assert(offsetof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature, DeltaTime) == 0x000000, "Member 'BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_ActorMapComponent_K2Node_ComponentBoundEvent_0_TgfActorMap_TickEvent__DelegateSignature::DeltaTime' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(sizeof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong size on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(offsetof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature, OwningActor) == 0x000000, "Member 'BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_0_TgfAttribute_DeathEvent__DelegateSignature::OwningActor' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(sizeof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong size on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(offsetof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature, OwningActor) == 0x000000, "Member 'BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_1_TgfAttribute_DeathEvent__DelegateSignature::OwningActor' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(sizeof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong size on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(offsetof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature, OwningActor) == 0x000000, "Member 'BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_3_TgfAttribute_DeathEvent__DelegateSignature::OwningActor' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(sizeof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong size on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(offsetof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature, OwningActor) == 0x000000, "Member 'BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_4_TgfAttribute_DeathEvent__DelegateSignature::OwningActor' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(sizeof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature) == 0x000008, "Wrong size on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature");
static_assert(offsetof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature, OwningActor) == 0x000000, "Member 'BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_AttributeComponent_K2Node_ComponentBoundEvent_5_TgfAttribute_DeathEvent__DelegateSignature::OwningActor' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature final
{
public:
	class ULyraPawnComponent_CharacterParts*      ComponentWithChangedParts;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature");
static_assert(sizeof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature) == 0x000008, "Wrong size on BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature");
static_assert(offsetof(BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature, ComponentWithChangedParts) == 0x000000, "Member 'BP_Fighter_HeroSample_C_BndEvt__BP_Fighter_HeroSample_BP_TgfPawnCosmetics_K2Node_ComponentBoundEvent_1_LyraSpawnedCharacterPartsChanged__DelegateSignature::ComponentWithChangedParts' has a wrong offset!");

// Function BP_Fighter_HeroSample.BP_Fighter_HeroSample_C.CheckHitValid
// 0x0788 (0x0788 - 0x0000)
struct BP_Fighter_HeroSample_C_CheckHitValid final
{
public:
	class AActor*                                 SrcActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SrcName;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class ALyraCharacter*                         TrgLyra;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Trg;                                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Src;                                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         SrcLyra;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0050)(HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0138(0x0018)()
	class FString                                 CallFunc_GetCharacterName_ReturnValue_1;           // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0160(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x01B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0218(0x0050)(HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character_1;             // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0278(0x0050)(HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerController_ReturnValue;      // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Vector3fToString_ReturnValue;        // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Vector3fToString_ReturnValue_1;      // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0328(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0340(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0358(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x03A8(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Vector3fToString_ReturnValue_2;      // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0410(0x0018)()
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0428(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0438(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0488(0x0018)()
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
