#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_SpawnActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_NpcBehavior_Base_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GlobalBehavior_SpawnActor.BP_GlobalBehavior_SpawnActor_C
// 0x0080 (0x0120 - 0x00A0)
class UBP_GlobalBehavior_SpawnActor_C final : public UBP_NpcBehavior_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 ActorClass;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Spawn_Transform;                                   // 0x00B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Audio;                                             // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DoBehavior(const struct FGameplayTag& GameplayTag, const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_BP_GlobalBehavior_SpawnActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GlobalBehavior_SpawnActor_C">();
	}
	static class UBP_GlobalBehavior_SpawnActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GlobalBehavior_SpawnActor_C>();
	}
};
static_assert(alignof(UBP_GlobalBehavior_SpawnActor_C) == 0x000010, "Wrong alignment on UBP_GlobalBehavior_SpawnActor_C");
static_assert(sizeof(UBP_GlobalBehavior_SpawnActor_C) == 0x000120, "Wrong size on UBP_GlobalBehavior_SpawnActor_C");
static_assert(offsetof(UBP_GlobalBehavior_SpawnActor_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_GlobalBehavior_SpawnActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GlobalBehavior_SpawnActor_C, ActorClass) == 0x0000A8, "Member 'UBP_GlobalBehavior_SpawnActor_C::ActorClass' has a wrong offset!");
static_assert(offsetof(UBP_GlobalBehavior_SpawnActor_C, Spawn_Transform) == 0x0000B0, "Member 'UBP_GlobalBehavior_SpawnActor_C::Spawn_Transform' has a wrong offset!");
static_assert(offsetof(UBP_GlobalBehavior_SpawnActor_C, Audio) == 0x000110, "Member 'UBP_GlobalBehavior_SpawnActor_C::Audio' has a wrong offset!");

}

