#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_GrantAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NpcBehavior_Base_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GlobalBehavior_GrantAbility.BP_GlobalBehavior_GrantAbility_C
// 0x0018 (0x00B8 - 0x00A0)
class UBP_GlobalBehavior_GrantAbility_C final : public UBP_NpcBehavior_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayAbility>           AbilityClass;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           InputTag;                                          // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DoBehavior(const struct FGameplayTag& GameplayTag, const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_BP_GlobalBehavior_GrantAbility(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GlobalBehavior_GrantAbility_C">();
	}
	static class UBP_GlobalBehavior_GrantAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GlobalBehavior_GrantAbility_C>();
	}
};
static_assert(alignof(UBP_GlobalBehavior_GrantAbility_C) == 0x000008, "Wrong alignment on UBP_GlobalBehavior_GrantAbility_C");
static_assert(sizeof(UBP_GlobalBehavior_GrantAbility_C) == 0x0000B8, "Wrong size on UBP_GlobalBehavior_GrantAbility_C");
static_assert(offsetof(UBP_GlobalBehavior_GrantAbility_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_GlobalBehavior_GrantAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GlobalBehavior_GrantAbility_C, AbilityClass) == 0x0000A8, "Member 'UBP_GlobalBehavior_GrantAbility_C::AbilityClass' has a wrong offset!");
static_assert(offsetof(UBP_GlobalBehavior_GrantAbility_C, InputTag) == 0x0000B0, "Member 'UBP_GlobalBehavior_GrantAbility_C::InputTag' has a wrong offset!");

}

