#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_CountCompletedTasks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NpcBehavior_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GlobalBehavior_CountCompletedTasks.BP_GlobalBehavior_CountCompletedTasks_C
// 0x0010 (0x00B0 - 0x00A0)
class UBP_GlobalBehavior_CountCompletedTasks_C final : public UBP_NpcBehavior_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         TaskNumber;                                        // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CompletedTaskNumber;                               // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DoBehavior(const struct FGameplayTag& GameplayTag, const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_BP_GlobalBehavior_CountCompletedTasks(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GlobalBehavior_CountCompletedTasks_C">();
	}
	static class UBP_GlobalBehavior_CountCompletedTasks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_GlobalBehavior_CountCompletedTasks_C>();
	}
};
static_assert(alignof(UBP_GlobalBehavior_CountCompletedTasks_C) == 0x000008, "Wrong alignment on UBP_GlobalBehavior_CountCompletedTasks_C");
static_assert(sizeof(UBP_GlobalBehavior_CountCompletedTasks_C) == 0x0000B0, "Wrong size on UBP_GlobalBehavior_CountCompletedTasks_C");
static_assert(offsetof(UBP_GlobalBehavior_CountCompletedTasks_C, UberGraphFrame) == 0x0000A0, "Member 'UBP_GlobalBehavior_CountCompletedTasks_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_GlobalBehavior_CountCompletedTasks_C, TaskNumber) == 0x0000A8, "Member 'UBP_GlobalBehavior_CountCompletedTasks_C::TaskNumber' has a wrong offset!");
static_assert(offsetof(UBP_GlobalBehavior_CountCompletedTasks_C, CompletedTaskNumber) == 0x0000AC, "Member 'UBP_GlobalBehavior_CountCompletedTasks_C::CompletedTaskNumber' has a wrong offset!");

}

