#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_LeaveLevel

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GlobalBehavior_LeaveLevel.BP_GlobalBehavior_LeaveLevel_C.DoBehavior
// 0x00B8 (0x00B8 - 0x0000)
struct BP_GlobalBehavior_LeaveLevel_C_DoBehavior final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GlobalBehavior_LeaveLevel_C_DoBehavior) == 0x000008, "Wrong alignment on BP_GlobalBehavior_LeaveLevel_C_DoBehavior");
static_assert(sizeof(BP_GlobalBehavior_LeaveLevel_C_DoBehavior) == 0x0000B8, "Wrong size on BP_GlobalBehavior_LeaveLevel_C_DoBehavior");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_DoBehavior, GameplayTag) == 0x000000, "Member 'BP_GlobalBehavior_LeaveLevel_C_DoBehavior::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_DoBehavior, EventData) == 0x000008, "Member 'BP_GlobalBehavior_LeaveLevel_C_DoBehavior::EventData' has a wrong offset!");

// Function BP_GlobalBehavior_LeaveLevel.BP_GlobalBehavior_LeaveLevel_C.ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel
// 0x00F0 (0x00F0 - 0x0000)
struct BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_GameplayTag;                          // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0020(0x00B0)(ConstParm)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasReceivedEvent_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel) == 0x000008, "Wrong alignment on BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel");
static_assert(sizeof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel) == 0x0000F0, "Wrong size on BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, EntryPoint) == 0x000000, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, K2Node_Event_GameplayTag) == 0x000014, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::K2Node_Event_GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, K2Node_Event_EventData) == 0x000020, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x0000D0, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, CallFunc_HasReceivedEvent_ReturnValue) == 0x0000D8, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::CallFunc_HasReceivedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, CallFunc_SelectFloat_ReturnValue) == 0x0000E0, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel, CallFunc_Delay_Duration_ImplicitCast) == 0x0000E8, "Member 'BP_GlobalBehavior_LeaveLevel_C_ExecuteUbergraph_BP_GlobalBehavior_LeaveLevel::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

