#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_RemoveTagsFromLocalPlayer

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GlobalBehavior_RemoveTagsFromLocalPlayer.BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C.DoBehavior
// 0x00B8 (0x00B8 - 0x0000)
struct BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior) == 0x000008, "Wrong alignment on BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior");
static_assert(sizeof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior) == 0x0000B8, "Wrong size on BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior, GameplayTag) == 0x000000, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior, EventData) == 0x000008, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_DoBehavior::EventData' has a wrong offset!");

// Function BP_GlobalBehavior_RemoveTagsFromLocalPlayer.BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C.ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer
// 0x00F0 (0x00F0 - 0x0000)
struct BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_GameplayTag;                          // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0020(0x00B0)(ConstParm)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer) == 0x000008, "Wrong alignment on BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer");
static_assert(sizeof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer) == 0x0000F0, "Wrong size on BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, EntryPoint) == 0x000000, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, K2Node_Event_GameplayTag) == 0x000014, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::K2Node_Event_GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, K2Node_Event_EventData) == 0x000020, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D0, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000D8, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E0, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x0000E9, "Member 'BP_GlobalBehavior_RemoveTagsFromLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_RemoveTagsFromLocalPlayer::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");

}

