#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_GrantAbility

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GlobalBehavior_GrantAbility.BP_GlobalBehavior_GrantAbility_C.DoBehavior
// 0x00B8 (0x00B8 - 0x0000)
struct BP_GlobalBehavior_GrantAbility_C_DoBehavior final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GlobalBehavior_GrantAbility_C_DoBehavior) == 0x000008, "Wrong alignment on BP_GlobalBehavior_GrantAbility_C_DoBehavior");
static_assert(sizeof(BP_GlobalBehavior_GrantAbility_C_DoBehavior) == 0x0000B8, "Wrong size on BP_GlobalBehavior_GrantAbility_C_DoBehavior");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_DoBehavior, GameplayTag) == 0x000000, "Member 'BP_GlobalBehavior_GrantAbility_C_DoBehavior::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_DoBehavior, EventData) == 0x000008, "Member 'BP_GlobalBehavior_GrantAbility_C_DoBehavior::EventData' has a wrong offset!");

// Function BP_GlobalBehavior_GrantAbility.BP_GlobalBehavior_GrantAbility_C.ExecuteUbergraph_BP_GlobalBehavior_GrantAbility
// 0x00E8 (0x00E8 - 0x0000)
struct BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_GameplayTag;                          // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00B0)(ConstParm)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Fighter_HeroSample_C*               K2Node_DynamicCast_AsBP_Fighter_Hero_Sample;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             CallFunc_GiveAbilityByInputTag_ReturnValue;        // 0x00E0(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility) == 0x000008, "Wrong alignment on BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility");
static_assert(sizeof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility) == 0x0000E8, "Wrong size on BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, EntryPoint) == 0x000000, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, K2Node_Event_GameplayTag) == 0x000004, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::K2Node_Event_GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, K2Node_Event_EventData) == 0x000010, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000C0, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, K2Node_DynamicCast_AsBP_Fighter_Hero_Sample) == 0x0000C8, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::K2Node_DynamicCast_AsBP_Fighter_Hero_Sample' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, CallFunc_GetLyraAbilitySystemComponent_ReturnValue) == 0x0000D8, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::CallFunc_GetLyraAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility, CallFunc_GiveAbilityByInputTag_ReturnValue) == 0x0000E0, "Member 'BP_GlobalBehavior_GrantAbility_C_ExecuteUbergraph_BP_GlobalBehavior_GrantAbility::CallFunc_GiveAbilityByInputTag_ReturnValue' has a wrong offset!");

}

