#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_CountKillings

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GlobalBehavior_CountKillings.BP_GlobalBehavior_CountKillings_C.DoBehavior
// 0x00B8 (0x00B8 - 0x0000)
struct BP_GlobalBehavior_CountKillings_C_DoBehavior final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GlobalBehavior_CountKillings_C_DoBehavior) == 0x000008, "Wrong alignment on BP_GlobalBehavior_CountKillings_C_DoBehavior");
static_assert(sizeof(BP_GlobalBehavior_CountKillings_C_DoBehavior) == 0x0000B8, "Wrong size on BP_GlobalBehavior_CountKillings_C_DoBehavior");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoBehavior, GameplayTag) == 0x000000, "Member 'BP_GlobalBehavior_CountKillings_C_DoBehavior::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoBehavior, EventData) == 0x000008, "Member 'BP_GlobalBehavior_CountKillings_C_DoBehavior::EventData' has a wrong offset!");

// Function BP_GlobalBehavior_CountKillings.BP_GlobalBehavior_CountKillings_C.DoChecks
// 0x00C0 (0x00C0 - 0x0000)
struct BP_GlobalBehavior_CountKillings_C_DoChecks final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          PassCheck;                                         // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalBehavior_CountKillings_C_DoChecks) == 0x000008, "Wrong alignment on BP_GlobalBehavior_CountKillings_C_DoChecks");
static_assert(sizeof(BP_GlobalBehavior_CountKillings_C_DoChecks) == 0x0000C0, "Wrong size on BP_GlobalBehavior_CountKillings_C_DoChecks");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoChecks, GameplayTag) == 0x000000, "Member 'BP_GlobalBehavior_CountKillings_C_DoChecks::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoChecks, EventData) == 0x000008, "Member 'BP_GlobalBehavior_CountKillings_C_DoChecks::EventData' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoChecks, PassCheck) == 0x0000B8, "Member 'BP_GlobalBehavior_CountKillings_C_DoChecks::PassCheck' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoChecks, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000B9, "Member 'BP_GlobalBehavior_CountKillings_C_DoChecks::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoChecks, CallFunc_ObjectIsA_ReturnValue) == 0x0000BA, "Member 'BP_GlobalBehavior_CountKillings_C_DoChecks::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_DoChecks, CallFunc_BooleanAND_ReturnValue) == 0x0000BB, "Member 'BP_GlobalBehavior_CountKillings_C_DoChecks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_GlobalBehavior_CountKillings.BP_GlobalBehavior_CountKillings_C.ExecuteUbergraph_BP_GlobalBehavior_CountKillings
// 0x00D8 (0x00D8 - 0x0000)
struct BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_GameplayTag;                          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0018(0x00B0)(ConstParm)
	int32                                         Temp_int_Variable;                                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings) == 0x000008, "Wrong alignment on BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings");
static_assert(sizeof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings) == 0x0000D8, "Wrong size on BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings, EntryPoint) == 0x000000, "Member 'BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings, K2Node_Event_GameplayTag) == 0x000010, "Member 'BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings::K2Node_Event_GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings, K2Node_Event_EventData) == 0x000018, "Member 'BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings, Temp_int_Variable) == 0x0000C8, "Member 'BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings, CallFunc_Add_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_GlobalBehavior_CountKillings_C_ExecuteUbergraph_BP_GlobalBehavior_CountKillings::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

