#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalBehavior_TeleportAndDazeLocalPlayer

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GlobalBehavior_TeleportAndDazeLocalPlayer.BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C.DoBehavior
// 0x00B8 (0x00B8 - 0x0000)
struct BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior) == 0x000008, "Wrong alignment on BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior");
static_assert(sizeof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior) == 0x0000B8, "Wrong size on BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior, GameplayTag) == 0x000000, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior, EventData) == 0x000008, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_DoBehavior::EventData' has a wrong offset!");

// Function BP_GlobalBehavior_TeleportAndDazeLocalPlayer.BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C.ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer
// 0x0120 (0x0120 - 0x0000)
struct BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetOwnPlayer_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_GameplayTag;                          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0020(0x00B0)(ConstParm)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer) == 0x000008, "Wrong alignment on BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer");
static_assert(sizeof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer) == 0x000120, "Wrong size on BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, EntryPoint) == 0x000000, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_GetOwnPlayer_ReturnValue) == 0x000010, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_GetOwnPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, K2Node_Event_GameplayTag) == 0x000018, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::K2Node_Event_GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, K2Node_Event_EventData) == 0x000020, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_K2_GetPawn_ReturnValue) == 0x0000D0, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_IsLocalPlayerController_ReturnValue) == 0x0000D8, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, K2Node_DynamicCast_AsLyra_Character) == 0x0000E0, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_GetLyraAbilitySystemComponent_ReturnValue) == 0x0000F0, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_GetLyraAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000F8, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000114, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_IsValid_ReturnValue_1) == 0x00011C, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer, CallFunc_K2_TeleportTo_ReturnValue) == 0x00011D, "Member 'BP_GlobalBehavior_TeleportAndDazeLocalPlayer_C_ExecuteUbergraph_BP_GlobalBehavior_TeleportAndDazeLocalPlayer::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");

}

