#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableChest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractableChest.BP_InteractableChest_C.ExecuteUbergraph_BP_InteractableChest
// 0x04B8 (0x04B8 - 0x0000)
struct BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ExperienceReady*           CallFunc_WaitForExperienceReady_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfEquipQuality                              Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_4;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_6;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_7;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_8;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_9;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_10;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_11;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipQuality                              Temp_byte_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_12;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_Event_InteractingPawn_1;                    // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GenerateLoot_TimeRemainder;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraInventoryManagerComponent*         CallFunc_GetComponentByClass_ReturnValue_1;        // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryManagerComponent*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetDefaultInventorySize_ReturnValue;      // 0x0204(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_GetAsset_ReturnValue;                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_InteractingPawn;                // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_13;                           // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable_14;                           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable_15;                           // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryManagerComponent*          CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULyraInventoryItemInstance*>     CallFunc_GetAllItems_ReturnValue;                  // 0x0288(0x0010)(ReferenceParm)
	class ULyraInventoryItemInstance*             CallFunc_Array_Get_Item;                           // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInventoryFragment_InventoryIcon* CallFunc_FindFragmentByClass_ReturnValue;          // 0x02A8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULyraInventoryItemDefinition> CallFunc_GetItemDef_ReturnValue;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsTgf_Inventory_Item_Definition; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_InteractingPawn;                      // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraInventoryManagerComponent*         CallFunc_GetComponentByClass_ReturnValue_4;        // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue_5;        // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPVPMatchType_ReturnValue;               // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetDefaultInventorySizeInPVP_ReturnValue; // 0x033C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_IntPointToVector2D_ReturnValue;      // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_Select_Default_2;                           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0370(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x03C0(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0410(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0428(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0478(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0488(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest) == 0x000008, "Wrong alignment on BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest");
static_assert(sizeof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest) == 0x0004B8, "Wrong size on BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, EntryPoint) == 0x000000, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable) == 0x000008, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_1) == 0x000010, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_2) == 0x000018, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_3) == 0x000020, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_WaitForExperienceReady_ReturnValue) == 0x000038, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_WaitForExperienceReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_byte_Variable) == 0x000040, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_4) == 0x000048, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_5) == 0x000050, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_6) == 0x000058, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_7) == 0x000060, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_8) == 0x000068, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_9) == 0x000070, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_10) == 0x000078, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_11) == 0x000080, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_bool_Variable) == 0x000088, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_byte_Variable_1) == 0x000089, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_int_Array_Index_Variable) == 0x000094, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_12) == 0x000098, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_delegate_Variable) == 0x0000A0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000D0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_Event_InteractingPawn_1) == 0x0001B8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_Event_InteractingPawn_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GenerateLoot_TimeRemainder) == 0x0001C0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GenerateLoot_TimeRemainder' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetController_ReturnValue) == 0x0001D0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_1) == 0x0001D8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetComponentByClass_ReturnValue) == 0x0001E0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_2) == 0x0001E8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0001F0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0001F8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_3) == 0x000200, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_4) == 0x000201, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetDefaultInventorySize_ReturnValue) == 0x000204, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetDefaultInventorySize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x00020C, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetAsset_ReturnValue) == 0x000210, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_Select_Default) == 0x000218, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_5) == 0x000220, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetOwner_ReturnValue) == 0x000228, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_CustomEvent_InteractingPawn) == 0x000230, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_CustomEvent_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetController_ReturnValue_1) == 0x000238, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_13) == 0x000240, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000248, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_14) == 0x000250, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000258, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, Temp_object_Variable_15) == 0x000260, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_Select_Default_1) == 0x000268, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000270, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000278, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_HasAuthority_ReturnValue) == 0x000280, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_6) == 0x000281, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetAllItems_ReturnValue) == 0x000288, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetAllItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Array_Get_Item) == 0x000298, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Array_Length_ReturnValue) == 0x0002A0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_FindFragmentByClass_ReturnValue) == 0x0002A8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_FindFragmentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Less_IntInt_ReturnValue) == 0x0002B0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetItemDef_ReturnValue) == 0x0002B8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_ClassDynamicCast_AsTgf_Inventory_Item_Definition) == 0x0002C0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_ClassDynamicCast_AsTgf_Inventory_Item_Definition' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_ClassDynamicCast_bSuccess) == 0x0002C8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0002CC, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Conv_IntToByte_ReturnValue) == 0x0002D0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Array_Contains_ReturnValue) == 0x0002D1, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Greater_ByteByte_ReturnValue) == 0x0002D2, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_BooleanOR_ReturnValue) == 0x0002D3, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_Event_InteractingPawn) == 0x0002D8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetController_ReturnValue_2) == 0x0002E0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetComponentByClass_ReturnValue_4) == 0x0002E8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_7) == 0x0002F0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_8) == 0x0002F1, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetComponentByClass_ReturnValue_5) == 0x0002F8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsValid_ReturnValue_9) == 0x000300, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetGameState_ReturnValue) == 0x000308, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000310, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_DynamicCast_AsLyra_Game_State) == 0x000328, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_DynamicCast_bSuccess) == 0x000330, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_PostEventAtLocation_ReturnValue) == 0x000334, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_IsPVPMatchType_ReturnValue) == 0x000338, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_IsPVPMatchType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_GetDefaultInventorySizeInPVP_ReturnValue) == 0x00033C, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_GetDefaultInventorySizeInPVP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Conv_IntPointToVector2D_ReturnValue) == 0x000348, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Conv_IntPointToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_Select_Default_2) == 0x000358, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_BreakVector2D_X) == 0x000360, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_BreakVector2D_Y) == 0x000368, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_MakeStruct_FormatArgumentData) == 0x000370, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_MakeStruct_FormatArgumentData_1) == 0x0003C0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Conv_BoolToText_ReturnValue) == 0x000410, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_MakeStruct_FormatArgumentData_2) == 0x000428, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, K2Node_MakeArray_Array) == 0x000478, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Format_ReturnValue) == 0x000488, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0004A0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x0004A8, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Delay_Duration_ImplicitCast) == 0x0004AC, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest, CallFunc_Delay_Duration_ImplicitCast_1) == 0x0004B0, "Member 'BP_InteractableChest_C_ExecuteUbergraph_BP_InteractableChest::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_InteractableChest.BP_InteractableChest_C.GenerateLoot
// 0x01F8 (0x01F8 - 0x0000)
struct BP_InteractableChest_C_GenerateLoot final
{
public:
	class AActor*                                 InteractingActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        TimeRemainder;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OptionString;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<int32>                                 RealLoot;                                          // 0x0020(0x0010)(Edit, BlueprintVisible)
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           CallFunc_GetPlayerStateFromObject_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ALyraPlayerState*>               CallFunc_GetPlayerStatesWithSameTeam_ReturnValue;  // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMod_Remainder;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTgfInventoryItemInstance*>      CallFunc_Loot_ReturnValue;                         // 0x01A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryItemInstance*              CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMod_Dividend_ImplicitCast;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableChest_C_GenerateLoot) == 0x000008, "Wrong alignment on BP_InteractableChest_C_GenerateLoot");
static_assert(sizeof(BP_InteractableChest_C_GenerateLoot) == 0x0001F8, "Wrong size on BP_InteractableChest_C_GenerateLoot");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, InteractingActor) == 0x000000, "Member 'BP_InteractableChest_C_GenerateLoot::InteractingActor' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, TimeRemainder) == 0x000008, "Member 'BP_InteractableChest_C_GenerateLoot::TimeRemainder' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, OptionString) == 0x000010, "Member 'BP_InteractableChest_C_GenerateLoot::OptionString' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, RealLoot) == 0x000020, "Member 'BP_InteractableChest_C_GenerateLoot::RealLoot' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000030, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_GetPlayerStateFromObject_ReturnValue) == 0x000038, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_GetPlayerStateFromObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_GetPlayerStatesWithSameTeam_ReturnValue) == 0x000040, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_GetPlayerStatesWithSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_InteractableChest_C_GenerateLoot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'BP_InteractableChest_C_GenerateLoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_GetObjectClass_ReturnValue) == 0x000060, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_GetClassDisplayName_ReturnValue) == 0x000068, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_GetDisplayName_ReturnValue) == 0x000078, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, K2Node_MakeStruct_FormatArgumentData) == 0x0000B8, "Member 'BP_InteractableChest_C_GenerateLoot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'BP_InteractableChest_C_GenerateLoot::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, K2Node_MakeArray_Array) == 0x000158, "Member 'BP_InteractableChest_C_GenerateLoot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_Format_ReturnValue) == 0x000168, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_Not_PreBool_ReturnValue) == 0x000180, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, Temp_int_Variable) == 0x000184, "Member 'BP_InteractableChest_C_GenerateLoot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000188, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_Add_IntInt_ReturnValue_1) == 0x00018C, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_BooleanAND_ReturnValue) == 0x000190, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableChest_C_GenerateLoot, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x000194, "Member 'BP_InteractableChest_C_GenerateLoot::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
