#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootOptionComponent

#include "Basic.hpp"

#include "FLootOptionEntry_structs.hpp"


namespace SDK::Params
{

// Function BP_LootOptionComponent.BP_LootOptionComponent_C.PickLoot
// 0x0080 (0x0080 - 0x0000)
struct BP_LootOptionComponent_C_PickLoot final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Loot;                                              // 0x0008(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasOption_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLootOptionEntry                      CallFunc_Map_Find_Value;                           // 0x0068(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootOptionComponent_C_PickLoot) == 0x000008, "Wrong alignment on BP_LootOptionComponent_C_PickLoot");
static_assert(sizeof(BP_LootOptionComponent_C_PickLoot) == 0x000080, "Wrong size on BP_LootOptionComponent_C_PickLoot");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, Result) == 0x000000, "Member 'BP_LootOptionComponent_C_PickLoot::Result' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, Loot) == 0x000008, "Member 'BP_LootOptionComponent_C_PickLoot::Loot' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'BP_LootOptionComponent_C_PickLoot::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_LootOptionComponent_C_PickLoot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_LootOptionComponent_C_PickLoot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, K2Node_DynamicCast_AsLyra_Game_State) == 0x000038, "Member 'BP_LootOptionComponent_C_PickLoot::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_LootOptionComponent_C_PickLoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Map_Keys_Keys) == 0x000048, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Array_Get_Item) == 0x00005C, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_HasOption_ReturnValue) == 0x000061, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_HasOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Map_Find_Value) == 0x000068, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_LootOptionComponent_C_PickLoot, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'BP_LootOptionComponent_C_PickLoot::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

