#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapInteractionComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.AddMapHint
// 0x0028 (0x0028 - 0x0000)
struct BP_MapInteractionComponent_C_AddMapHint final
{
public:
	class APawn*                                  InteractPawn;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InteractObject;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ObjectLocation;                                    // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_AddMapHint) == 0x000008, "Wrong alignment on BP_MapInteractionComponent_C_AddMapHint");
static_assert(sizeof(BP_MapInteractionComponent_C_AddMapHint) == 0x000028, "Wrong size on BP_MapInteractionComponent_C_AddMapHint");
static_assert(offsetof(BP_MapInteractionComponent_C_AddMapHint, InteractPawn) == 0x000000, "Member 'BP_MapInteractionComponent_C_AddMapHint::InteractPawn' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_AddMapHint, InteractObject) == 0x000008, "Member 'BP_MapInteractionComponent_C_AddMapHint::InteractObject' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_AddMapHint, ObjectLocation) == 0x000010, "Member 'BP_MapInteractionComponent_C_AddMapHint::ObjectLocation' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.CheckInteractionDistanceOnClient
// 0x0058 (0x0058 - 0x0000)
struct BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient final
{
public:
	class ABP_InteractableBase_C*                 InteractableCandidate;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  InteractingPawn;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVerticalDistanceTo_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Server_Check_Distance_ServerCheckDistanceXY; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Server_Check_Distance_ServerCheckDistanceZ; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient) == 0x000008, "Wrong alignment on BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient");
static_assert(sizeof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient) == 0x000058, "Wrong size on BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, InteractableCandidate) == 0x000000, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::InteractableCandidate' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, InteractingPawn) == 0x000008, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, ReturnValue) == 0x000010, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_GetVerticalDistanceTo_ReturnValue) == 0x000014, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_GetVerticalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000018, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_Get_Server_Check_Distance_ServerCheckDistanceXY) == 0x000020, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_Get_Server_Check_Distance_ServerCheckDistanceXY' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_Get_Server_Check_Distance_ServerCheckDistanceZ) == 0x000028, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_Get_Server_Check_Distance_ServerCheckDistanceZ' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000041, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000050, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnClient::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.CheckInteractionDistanceOnServer
// 0x0048 (0x0048 - 0x0000)
struct BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer final
{
public:
	class ABP_InteractableBase_C*                 InteractableCandidate;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  InteractingPawn;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVerticalDistanceTo_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Get_Server_Check_Distance_ServerCheckDistanceXY; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Server_Check_Distance_ServerCheckDistanceZ; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer) == 0x000008, "Wrong alignment on BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer");
static_assert(sizeof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer) == 0x000048, "Wrong size on BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, InteractableCandidate) == 0x000000, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::InteractableCandidate' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, InteractingPawn) == 0x000008, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, ReturnValue) == 0x000010, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_GetVerticalDistanceTo_ReturnValue) == 0x000014, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_GetVerticalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000018, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_Get_Server_Check_Distance_ServerCheckDistanceXY) == 0x000020, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_Get_Server_Check_Distance_ServerCheckDistanceXY' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_Get_Server_Check_Distance_ServerCheckDistanceZ) == 0x000028, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_Get_Server_Check_Distance_ServerCheckDistanceZ' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000031, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000040, "Member 'BP_MapInteractionComponent_C_CheckInteractionDistanceOnServer::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.CheckTargetLock
// 0x01C8 (0x01C8 - 0x0000)
struct BP_MapInteractionComponent_C_CheckTargetLock final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetViewRay_Start;                         // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetViewRay_End;                           // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngleBetweenTwoVectors_ReturnValue;    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngleBetweenTwoVectors_ReturnValue_1;  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetInteractableLocation_Result;           // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetBaseInteractDistance_BaseInteractDistance; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngleBetweenTwoVectors_ReturnValue_2;  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnabled_Result;                        // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AF[0x1];                                      // 0x01AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_CheckTargetLock) == 0x000008, "Wrong alignment on BP_MapInteractionComponent_C_CheckTargetLock");
static_assert(sizeof(BP_MapInteractionComponent_C_CheckTargetLock) == 0x0001C8, "Wrong size on BP_MapInteractionComponent_C_CheckTargetLock");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, Result) == 0x000000, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::Result' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_X) == 0x000010, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_Y) == 0x000018, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_Z) == 0x000020, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, K2Node_DynamicCast_AsPlayer_Controller) == 0x000028, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_K2_GetPawn_ReturnValue) == 0x000050, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_MakeVector_ReturnValue_1) == 0x000058, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetViewRay_Start) == 0x000090, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetViewRay_Start' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetViewRay_End) == 0x0000A8, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetViewRay_End' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C0, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_X_1) == 0x0000D8, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_Y_1) == 0x0000E0, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_Z_1) == 0x0000E8, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_MakeVector_ReturnValue_2) == 0x0000F0, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_MakeVector_ReturnValue_3) == 0x000108, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetAngleBetweenTwoVectors_ReturnValue) == 0x000120, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetAngleBetweenTwoVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetAngleBetweenTwoVectors_ReturnValue_1) == 0x000124, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetAngleBetweenTwoVectors_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000128, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000129, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetInteractableLocation_Result) == 0x000130, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetInteractableLocation_Result' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_IsValid_ReturnValue_1) == 0x000148, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000150, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_X_2) == 0x000168, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_Y_2) == 0x000170, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_BreakVector_Z_2) == 0x000178, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Vector_Distance_ReturnValue) == 0x000180, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_MakeVector_ReturnValue_4) == 0x000188, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetBaseInteractDistance_BaseInteractDistance) == 0x0001A0, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetBaseInteractDistance_BaseInteractDistance' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetAngleBetweenTwoVectors_ReturnValue_2) == 0x0001A8, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetAngleBetweenTwoVectors_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x0001AC, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x0001AD, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_GetEnabled_Result) == 0x0001AE, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_GetEnabled_Result' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001B0, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0001B8, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_CheckTargetLock, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x0001C0, "Member 'BP_MapInteractionComponent_C_CheckTargetLock::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.ChooseTraceResult
// 0x03B8 (0x03B8 - 0x0000)
struct BP_MapInteractionComponent_C_ChooseTraceResult final
{
public:
	TArray<struct FHitResult>                     Hits;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FHitResult                             Hit;                                               // 0x0010(0x00E8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x00F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x01F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B2[0x2];                                      // 0x03B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_ChooseTraceResult) == 0x000008, "Wrong alignment on BP_MapInteractionComponent_C_ChooseTraceResult");
static_assert(sizeof(BP_MapInteractionComponent_C_ChooseTraceResult) == 0x0003B8, "Wrong size on BP_MapInteractionComponent_C_ChooseTraceResult");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, Hits) == 0x000000, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::Hits' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, Hit) == 0x000010, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::Hit' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, Temp_int_Array_Index_Variable) == 0x0001E4, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, Temp_int_Loop_Counter_Variable) == 0x0001E8, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_bBlockingHit) == 0x0002D8, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002D9, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_Time) == 0x0002DC, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_Distance) == 0x0002E0, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_Location) == 0x0002E8, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_ImpactPoint) == 0x000300, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_Normal) == 0x000318, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_ImpactNormal) == 0x000330, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_PhysMat) == 0x000348, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_HitActor) == 0x000350, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_HitComponent) == 0x000358, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_HitBoneName) == 0x000360, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_BoneName) == 0x000368, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_HitItem) == 0x000370, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_ElementIndex) == 0x000374, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_FaceIndex) == 0x000378, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_TraceStart) == 0x000380, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_BreakHitResult_TraceEnd) == 0x000398, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_Less_IntInt_ReturnValue) == 0x0003B0, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_ObjectIsA_ReturnValue) == 0x0003B1, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ChooseTraceResult, CallFunc_Add_IntInt_ReturnValue) == 0x0003B4, "Member 'BP_MapInteractionComponent_C_ChooseTraceResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.ClearCandidate
// 0x0010 (0x0010 - 0x0000)
struct BP_MapInteractionComponent_C_ClearCandidate final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_ClearCandidate) == 0x000008, "Wrong alignment on BP_MapInteractionComponent_C_ClearCandidate");
static_assert(sizeof(BP_MapInteractionComponent_C_ClearCandidate) == 0x000010, "Wrong size on BP_MapInteractionComponent_C_ClearCandidate");
static_assert(offsetof(BP_MapInteractionComponent_C_ClearCandidate, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_MapInteractionComponent_C_ClearCandidate::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ClearCandidate, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_MapInteractionComponent_C_ClearCandidate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapInteractionComponent_C_ClearCandidate, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_MapInteractionComponent_C_ClearCandidate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.EndInteract
// 0x0001 (0x0001 - 0x0000)
struct BP_MapInteractionComponent_C_EndInteract final
{
public:
	bool                                          Broken;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_EndInteract) == 0x000001, "Wrong alignment on BP_MapInteractionComponent_C_EndInteract");
static_assert(sizeof(BP_MapInteractionComponent_C_EndInteract) == 0x000001, "Wrong size on BP_MapInteractionComponent_C_EndInteract");
static_assert(offsetof(BP_MapInteractionComponent_C_EndInteract, Broken) == 0x000000, "Member 'BP_MapInteractionComponent_C_EndInteract::Broken' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.EndInteractOnServer
// 0x0001 (0x0001 - 0x0000)
struct BP_MapInteractionComponent_C_EndInteractOnServer final
{
public:
	bool                                          Broken;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapInteractionComponent_C_EndInteractOnServer) == 0x000001, "Wrong alignment on BP_MapInteractionComponent_C_EndInteractOnServer");
static_assert(sizeof(BP_MapInteractionComponent_C_EndInteractOnServer) == 0x000001, "Wrong size on BP_MapInteractionComponent_C_EndInteractOnServer");
static_assert(offsetof(BP_MapInteractionComponent_C_EndInteractOnServer, Broken) == 0x000000, "Member 'BP_MapInteractionComponent_C_EndInteractOnServer::Broken' has a wrong offset!");

// Function BP_MapInteractionComponent.BP_MapInteractionComponent_C.ExecuteUbergraph_BP_MapInteractionComponent
// 0x05C8 (0x05C8 - 0x0000)
struct BP_MapInteractionComponent_C_ExecuteUbergraph_BP_MapInteractionComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawnFromObject_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraHeroComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetViewRay_Start;                         // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetViewRay_End;                           // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Broken_1;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnabled_Result;                        // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraInventoryManagerComponent*         K2Node_CustomEvent_Inventory_Manager;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULyraEquipmentManagerComponent*         K2Node_CustomEvent_Equipment_Manager;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULyraInventoryItemInstance*             K2Node_CustomEvent_ItemInstance;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
