#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcBehavior_SendGameplayEvent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_NpcBehavior_SendGameplayEvent.BP_NpcBehavior_SendGameplayEvent_C.DoBehavior
// 0x00B8 (0x00B8 - 0x0000)
struct BP_NpcBehavior_SendGameplayEvent_C_DoBehavior final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Param_EventData;                                   // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_NpcBehavior_SendGameplayEvent_C_DoBehavior) == 0x000008, "Wrong alignment on BP_NpcBehavior_SendGameplayEvent_C_DoBehavior");
static_assert(sizeof(BP_NpcBehavior_SendGameplayEvent_C_DoBehavior) == 0x0000B8, "Wrong size on BP_NpcBehavior_SendGameplayEvent_C_DoBehavior");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_DoBehavior, GameplayTag) == 0x000000, "Member 'BP_NpcBehavior_SendGameplayEvent_C_DoBehavior::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_DoBehavior, Param_EventData) == 0x000008, "Member 'BP_NpcBehavior_SendGameplayEvent_C_DoBehavior::Param_EventData' has a wrong offset!");

// Function BP_NpcBehavior_SendGameplayEvent.BP_NpcBehavior_SendGameplayEvent_C.ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent
// 0x00F0 (0x00F0 - 0x0000)
struct BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ExperienceReady*           CallFunc_WaitForExperienceReady_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_GameplayTag;                          // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0030(0x00B0)(ConstParm)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent) == 0x000008, "Wrong alignment on BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent");
static_assert(sizeof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent) == 0x0000F0, "Wrong size on BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, EntryPoint) == 0x000000, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, CallFunc_WaitForExperienceReady_ReturnValue) == 0x000018, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::CallFunc_WaitForExperienceReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, K2Node_Event_GameplayTag) == 0x000024, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::K2Node_Event_GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, K2Node_Event_EventData) == 0x000030, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent, CallFunc_IsValid_ReturnValue_1) == 0x0000E8, "Member 'BP_NpcBehavior_SendGameplayEvent_C_ExecuteUbergraph_BP_NpcBehavior_SendGameplayEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

