#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcDetectComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NpcDetectComponent.BP_NpcDetectComponent_C
// 0x0160 (0x0208 - 0x00A8)
class UBP_NpcDetectComponent_C final : public UControllerComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class AActor*, double>                   SphereNpcList;                                     // 0x00B0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class AActor*, struct FVector>           BoxNpcList;                                        // 0x0100(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          IsLocalPlayer;                                     // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DistanceErrorTolerance;                            // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         PlayerCharacter;                                   // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, double>                   NpcListInSphereRange;                              // 0x0168(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class AActor*, struct FVector>           NpcListInBoxRange;                                 // 0x01B8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ApproachBoxNpc(class AActor* NPC, class ALyraCharacter* Param_PlayerCharacter, const struct FVector& BoxExtent);
	void ApproachSphereNpc(class AActor* NPC, class ALyraCharacter* Param_PlayerCharacter, double DistanceThreshold);
	void CheckBoxNpcs();
	void CheckSphereNpcs();
	void ExecuteUbergraph_BP_NpcDetectComponent(int32 EntryPoint);
	void LeaveBoxNpc(class AActor* NPC, class ALyraCharacter* Param_PlayerCharacter, const struct FVector& BoxExtent);
	void LeaveSphereNpc(class AActor* NPC, class ALyraCharacter* Param_PlayerCharacter, double DistanceThreshold);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RegisterNpcWithBoxRange(class AActor* NPC, const struct FVector& BoxExtent);
	void RegisterNpcWithSphereRange(class AActor* NPC, double Distance);
	void UnregisterNpcWithBoxRange(class AActor* NPC);
	void UnregisterNpcWithSphereRange(class AActor* NPC);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NpcDetectComponent_C">();
	}
	static class UBP_NpcDetectComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NpcDetectComponent_C>();
	}
};
static_assert(alignof(UBP_NpcDetectComponent_C) == 0x000008, "Wrong alignment on UBP_NpcDetectComponent_C");
static_assert(sizeof(UBP_NpcDetectComponent_C) == 0x000208, "Wrong size on UBP_NpcDetectComponent_C");
static_assert(offsetof(UBP_NpcDetectComponent_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_NpcDetectComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_NpcDetectComponent_C, SphereNpcList) == 0x0000B0, "Member 'UBP_NpcDetectComponent_C::SphereNpcList' has a wrong offset!");
static_assert(offsetof(UBP_NpcDetectComponent_C, BoxNpcList) == 0x000100, "Member 'UBP_NpcDetectComponent_C::BoxNpcList' has a wrong offset!");
static_assert(offsetof(UBP_NpcDetectComponent_C, IsLocalPlayer) == 0x000150, "Member 'UBP_NpcDetectComponent_C::IsLocalPlayer' has a wrong offset!");
static_assert(offsetof(UBP_NpcDetectComponent_C, DistanceErrorTolerance) == 0x000158, "Member 'UBP_NpcDetectComponent_C::DistanceErrorTolerance' has a wrong offset!");
static_assert(offsetof(UBP_NpcDetectComponent_C, PlayerCharacter) == 0x000160, "Member 'UBP_NpcDetectComponent_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(UBP_NpcDetectComponent_C, NpcListInSphereRange) == 0x000168, "Member 'UBP_NpcDetectComponent_C::NpcListInSphereRange' has a wrong offset!");
static_assert(offsetof(UBP_NpcDetectComponent_C, NpcListInBoxRange) == 0x0001B8, "Member 'UBP_NpcDetectComponent_C::NpcListInBoxRange' has a wrong offset!");

}

