#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcBehavior_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.GameplayEffectHasTag
// 0x00D0 (0x00D0 - 0x0000)
struct BP_NpcBehavior_Base_C_GameplayEffectHasTag final
{
public:
	struct FGameplayEventData                     GameplayEventData;                                 // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           Tag;                                               // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEffect*                        K2Node_DynamicCast_AsGameplay_Effect;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_GameplayEffectHasTag) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_GameplayEffectHasTag");
static_assert(sizeof(BP_NpcBehavior_Base_C_GameplayEffectHasTag) == 0x0000D0, "Wrong size on BP_NpcBehavior_Base_C_GameplayEffectHasTag");
static_assert(offsetof(BP_NpcBehavior_Base_C_GameplayEffectHasTag, GameplayEventData) == 0x000000, "Member 'BP_NpcBehavior_Base_C_GameplayEffectHasTag::GameplayEventData' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GameplayEffectHasTag, Tag) == 0x0000B0, "Member 'BP_NpcBehavior_Base_C_GameplayEffectHasTag::Tag' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GameplayEffectHasTag, ReturnValue) == 0x0000B8, "Member 'BP_NpcBehavior_Base_C_GameplayEffectHasTag::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GameplayEffectHasTag, K2Node_DynamicCast_AsGameplay_Effect) == 0x0000C0, "Member 'BP_NpcBehavior_Base_C_GameplayEffectHasTag::K2Node_DynamicCast_AsGameplay_Effect' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GameplayEffectHasTag, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_NpcBehavior_Base_C_GameplayEffectHasTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GameplayEffectHasTag, CallFunc_HasTag_ReturnValue) == 0x0000C9, "Member 'BP_NpcBehavior_Base_C_GameplayEffectHasTag::CallFunc_HasTag_ReturnValue' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.GetCombatTime
// 0x0030 (0x0030 - 0x0000)
struct BP_NpcBehavior_Base_C_GetCombatTime final
{
public:
	double                                        Result;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCombatTime_Result;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInCombat_Result;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_GetCombatTime) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_GetCombatTime");
static_assert(sizeof(BP_NpcBehavior_Base_C_GetCombatTime) == 0x000030, "Wrong size on BP_NpcBehavior_Base_C_GetCombatTime");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetCombatTime, Result) == 0x000000, "Member 'BP_NpcBehavior_Base_C_GetCombatTime::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetCombatTime, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'BP_NpcBehavior_Base_C_GetCombatTime::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetCombatTime, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000010, "Member 'BP_NpcBehavior_Base_C_GetCombatTime::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetCombatTime, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NpcBehavior_Base_C_GetCombatTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetCombatTime, CallFunc_GetCombatTime_Result) == 0x000020, "Member 'BP_NpcBehavior_Base_C_GetCombatTime::CallFunc_GetCombatTime_Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetCombatTime, CallFunc_IsInCombat_Result) == 0x000028, "Member 'BP_NpcBehavior_Base_C_GetCombatTime::CallFunc_IsInCombat_Result' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.GetFriendlyCount
// 0x0050 (0x0050 - 0x0000)
struct BP_NpcBehavior_Base_C_GetFriendlyCount final
{
public:
	double                                        Range;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_RangeQueryActors_Actors;                  // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostile_Result;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_GetFriendlyCount) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_GetFriendlyCount");
static_assert(sizeof(BP_NpcBehavior_Base_C_GetFriendlyCount) == 0x000050, "Wrong size on BP_NpcBehavior_Base_C_GetFriendlyCount");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, Range) == 0x000000, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::Range' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, Result) == 0x000008, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, Count) == 0x00000C, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::Count' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, CallFunc_RangeQueryActors_Actors) == 0x000018, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::CallFunc_RangeQueryActors_Actors' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, Temp_int_Variable) == 0x000038, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, CallFunc_IsHostile_Result) == 0x000048, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::CallFunc_IsHostile_Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetFriendlyCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_NpcBehavior_Base_C_GetFriendlyCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.GetHealth
// 0x0048 (0x0048 - 0x0000)
struct BP_NpcBehavior_Base_C_GetHealth final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfDefendAttributeSet*                 K2Node_DynamicCast_AsTgf_Defend_Attribute_Set;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_Result_ImplicitCast;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_GetHealth) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_GetHealth");
static_assert(sizeof(BP_NpcBehavior_Base_C_GetHealth) == 0x000048, "Wrong size on BP_NpcBehavior_Base_C_GetHealth");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, Actor) == 0x000000, "Member 'BP_NpcBehavior_Base_C_GetHealth::Actor' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, Result) == 0x000008, "Member 'BP_NpcBehavior_Base_C_GetHealth::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000010, "Member 'BP_NpcBehavior_Base_C_GetHealth::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NpcBehavior_Base_C_GetHealth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, CallFunc_GetAttributeSet_ReturnValue) == 0x000020, "Member 'BP_NpcBehavior_Base_C_GetHealth::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_NpcBehavior_Base_C_GetHealth::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, K2Node_DynamicCast_AsTgf_Defend_Attribute_Set) == 0x000030, "Member 'BP_NpcBehavior_Base_C_GetHealth::K2Node_DynamicCast_AsTgf_Defend_Attribute_Set' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_NpcBehavior_Base_C_GetHealth::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealth, K2Node_FunctionResult_Result_ImplicitCast) == 0x000040, "Member 'BP_NpcBehavior_Base_C_GetHealth::K2Node_FunctionResult_Result_ImplicitCast' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.GetHealthPercent
// 0x0058 (0x0058 - 0x0000)
struct BP_NpcBehavior_Base_C_GetHealthPercent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfDefendAttributeSet*                 K2Node_DynamicCast_AsTgf_Defend_Attribute_Set;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealthFinal_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_GetHealthPercent) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_GetHealthPercent");
static_assert(sizeof(BP_NpcBehavior_Base_C_GetHealthPercent) == 0x000058, "Wrong size on BP_NpcBehavior_Base_C_GetHealthPercent");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, Actor) == 0x000000, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::Actor' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, Result) == 0x000008, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000010, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, CallFunc_GetAttributeSet_ReturnValue) == 0x000020, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, K2Node_DynamicCast_AsTgf_Defend_Attribute_Set) == 0x000030, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::K2Node_DynamicCast_AsTgf_Defend_Attribute_Set' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, CallFunc_GetMaxHealthFinal_ReturnValue) == 0x00003C, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::CallFunc_GetMaxHealthFinal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, CallFunc_SafeDivide_ReturnValue) == 0x000040, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, CallFunc_SafeDivide_B_ImplicitCast) == 0x000048, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHealthPercent, CallFunc_SafeDivide_A_ImplicitCast) == 0x000050, "Member 'BP_NpcBehavior_Base_C_GetHealthPercent::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.GetHostileCount
// 0x0050 (0x0050 - 0x0000)
struct BP_NpcBehavior_Base_C_GetHostileCount final
{
public:
	double                                        Range;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Result;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_RangeQueryActors_Actors;                  // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostile_Result;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_GetHostileCount) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_GetHostileCount");
static_assert(sizeof(BP_NpcBehavior_Base_C_GetHostileCount) == 0x000050, "Wrong size on BP_NpcBehavior_Base_C_GetHostileCount");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, Range) == 0x000000, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::Range' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, Result) == 0x000008, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, Count) == 0x00000C, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::Count' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, CallFunc_RangeQueryActors_Actors) == 0x000018, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::CallFunc_RangeQueryActors_Actors' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, Temp_int_Variable) == 0x000038, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, CallFunc_IsHostile_Result) == 0x000048, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::CallFunc_IsHostile_Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetHostileCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_NpcBehavior_Base_C_GetHostileCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.GetSummonsCount
// 0x0020 (0x0020 - 0x0000)
struct BP_NpcBehavior_Base_C_GetSummonsCount final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetOwningCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfCharacterSummonComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSummonActorsCount_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_GetSummonsCount) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_GetSummonsCount");
static_assert(sizeof(BP_NpcBehavior_Base_C_GetSummonsCount) == 0x000020, "Wrong size on BP_NpcBehavior_Base_C_GetSummonsCount");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetSummonsCount, Result) == 0x000000, "Member 'BP_NpcBehavior_Base_C_GetSummonsCount::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetSummonsCount, CallFunc_GetOwningCharacter_ReturnValue) == 0x000008, "Member 'BP_NpcBehavior_Base_C_GetSummonsCount::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetSummonsCount, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_NpcBehavior_Base_C_GetSummonsCount::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetSummonsCount, CallFunc_GetSummonActorsCount_ReturnValue) == 0x000018, "Member 'BP_NpcBehavior_Base_C_GetSummonsCount::CallFunc_GetSummonActorsCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_GetSummonsCount, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_NpcBehavior_Base_C_GetSummonsCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.HasEnemyBehind
// 0x0048 (0x0048 - 0x0000)
struct BP_NpcBehavior_Base_C_HasEnemyBehind final
{
public:
	double                                        Range;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_RangeQueryActors_Actors;                  // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHostile_Result;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetOwningCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAtBehind_Result;                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_HasEnemyBehind) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_HasEnemyBehind");
static_assert(sizeof(BP_NpcBehavior_Base_C_HasEnemyBehind) == 0x000048, "Wrong size on BP_NpcBehavior_Base_C_HasEnemyBehind");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, Range) == 0x000000, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::Range' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, Result) == 0x000008, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_RangeQueryActors_Actors) == 0x000010, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_RangeQueryActors_Actors' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_IsHostile_Result) == 0x00002C, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_IsHostile_Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_GetOwningCharacter_ReturnValue) == 0x000030, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_IsAtBehind_Result) == 0x000039, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_IsAtBehind_Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_HasEnemyBehind, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_NpcBehavior_Base_C_HasEnemyBehind::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.IsAbility
// 0x00D0 (0x00D0 - 0x0000)
struct BP_NpcBehavior_Base_C_IsAbility final
{
public:
	class UClass*                                 Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Result;                                            // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_IsAbility) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_IsAbility");
static_assert(sizeof(BP_NpcBehavior_Base_C_IsAbility) == 0x0000D0, "Wrong size on BP_NpcBehavior_Base_C_IsAbility");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAbility, Ability) == 0x000000, "Member 'BP_NpcBehavior_Base_C_IsAbility::Ability' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAbility, EventData) == 0x000008, "Member 'BP_NpcBehavior_Base_C_IsAbility::EventData' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAbility, Result) == 0x0000B8, "Member 'BP_NpcBehavior_Base_C_IsAbility::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAbility, CallFunc_GetObjectClass_ReturnValue) == 0x0000C0, "Member 'BP_NpcBehavior_Base_C_IsAbility::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAbility, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_NpcBehavior_Base_C_IsAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAbility, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000C9, "Member 'BP_NpcBehavior_Base_C_IsAbility::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.IsAtBehind
// 0x00A0 (0x00A0 - 0x0000)
struct BP_NpcBehavior_Base_C_IsAtBehind final
{
public:
	class AActor*                                 A;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 B;                                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngleBetweenTwoVectors_ReturnValue;    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_IsAtBehind) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_IsAtBehind");
static_assert(sizeof(BP_NpcBehavior_Base_C_IsAtBehind) == 0x0000A0, "Wrong size on BP_NpcBehavior_Base_C_IsAtBehind");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, A) == 0x000000, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::A' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, B) == 0x000008, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::B' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, Result) == 0x000010, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_GetActorForwardVector_ReturnValue) == 0x000018, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_Normal_ReturnValue) == 0x000078, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_GetAngleBetweenTwoVectors_ReturnValue) == 0x000090, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_GetAngleBetweenTwoVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000094, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsAtBehind, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BP_NpcBehavior_Base_C_IsAtBehind::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.IsHostile
// 0x0038 (0x0038 - 0x0000)
struct BP_NpcBehavior_Base_C_IsHostile final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetOwningCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasThreat_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_IsHostile) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_IsHostile");
static_assert(sizeof(BP_NpcBehavior_Base_C_IsHostile) == 0x000038, "Wrong size on BP_NpcBehavior_Base_C_IsHostile");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, Actor) == 0x000000, "Member 'BP_NpcBehavior_Base_C_IsHostile::Actor' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, Result) == 0x000008, "Member 'BP_NpcBehavior_Base_C_IsHostile::Result' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'BP_NpcBehavior_Base_C_IsHostile::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, CallFunc_GetOwningCharacter_ReturnValue) == 0x000018, "Member 'BP_NpcBehavior_Base_C_IsHostile::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000020, "Member 'BP_NpcBehavior_Base_C_IsHostile::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_NpcBehavior_Base_C_IsHostile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, CallFunc_CompareTeams_TeamIdA) == 0x00002C, "Member 'BP_NpcBehavior_Base_C_IsHostile::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, CallFunc_CompareTeams_TeamIdB) == 0x000030, "Member 'BP_NpcBehavior_Base_C_IsHostile::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, CallFunc_CompareTeams_ReturnValue) == 0x000034, "Member 'BP_NpcBehavior_Base_C_IsHostile::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, CallFunc_HasThreat_ReturnValue) == 0x000035, "Member 'BP_NpcBehavior_Base_C_IsHostile::CallFunc_HasThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_IsHostile, K2Node_SwitchEnum_CmpSuccess) == 0x000036, "Member 'BP_NpcBehavior_Base_C_IsHostile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.PlayerIsCareer
// 0x00C8 (0x00C8 - 0x0000)
struct BP_NpcBehavior_Base_C_PlayerIsCareer final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	ETgfActorCareer                               Career;                                            // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B1(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorCareer                               CallFunc_GetActorCareer_ReturnValue;               // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_PlayerIsCareer) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_PlayerIsCareer");
static_assert(sizeof(BP_NpcBehavior_Base_C_PlayerIsCareer) == 0x0000C8, "Wrong size on BP_NpcBehavior_Base_C_PlayerIsCareer");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, EventData) == 0x000000, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::EventData' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, Career) == 0x0000B0, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::Career' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, ReturnValue) == 0x0000B1, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, K2Node_DynamicCast_AsLyra_Character) == 0x0000B8, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, CallFunc_GetActorCareer_ReturnValue) == 0x0000C2, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::CallFunc_GetActorCareer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_PlayerIsCareer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C3, "Member 'BP_NpcBehavior_Base_C_PlayerIsCareer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.RangeQueryActors
// 0x0098 (0x0098 - 0x0000)
struct BP_NpcBehavior_Base_C_RangeQueryActors final
{
public:
	double                                        Range;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Actors;                                            // 0x0008(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         FilteredActors;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0028(0x0010)(Edit, BlueprintVisible)
	class ALyraCharacter*                         CallFunc_GetOwningCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0070(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_Base_C_RangeQueryActors) == 0x000008, "Wrong alignment on BP_NpcBehavior_Base_C_RangeQueryActors");
static_assert(sizeof(BP_NpcBehavior_Base_C_RangeQueryActors) == 0x000098, "Wrong size on BP_NpcBehavior_Base_C_RangeQueryActors");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, Range) == 0x000000, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::Range' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, Actors) == 0x000008, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::Actors' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, FilteredActors) == 0x000018, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::FilteredActors' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, ObjectTypes) == 0x000028, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::ObjectTypes' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, CallFunc_GetOwningCharacter_ReturnValue) == 0x000038, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, K2Node_MakeArray_Array) == 0x000048, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, K2Node_MakeArray_Array_1) == 0x000070, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, CallFunc_SphereOverlapActors_OutActors) == 0x000080, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, CallFunc_SphereOverlapActors_ReturnValue) == 0x000090, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_Base_C_RangeQueryActors, CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast) == 0x000094, "Member 'BP_NpcBehavior_Base_C_RangeQueryActors::CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast' has a wrong offset!");

// Function BP_NpcBehavior_Base.BP_NpcBehavior_Base_C.SelfHealthInRange
// 0x0050 (0x0050 - 0x0000)
struct BP_NpcBehavior_Base_C_SelfHealthInRange final
{
public:
	double                                        Min;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InclusiveMin;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InclusiveMax;                                      // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetOwningCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
