#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcBehavior_FlowerCoffinRefresh

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_NpcBehavior_FlowerCoffinRefresh.BP_NpcBehavior_FlowerCoffinRefresh_C.DoBehavior
// 0x00B8 (0x00B8 - 0x0000)
struct BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior) == 0x000008, "Wrong alignment on BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior");
static_assert(sizeof(BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior) == 0x0000B8, "Wrong size on BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior, GameplayTag) == 0x000000, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior::GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior, EventData) == 0x000008, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_DoBehavior::EventData' has a wrong offset!");

// Function BP_NpcBehavior_FlowerCoffinRefresh.BP_NpcBehavior_FlowerCoffinRefresh_C.ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh
// 0x00E0 (0x00E0 - 0x0000)
struct BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_GameplayTag;                          // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00B0)(ConstParm)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FlowerCoffin_C*                     K2Node_DynamicCast_AsBP_Flower_Coffin;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh) == 0x000008, "Wrong alignment on BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh");
static_assert(sizeof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh) == 0x0000E0, "Wrong size on BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, EntryPoint) == 0x000000, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, K2Node_Event_GameplayTag) == 0x000004, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::K2Node_Event_GameplayTag' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, K2Node_Event_EventData) == 0x000010, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, CallFunc_GetOwningActor_ReturnValue) == 0x0000C0, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000C8, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, K2Node_DynamicCast_AsBP_Flower_Coffin) == 0x0000D0, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::K2Node_DynamicCast_AsBP_Flower_Coffin' has a wrong offset!");
static_assert(offsetof(BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BP_NpcBehavior_FlowerCoffinRefresh_C_ExecuteUbergraph_BP_NpcBehavior_FlowerCoffinRefresh::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

