#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpectatorManagerComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.AfterPush_7D562B5645061F790DF639A2A7631194
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_AfterPush_7D562B5645061F790DF639A2A7631194 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_AfterPush_7D562B5645061F790DF639A2A7631194) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_AfterPush_7D562B5645061F790DF639A2A7631194");
static_assert(sizeof(BP_SpectatorManagerComponent_C_AfterPush_7D562B5645061F790DF639A2A7631194) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_AfterPush_7D562B5645061F790DF639A2A7631194");
static_assert(offsetof(BP_SpectatorManagerComponent_C_AfterPush_7D562B5645061F790DF639A2A7631194, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_AfterPush_7D562B5645061F790DF639A2A7631194::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.AfterPush_9267A5714F4413F145EE42A5673D1622
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_AfterPush_9267A5714F4413F145EE42A5673D1622 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_AfterPush_9267A5714F4413F145EE42A5673D1622) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_AfterPush_9267A5714F4413F145EE42A5673D1622");
static_assert(sizeof(BP_SpectatorManagerComponent_C_AfterPush_9267A5714F4413F145EE42A5673D1622) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_AfterPush_9267A5714F4413F145EE42A5673D1622");
static_assert(offsetof(BP_SpectatorManagerComponent_C_AfterPush_9267A5714F4413F145EE42A5673D1622, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_AfterPush_9267A5714F4413F145EE42A5673D1622::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.AfterPush_DE479EB9485C436B09A2B88894D74EA8
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_AfterPush_DE479EB9485C436B09A2B88894D74EA8 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_AfterPush_DE479EB9485C436B09A2B88894D74EA8) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_AfterPush_DE479EB9485C436B09A2B88894D74EA8");
static_assert(sizeof(BP_SpectatorManagerComponent_C_AfterPush_DE479EB9485C436B09A2B88894D74EA8) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_AfterPush_DE479EB9485C436B09A2B88894D74EA8");
static_assert(offsetof(BP_SpectatorManagerComponent_C_AfterPush_DE479EB9485C436B09A2B88894D74EA8, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_AfterPush_DE479EB9485C436B09A2B88894D74EA8::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.AfterPush_EEA0577C4A22064137944FA1820E589B
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_AfterPush_EEA0577C4A22064137944FA1820E589B final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_AfterPush_EEA0577C4A22064137944FA1820E589B) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_AfterPush_EEA0577C4A22064137944FA1820E589B");
static_assert(sizeof(BP_SpectatorManagerComponent_C_AfterPush_EEA0577C4A22064137944FA1820E589B) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_AfterPush_EEA0577C4A22064137944FA1820E589B");
static_assert(offsetof(BP_SpectatorManagerComponent_C_AfterPush_EEA0577C4A22064137944FA1820E589B, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_AfterPush_EEA0577C4A22064137944FA1820E589B::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.BeforePush_7D562B5645061F790DF639A2A7631194
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_BeforePush_7D562B5645061F790DF639A2A7631194 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_BeforePush_7D562B5645061F790DF639A2A7631194) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_BeforePush_7D562B5645061F790DF639A2A7631194");
static_assert(sizeof(BP_SpectatorManagerComponent_C_BeforePush_7D562B5645061F790DF639A2A7631194) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_BeforePush_7D562B5645061F790DF639A2A7631194");
static_assert(offsetof(BP_SpectatorManagerComponent_C_BeforePush_7D562B5645061F790DF639A2A7631194, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_BeforePush_7D562B5645061F790DF639A2A7631194::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.BeforePush_9267A5714F4413F145EE42A5673D1622
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_BeforePush_9267A5714F4413F145EE42A5673D1622 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_BeforePush_9267A5714F4413F145EE42A5673D1622) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_BeforePush_9267A5714F4413F145EE42A5673D1622");
static_assert(sizeof(BP_SpectatorManagerComponent_C_BeforePush_9267A5714F4413F145EE42A5673D1622) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_BeforePush_9267A5714F4413F145EE42A5673D1622");
static_assert(offsetof(BP_SpectatorManagerComponent_C_BeforePush_9267A5714F4413F145EE42A5673D1622, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_BeforePush_9267A5714F4413F145EE42A5673D1622::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.BeforePush_DE479EB9485C436B09A2B88894D74EA8
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_BeforePush_DE479EB9485C436B09A2B88894D74EA8 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_BeforePush_DE479EB9485C436B09A2B88894D74EA8) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_BeforePush_DE479EB9485C436B09A2B88894D74EA8");
static_assert(sizeof(BP_SpectatorManagerComponent_C_BeforePush_DE479EB9485C436B09A2B88894D74EA8) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_BeforePush_DE479EB9485C436B09A2B88894D74EA8");
static_assert(offsetof(BP_SpectatorManagerComponent_C_BeforePush_DE479EB9485C436B09A2B88894D74EA8, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_BeforePush_DE479EB9485C436B09A2B88894D74EA8::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.BeforePush_EEA0577C4A22064137944FA1820E589B
// 0x0008 (0x0008 - 0x0000)
struct BP_SpectatorManagerComponent_C_BeforePush_EEA0577C4A22064137944FA1820E589B final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_BeforePush_EEA0577C4A22064137944FA1820E589B) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_BeforePush_EEA0577C4A22064137944FA1820E589B");
static_assert(sizeof(BP_SpectatorManagerComponent_C_BeforePush_EEA0577C4A22064137944FA1820E589B) == 0x000008, "Wrong size on BP_SpectatorManagerComponent_C_BeforePush_EEA0577C4A22064137944FA1820E589B");
static_assert(offsetof(BP_SpectatorManagerComponent_C_BeforePush_EEA0577C4A22064137944FA1820E589B, UserWidget) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_BeforePush_EEA0577C4A22064137944FA1820E589B::UserWidget' has a wrong offset!");

// Function BP_SpectatorManagerComponent.BP_SpectatorManagerComponent_C.ExecuteUbergraph_BP_SpectatorManagerComponent
// 0x04D8 (0x04D8 - 0x0000)
struct BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WaitingToSpectate_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_6;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OwningActor)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_5;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_4;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_1;                            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_TgfGame_SpectateQuitNotice_C*      K2Node_DynamicCast_AsWBP_Tgf_Game_Spectate_Quit_Notice; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_3;                   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_2;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_2;                            // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00C8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_3;                            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_TGF_MithrilRebirth_CountDown_Spectate_C* K2Node_DynamicCast_AsWBP_TGF_Mithril_Rebirth_Count_Down_Spectate; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_4;                            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       Temp_struct_Variable_1;                            // 0x0148(0x0080)()
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller;       // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WaitingToSpectate_ReturnValue_1;          // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnlySpectator_ReturnValue;              // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasInPortalTags_ReturnValue;              // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_1;     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue;  // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_1;          // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OwningActor;                    // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_2;     // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0270(0x0020)()
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x0298(0x0020)()
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character_1;             // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPVPSingleMatchType_ReturnValue;         // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WaitingToSpectate_ReturnValue_2;          // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpectatingTargetType                         K2Node_Event_TargetType;                           // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State_1;            // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPVPMatchType_ReturnValue;               // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_303[0x5];                                      // 0x0303(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WaitingToSpectate_ReturnValue_3;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_3;     // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_7;                   // 0x0328(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_1; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_2;          // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x033C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_4;     // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WaitingToSpectate_ReturnValue_4;          // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerState*                       CallFunc_GetLyraPlayerState_ReturnValue;           // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelfQuit_ReturnValue;                // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_Event_Target;                               // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_5;     // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_2; // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_3;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue_1;              // 0x03A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       Temp_struct_Variable_2;                            // 0x03B0(0x0080)()
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_6;     // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_3; // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue_4;          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_2; // 0x0450(0x0020)()
	class ALyraCharacter*                         CallFunc_GetOwnCharacter_Character;                // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_483[0x5];                                      // 0x0483(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetOwnCharacter_Character_1;              // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_3; // 0x0490(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x04B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x04B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetOwnCharacter_Character_2;              // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent) == 0x000008, "Wrong alignment on BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent");
static_assert(sizeof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent) == 0x0004D8, "Wrong size on BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, EntryPoint) == 0x000000, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_WaitingToSpectate_ReturnValue) == 0x000004, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_WaitingToSpectate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_UserWidget_6) == 0x000008, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_UserWidget_6' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_object_Variable) == 0x000020, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_UserWidget_5) == 0x000038, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_UserWidget_5' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_UserWidget_4) == 0x000050, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_UserWidget_4' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_object_Variable_1) == 0x000068, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsWBP_Tgf_Game_Spectate_Quit_Notice) == 0x000080, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsWBP_Tgf_Game_Spectate_Quit_Notice' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x00008C, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_UserWidget_3) == 0x0000A0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_UserWidget_3' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_UserWidget_2) == 0x0000A8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_UserWidget_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_object_Variable_2) == 0x0000C0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_delegate_Variable) == 0x0000C8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_PostEvent_ReturnValue) == 0x0000D8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_UserWidget_1) == 0x0000E0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_UserWidget_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_UserWidget) == 0x0000F8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_8) == 0x000100, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_object_Variable_3) == 0x000110, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_9) == 0x000118, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsWBP_TGF_Mithril_Rebirth_Count_Down_Spectate) == 0x000128, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsWBP_TGF_Mithril_Rebirth_Count_Down_Spectate' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_object_Variable_4) == 0x000138, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_struct_Variable) == 0x000140, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, Temp_struct_Variable_1) == 0x000148, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_ProxyObject) == 0x0001C8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_ActualChannel) == 0x0001D0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_GetOwner_ReturnValue) == 0x0001D8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsLyra_Player_Controller) == 0x0001E0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsLyra_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_2) == 0x0001E8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_WaitingToSpectate_ReturnValue_1) == 0x0001E9, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_WaitingToSpectate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_K2_GetPawn_ReturnValue) == 0x0001F0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsLocalController_ReturnValue) == 0x0001F8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsValid_ReturnValue) == 0x0001F9, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsLyra_Character) == 0x000200, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_3) == 0x000208, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsOnlySpectator_ReturnValue) == 0x000209, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsOnlySpectator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsDeadOrDying_ReturnValue) == 0x00020A, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_HasInPortalTags_ReturnValue) == 0x00020B, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_HasInPortalTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000210, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsLyra_Player_Controller_1) == 0x000218, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsLyra_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_4) == 0x000220, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CreateDelegate_OutputDelegate_10) == 0x000224, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_PushContentToLayerForPlayer_ReturnValue) == 0x000238, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_PushContentToLayerForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsValid_ReturnValue_1) == 0x000240, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsLocalController_ReturnValue_1) == 0x000241, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsLocalController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_CustomEvent_OwningActor) == 0x000248, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_CustomEvent_OwningActor' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsValid_ReturnValue_2) == 0x000250, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_GetOwner_ReturnValue_2) == 0x000258, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsLyra_Player_Controller_2) == 0x000260, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsLyra_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_5) == 0x000268, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000270, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000290, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x000298, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsLyra_Character_1) == 0x0002B8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsLyra_Character_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_6) == 0x0002C0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_GetGameState_ReturnValue) == 0x0002C8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_GetLyraAbilitySystemComponent_ReturnValue) == 0x0002D0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_GetLyraAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsLyra_Game_State) == 0x0002D8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_7) == 0x0002E0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsPVPSingleMatchType_ReturnValue) == 0x0002E1, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsPVPSingleMatchType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_WaitingToSpectate_ReturnValue_2) == 0x0002E2, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_WaitingToSpectate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_Event_TargetType) == 0x0002E3, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_Event_TargetType' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_GetGameState_ReturnValue_1) == 0x0002E8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0002F0, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_AsLyra_Game_State_1) == 0x0002F8, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_AsLyra_Game_State_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_DynamicCast_bSuccess_8) == 0x000300, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, CallFunc_IsPVPMatchType_ReturnValue) == 0x000301, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::CallFunc_IsPVPMatchType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000302, "Member 'BP_SpectatorManagerComponent_C_ExecuteUbergraph_BP_SpectatorManagerComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
