#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SceneCaptureRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function BP_SceneCaptureRig.BP_SceneCaptureRig_C.Add Actor for Capture
// 0x0010 (0x0010 - 0x0000)
struct BP_SceneCaptureRig_C_Add_Actor_for_Capture final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlaceAtSpot;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnoreAddToList;                                  // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneCaptureRig_C_Add_Actor_for_Capture) == 0x000008, "Wrong alignment on BP_SceneCaptureRig_C_Add_Actor_for_Capture");
static_assert(sizeof(BP_SceneCaptureRig_C_Add_Actor_for_Capture) == 0x000010, "Wrong size on BP_SceneCaptureRig_C_Add_Actor_for_Capture");
static_assert(offsetof(BP_SceneCaptureRig_C_Add_Actor_for_Capture, Actor) == 0x000000, "Member 'BP_SceneCaptureRig_C_Add_Actor_for_Capture::Actor' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_Add_Actor_for_Capture, bPlaceAtSpot) == 0x000008, "Member 'BP_SceneCaptureRig_C_Add_Actor_for_Capture::bPlaceAtSpot' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_Add_Actor_for_Capture, bIgnoreAddToList) == 0x000009, "Member 'BP_SceneCaptureRig_C_Add_Actor_for_Capture::bIgnoreAddToList' has a wrong offset!");

// Function BP_SceneCaptureRig.BP_SceneCaptureRig_C.AddBackdrop
// 0x0008 (0x0008 - 0x0000)
struct BP_SceneCaptureRig_C_AddBackdrop final
{
public:
	class UMaterialInstance*                      Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneCaptureRig_C_AddBackdrop) == 0x000008, "Wrong alignment on BP_SceneCaptureRig_C_AddBackdrop");
static_assert(sizeof(BP_SceneCaptureRig_C_AddBackdrop) == 0x000008, "Wrong size on BP_SceneCaptureRig_C_AddBackdrop");
static_assert(offsetof(BP_SceneCaptureRig_C_AddBackdrop, Material) == 0x000000, "Member 'BP_SceneCaptureRig_C_AddBackdrop::Material' has a wrong offset!");

// Function BP_SceneCaptureRig.BP_SceneCaptureRig_C.AddControlledCharacterToCapture
// 0x0010 (0x0010 - 0x0000)
struct BP_SceneCaptureRig_C_AddControlledCharacterToCapture final
{
public:
	class UTgfInventoryWrapper*                   InventoryContext;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         Character;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneCaptureRig_C_AddControlledCharacterToCapture) == 0x000008, "Wrong alignment on BP_SceneCaptureRig_C_AddControlledCharacterToCapture");
static_assert(sizeof(BP_SceneCaptureRig_C_AddControlledCharacterToCapture) == 0x000010, "Wrong size on BP_SceneCaptureRig_C_AddControlledCharacterToCapture");
static_assert(offsetof(BP_SceneCaptureRig_C_AddControlledCharacterToCapture, InventoryContext) == 0x000000, "Member 'BP_SceneCaptureRig_C_AddControlledCharacterToCapture::InventoryContext' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_AddControlledCharacterToCapture, Character) == 0x000008, "Member 'BP_SceneCaptureRig_C_AddControlledCharacterToCapture::Character' has a wrong offset!");

// Function BP_SceneCaptureRig.BP_SceneCaptureRig_C.Capture Submesh
// 0x0090 (0x0090 - 0x0000)
struct BP_SceneCaptureRig_C_Capture_Submesh final
{
public:
	class ASkeletalMeshActor*                     Mesh_actor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Ret;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneCaptureRig_C_Capture_Submesh) == 0x000010, "Wrong alignment on BP_SceneCaptureRig_C_Capture_Submesh");
static_assert(sizeof(BP_SceneCaptureRig_C_Capture_Submesh) == 0x000090, "Wrong size on BP_SceneCaptureRig_C_Capture_Submesh");
static_assert(offsetof(BP_SceneCaptureRig_C_Capture_Submesh, Mesh_actor) == 0x000000, "Member 'BP_SceneCaptureRig_C_Capture_Submesh::Mesh_actor' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_Capture_Submesh, Mesh) == 0x000008, "Member 'BP_SceneCaptureRig_C_Capture_Submesh::Mesh' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_Capture_Submesh, Ret) == 0x000010, "Member 'BP_SceneCaptureRig_C_Capture_Submesh::Ret' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_Capture_Submesh, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_SceneCaptureRig_C_Capture_Submesh::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_Capture_Submesh, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'BP_SceneCaptureRig_C_Capture_Submesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_Capture_Submesh, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000088, "Member 'BP_SceneCaptureRig_C_Capture_Submesh::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_SceneCaptureRig.BP_SceneCaptureRig_C.DoesAvatarActorNeedRecreate
// 0x0003 (0x0003 - 0x0000)
struct BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate) == 0x000001, "Wrong alignment on BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate");
static_assert(sizeof(BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate) == 0x000003, "Wrong size on BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate");
static_assert(offsetof(BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate, Value) == 0x000000, "Member 'BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate::Value' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate, CallFunc_ObjectIsA_ReturnValue) == 0x000001, "Member 'BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000002, "Member 'BP_SceneCaptureRig_C_DoesAvatarActorNeedRecreate::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function BP_SceneCaptureRig.BP_SceneCaptureRig_C.ExecuteUbergraph_BP_SceneCaptureRig
// 0x07B0 (0x07B0 - 0x0000)
struct BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLyraEquipmentChangeMessage            Temp_struct_Variable;                              // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLyraEquipmentChangeMessage            Temp_struct_Variable_1;                            // 0x0038(0x0008)(NoDestructor, ContainsInstancedReference)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryWrapper*                   K2Node_DynamicCast_AsTgf_Inventory_Wrapper;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryWrapper*                   K2Node_DynamicCast_AsTgf_Inventory_Wrapper_1;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfCharacterAvatarComponent*           CallFunc_GetAvatarComponent_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfCoreDelegateSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryItemWrapper*               Temp_wildcard_Variable;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_wildcard_Variable_1;                          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfWeaponChangeSlot                          Temp_byte_Variable_7;                              // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfWeaponChangeSlot                          Temp_byte_Variable_8;                              // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryItemWrapper*               Temp_wildcard_Variable_2;                          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATgfAvatarActor*                        CallFunc_GetActiveAvatarActor_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_9;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_10;                             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_11;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   K2Node_CustomEvent_InventoryContext_1;             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_CustomEvent_Character;                      // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Avatar_Default_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Avatar_Panther_C*                   CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTgfInventoryWrapper>    CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0230(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   K2Node_CustomEvent_InventoryContext;               // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfWeaponChangeSlot                          CallFunc_GetCurrentWeaponSlot_ReturnValue;         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_12;                             // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_13;                             // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_287[0x1];                                      // 0x0287(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0288(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIdleAnimation_bIsRightIdle;            // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAnimSequenceBase*                CallFunc_GetIdleAnimation_ReturnValue;             // 0x02B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_14;                             // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_15;                             // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 K2Node_Select_Default;                             // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentWrapper*                   CallFunc_GetEquipmentBySlot_ReturnValue;           // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_UntilItemReadyForPaint*    CallFunc_UntilEquipmentReadyForPaint_ReturnValue;  // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfWeaponEquipType                           CallFunc_GetWeaponEquipType_ReturnValue;           // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_16;                             // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0348(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SpawnEquipmentActorsWithAttachTarget_OutSpawnedActors; // 0x0438(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_SpawnEquipmentActorsWithAttachTarget_OutSpawnedActors_1; // 0x0448(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllAttachmentActors_OutSpawnedActors;  // 0x0488(0x0010)(ReferenceParm)
	class UABP_SceneCapture_Character_C*          K2Node_DynamicCast_AsABP_Scene_Capture_Character;  // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x04B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B5[0x3];                                      // 0x04B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_4;                         // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2; // 0x04CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3; // 0x04CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesAvatarActorNeedRecreate_value;        // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPlaceAtSpot;                   // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIgnoreAddToList;               // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x04E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_5;                         // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0510(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0570(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_6;                         // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x066D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66E[0x2];                                      // 0x066E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_7;                         // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x069C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69D[0x3];                                      // 0x069D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_CustomEvent_material;                       // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x06B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 Temp_byte_Variable_17;                             // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x06F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 K2Node_Select_Default_1;                           // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0758(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfEquipmentWrapper*                   CallFunc_GetEquipmentBySlot_ReturnValue_1;         // 0x0760(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneCapture_Backdrop_C*            CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_UntilItemReadyForPaint*    CallFunc_UntilEquipmentReadyForPaint_ReturnValue_1; // 0x0770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77A[0x6];                                      // 0x077A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_BackDropTex;                    // 0x0780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_8;                         // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_8;                // 0x07A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x07A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A7[0x1];                                      // 0x07A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_FOVAngle_ImplicitCast;          // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig) == 0x000010, "Wrong alignment on BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig");
static_assert(sizeof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig) == 0x0007B0, "Wrong size on BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, EntryPoint) == 0x000000, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable) == 0x000004, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_1) == 0x000005, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_2) == 0x000006, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_3) == 0x000007, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_4) == 0x000008, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_5) == 0x000009, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_6) == 0x00000A, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_struct_Variable) == 0x000010, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_CustomEvent_ProxyObject) == 0x000018, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_CustomEvent_ActualChannel) == 0x000020, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_struct_Variable_1) == 0x000038, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_struct_Variable_2) == 0x000040, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_object_Variable) == 0x000048, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_GetPayload_ReturnValue) == 0x000058, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_DynamicCast_AsCharacter) == 0x000060, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000070, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000078, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000080, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_DynamicCast_AsTgf_Inventory_Wrapper) == 0x000088, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_DynamicCast_AsTgf_Inventory_Wrapper' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000092, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000098, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_DynamicCast_AsTgf_Inventory_Wrapper_1) == 0x0000A0, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_DynamicCast_AsTgf_Inventory_Wrapper_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_GetAvatarComponent_ReturnValue) == 0x0000B0, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_GetAvatarComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000B8, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000D0, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_wildcard_Variable) == 0x0000E0, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E8, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_wildcard_Variable_1) == 0x0000F9, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_7) == 0x0000FA, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_byte_Variable_8) == 0x0000FB, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_wildcard_Variable_2) == 0x000100, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_wildcard_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_GetActiveAvatarActor_ReturnValue) == 0x000108, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_GetActiveAvatarActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_IsValid_ReturnValue_3) == 0x000110, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_IsValid_ReturnValue_4) == 0x000111, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_Add_IntInt_ReturnValue) == 0x000118, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_int_Array_Index_Variable) == 0x00011C, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_int_Loop_Counter_Variable_1) == 0x000120, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, CallFunc_Add_IntInt_ReturnValue_1) == 0x000124, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, Temp_int_Array_Index_Variable_1) == 0x000128, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig, K2Node_CreateDelegate_OutputDelegate_2) == 0x00012C, "Member 'BP_SceneCaptureRig_C_ExecuteUbergraph_BP_SceneCaptureRig::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
