#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TgfPawnCosmetics

#include "Basic.hpp"

#include "Struct_AvatarCosmeticPart_structs.hpp"
#include "LyraGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_TgfPawnCosmetics.BP_TgfPawnCosmetics_C.ExecuteUbergraph_BP_TgfPawnCosmetics
// 0x02A8 (0x02A8 - 0x0000)
struct BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetCharacterPartActors_ReturnValue;       // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ATgfAvatarActor*                        K2Node_DynamicCast_AsTgf_Avatar_Actor;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLyraCharacterPart                     CallFunc_PickBestAvatarPart_Part;                  // 0x0038(0x0040)()
	struct FLyraCharacterPartHandle               CallFunc_AddCharacterPart_ReturnValue;             // 0x0078(0x0004)(NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetCharacterPartActors_ReturnValue_1;     // 0x0080(0x0010)(ReferenceParm)
	struct FLyraCharacterPart                     CallFunc_PickBestAvatarPart_Part_1;                // 0x0090(0x0040)()
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLyraCharacterPartHandle               CallFunc_AddCharacterPart_ReturnValue_1;           // 0x00D8(0x0004)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetCharacterPartActors_ReturnValue_2;     // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATgfAvatarActor*                        K2Node_DynamicCast_AsTgf_Avatar_Actor_1;           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetCharacterPartActors_ReturnValue_3;     // 0x0128(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetCharacterPartActors_ReturnValue_4;     // 0x0138(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATgfAvatarActor*                        K2Node_DynamicCast_AsTgf_Avatar_Actor_2;           // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATgfAvatarActor*                        K2Node_DynamicCast_AsTgf_Avatar_Actor_3;           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_5;                         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATgfAvatarActor*                        K2Node_DynamicCast_AsTgf_Avatar_Actor_4;           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default;          // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1;        // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SceneCaptureRig_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default_2;        // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesAvatarActorNeedRecreate_value;        // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            K2Node_Event_InASC;                                // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3;  // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_3;     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character_1;             // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default_3;        // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics) == 0x000008, "Wrong alignment on BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics");
static_assert(sizeof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics) == 0x0002A8, "Wrong size on BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, EntryPoint) == 0x000000, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetCharacterPartActors_ReturnValue) == 0x000008, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetCharacterPartActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Greater_IntInt_ReturnValue) == 0x000025, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsTgf_Avatar_Actor) == 0x000028, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsTgf_Avatar_Actor' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_PickBestAvatarPart_Part) == 0x000038, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_PickBestAvatarPart_Part' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_AddCharacterPart_ReturnValue) == 0x000078, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_AddCharacterPart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetCharacterPartActors_ReturnValue_1) == 0x000080, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetCharacterPartActors_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_PickBestAvatarPart_Part_1) == 0x000090, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_PickBestAvatarPart_Part_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_AddCharacterPart_ReturnValue_1) == 0x0000D8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_AddCharacterPart_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_IsValid_ReturnValue_1) == 0x0000DC, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Length_ReturnValue_1) == 0x0000E0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetCharacterPartActors_ReturnValue_2) == 0x0000E8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetCharacterPartActors_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000F8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Get_Item_2) == 0x000100, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsTgf_Avatar_Actor_1) == 0x000110, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsTgf_Avatar_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Length_ReturnValue_2) == 0x00011C, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000120, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetCharacterPartActors_ReturnValue_3) == 0x000128, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetCharacterPartActors_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetCharacterPartActors_ReturnValue_4) == 0x000138, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetCharacterPartActors_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Get_Item_3) == 0x000148, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Get_Item_4) == 0x000150, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_IsValid_ReturnValue_3) == 0x000158, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_IsValid_ReturnValue_4) == 0x000159, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsTgf_Avatar_Actor_2) == 0x000160, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsTgf_Avatar_Actor_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsTgf_Avatar_Actor_3) == 0x000170, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsTgf_Avatar_Actor_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_3) == 0x000178, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Get_Item_5) == 0x000180, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_IsValid_ReturnValue_5) == 0x000188, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsTgf_Avatar_Actor_4) == 0x000190, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsTgf_Avatar_Actor_4' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_4) == 0x000198, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Length_ReturnValue_3) == 0x00019C, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Length_ReturnValue_4) == 0x0001A0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0001A4, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Greater_IntInt_ReturnValue_4) == 0x0001A5, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Array_Length_ReturnValue_5) == 0x0001A8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_Greater_IntInt_ReturnValue_5) == 0x0001AC, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetOwner_ReturnValue) == 0x0001B0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetOwner_ReturnValue_1) == 0x0001B8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsBP_Tgf_Hero_Default) == 0x0001C0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsBP_Tgf_Hero_Default' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_5) == 0x0001C8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1) == 0x0001D0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_6) == 0x0001D8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0001E0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0001F0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x0001F8, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000208, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetActorOfClass_ReturnValue) == 0x000210, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetOwner_ReturnValue_2) == 0x000218, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_IsValid_ReturnValue_6) == 0x000220, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsLyra_Character) == 0x000228, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_7) == 0x000230, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsBP_Tgf_Hero_Default_2) == 0x000238, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsBP_Tgf_Hero_Default_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_8) == 0x000240, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000248, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000258, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_DoesAvatarActorNeedRecreate_value) == 0x000259, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_DoesAvatarActorNeedRecreate_value' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_Event_InASC) == 0x000260, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_Event_InASC' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_self_CastInput_3) == 0x000268, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_self_CastInput_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_HasMatchingGameplayTag_ReturnValue_3) == 0x000278, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_HasMatchingGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, CallFunc_GetOwner_ReturnValue_3) == 0x000280, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsLyra_Character_1) == 0x000288, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsLyra_Character_1' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_9) == 0x000290, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_AsBP_Tgf_Hero_Default_3) == 0x000298, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_AsBP_Tgf_Hero_Default_3' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics, K2Node_DynamicCast_bSuccess_10) == 0x0002A0, "Member 'BP_TgfPawnCosmetics_C_ExecuteUbergraph_BP_TgfPawnCosmetics::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");

// Function BP_TgfPawnCosmetics.BP_TgfPawnCosmetics_C.InitializeWithAbilitySystem
// 0x0008 (0x0008 - 0x0000)
struct BP_TgfPawnCosmetics_C_InitializeWithAbilitySystem final
{
public:
	class ULyraAbilitySystemComponent*            InASC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfPawnCosmetics_C_InitializeWithAbilitySystem) == 0x000008, "Wrong alignment on BP_TgfPawnCosmetics_C_InitializeWithAbilitySystem");
static_assert(sizeof(BP_TgfPawnCosmetics_C_InitializeWithAbilitySystem) == 0x000008, "Wrong size on BP_TgfPawnCosmetics_C_InitializeWithAbilitySystem");
static_assert(offsetof(BP_TgfPawnCosmetics_C_InitializeWithAbilitySystem, InASC) == 0x000000, "Member 'BP_TgfPawnCosmetics_C_InitializeWithAbilitySystem::InASC' has a wrong offset!");

// Function BP_TgfPawnCosmetics.BP_TgfPawnCosmetics_C.PickBestAvatarPart
// 0x00D8 (0x00D8 - 0x0000)
struct BP_TgfPawnCosmetics_C_PickBestAvatarPart final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLyraCharacterPart                     Part;                                              // 0x0020(0x0040)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AvatarCosmeticPart             CallFunc_Array_Get_Item;                           // 0x0070(0x0060)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllTags_ReturnValue;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfPawnCosmetics_C_PickBestAvatarPart) == 0x000008, "Wrong alignment on BP_TgfPawnCosmetics_C_PickBestAvatarPart");
static_assert(sizeof(BP_TgfPawnCosmetics_C_PickBestAvatarPart) == 0x0000D8, "Wrong size on BP_TgfPawnCosmetics_C_PickBestAvatarPart");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, Tags) == 0x000000, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::Tags' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, Part) == 0x000020, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::Part' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, Temp_int_Array_Index_Variable) == 0x000060, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_PickBestAvatarPart, CallFunc_HasAllTags_ReturnValue) == 0x0000D1, "Member 'BP_TgfPawnCosmetics_C_PickBestAvatarPart::CallFunc_HasAllTags_ReturnValue' has a wrong offset!");

// Function BP_TgfPawnCosmetics.BP_TgfPawnCosmetics_C.ResetAnimInstance
// 0x0018 (0x0018 - 0x0000)
struct BP_TgfPawnCosmetics_C_ResetAnimInstance final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Fighter_HeroSample_C*               K2Node_DynamicCast_AsBP_Fighter_Hero_Sample;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfPawnCosmetics_C_ResetAnimInstance) == 0x000008, "Wrong alignment on BP_TgfPawnCosmetics_C_ResetAnimInstance");
static_assert(sizeof(BP_TgfPawnCosmetics_C_ResetAnimInstance) == 0x000018, "Wrong size on BP_TgfPawnCosmetics_C_ResetAnimInstance");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ResetAnimInstance, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_TgfPawnCosmetics_C_ResetAnimInstance::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ResetAnimInstance, K2Node_DynamicCast_AsBP_Fighter_Hero_Sample) == 0x000008, "Member 'BP_TgfPawnCosmetics_C_ResetAnimInstance::K2Node_DynamicCast_AsBP_Fighter_Hero_Sample' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_ResetAnimInstance, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_TgfPawnCosmetics_C_ResetAnimInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_TgfPawnCosmetics.BP_TgfPawnCosmetics_C.Set Anim Mesh
// 0x0050 (0x0050 - 0x0000)
struct BP_TgfPawnCosmetics_C_Set_Anim_Mesh final
{
public:
	bool                                          Panther;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetCharacterPartActors_ReturnValue;       // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATgfAvatarActor*                        K2Node_DynamicCast_AsTgf_Avatar_Actor;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Fighter_HeroSample_C*               K2Node_DynamicCast_AsBP_Fighter_Hero_Sample;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfPawnCosmetics_C_Set_Anim_Mesh) == 0x000008, "Wrong alignment on BP_TgfPawnCosmetics_C_Set_Anim_Mesh");
static_assert(sizeof(BP_TgfPawnCosmetics_C_Set_Anim_Mesh) == 0x000050, "Wrong size on BP_TgfPawnCosmetics_C_Set_Anim_Mesh");
static_assert(offsetof(BP_TgfPawnCosmetics_C_Set_Anim_Mesh, Panther) == 0x000000, "Member 'BP_TgfPawnCosmetics_C_Set_Anim_Mesh::Panther' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_Set_Anim_Mesh, CallFunc_GetCharacterPartActors_ReturnValue) == 0x000008, "Member 'BP_TgfPawnCosmetics_C_Set_Anim_Mesh::CallFunc_GetCharacterPartActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfPawnCosmetics_C_Set_Anim_Mesh, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_TgfPawnCosmetics_C_Set_Anim_Mesh::CallFunc_Array_Get_Item' has a wrong offset!");
