#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TGF_CharacterInvSee

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.AttachToCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterInvSee_C_AttachToCharacter final
{
public:
	class ABP_Tgf_Character_Default_C*            Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_AttachToCharacter) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_AttachToCharacter");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_AttachToCharacter) == 0x000008, "Wrong size on BP_TGF_CharacterInvSee_C_AttachToCharacter");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_AttachToCharacter, Param_Character) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_AttachToCharacter::Param_Character' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.BindParentDestroy
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterInvSee_C_BindParentDestroy final
{
public:
	class AActor*                                 Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_BindParentDestroy) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_BindParentDestroy");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_BindParentDestroy) == 0x000008, "Wrong size on BP_TGF_CharacterInvSee_C_BindParentDestroy");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_BindParentDestroy, Param_Character) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_BindParentDestroy::Param_Character' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.CanPlayerInteract
// 0x0028 (0x0028 - 0x0000)
struct BP_TGF_CharacterInvSee_C_CanPlayerInteract final
{
public:
	class ALyraCharacter*                         Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanInteract;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_CanPlayerInteract) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_CanPlayerInteract");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_CanPlayerInteract) == 0x000028, "Wrong size on BP_TGF_CharacterInvSee_C_CanPlayerInteract");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_CanPlayerInteract, Player) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_CanPlayerInteract::Player' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_CanPlayerInteract, bCanInteract) == 0x000008, "Member 'BP_TGF_CharacterInvSee_C_CanPlayerInteract::bCanInteract' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_CanPlayerInteract, CallFunc_HasAuthority_ReturnValue) == 0x000009, "Member 'BP_TGF_CharacterInvSee_C_CanPlayerInteract::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_CanPlayerInteract, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000010, "Member 'BP_TGF_CharacterInvSee_C_CanPlayerInteract::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_CanPlayerInteract, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000020, "Member 'BP_TGF_CharacterInvSee_C_CanPlayerInteract::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.DestroySelfWhenDetached
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterInvSee_C_DestroySelfWhenDetached final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_DestroySelfWhenDetached) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_DestroySelfWhenDetached");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_DestroySelfWhenDetached) == 0x000008, "Wrong size on BP_TGF_CharacterInvSee_C_DestroySelfWhenDetached");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_DestroySelfWhenDetached, DestroyedActor) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_DestroySelfWhenDetached::DestroyedActor' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.ExecuteUbergraph_BP_TGF_CharacterInvSee
// 0x0090 (0x0090 - 0x0000)
struct BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_InteractingPawn;                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Character;                      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee) == 0x000090, "Wrong size on BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, EntryPoint) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_GetObjectName_ReturnValue) == 0x000018, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, K2Node_Event_EndPlayReason) == 0x000028, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_GetObjectName_ReturnValue_1) == 0x000040, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, K2Node_Event_InteractingPawn) == 0x000050, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, K2Node_CustomEvent_Character) == 0x000070, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, CallFunc_GetComponentByClass_ReturnValue) == 0x000080, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee, K2Node_CustomEvent_DestroyedActor) == 0x000088, "Member 'BP_TGF_CharacterInvSee_C_ExecuteUbergraph_BP_TGF_CharacterInvSee::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.GetEnabled
// 0x0004 (0x0004 - 0x0000)
struct BP_TGF_CharacterInvSee_C_GetEnabled final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnabled_Result;                        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_GetEnabled) == 0x000001, "Wrong alignment on BP_TGF_CharacterInvSee_C_GetEnabled");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_GetEnabled) == 0x000004, "Wrong size on BP_TGF_CharacterInvSee_C_GetEnabled");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetEnabled, Result) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_GetEnabled::Result' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetEnabled, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000001, "Member 'BP_TGF_CharacterInvSee_C_GetEnabled::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetEnabled, CallFunc_GetEnabled_Result) == 0x000002, "Member 'BP_TGF_CharacterInvSee_C_GetEnabled::CallFunc_GetEnabled_Result' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_TGF_CharacterInvSee_C_GetEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.GetInteractionPromptText
// 0x0050 (0x0050 - 0x0000)
struct BP_TGF_CharacterInvSee_C_GetInteractionPromptText final
{
public:
	class APlayerController*                      Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Key;                                               // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_1;                                   // 0x0020(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_2;                                   // 0x0038(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_GetInteractionPromptText) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_GetInteractionPromptText");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_GetInteractionPromptText) == 0x000050, "Wrong size on BP_TGF_CharacterInvSee_C_GetInteractionPromptText");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetInteractionPromptText, Param_Instigator) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_GetInteractionPromptText::Param_Instigator' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetInteractionPromptText, Key) == 0x000008, "Member 'BP_TGF_CharacterInvSee_C_GetInteractionPromptText::Key' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetInteractionPromptText, Out_Text_Line_1) == 0x000020, "Member 'BP_TGF_CharacterInvSee_C_GetInteractionPromptText::Out_Text_Line_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetInteractionPromptText, Out_Text_Line_2) == 0x000038, "Member 'BP_TGF_CharacterInvSee_C_GetInteractionPromptText::Out_Text_Line_2' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.GetTraceActor
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterInvSee_C_GetTraceActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_GetTraceActor) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_GetTraceActor");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_GetTraceActor) == 0x000008, "Wrong size on BP_TGF_CharacterInvSee_C_GetTraceActor");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_GetTraceActor, Actor) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_GetTraceActor::Actor' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.PerformInteraction on Server
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterInvSee_C_PerformInteraction_on_Server final
{
public:
	class APawn*                                  InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_PerformInteraction_on_Server) == 0x000008, "Wrong alignment on BP_TGF_CharacterInvSee_C_PerformInteraction_on_Server");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_PerformInteraction_on_Server) == 0x000008, "Wrong size on BP_TGF_CharacterInvSee_C_PerformInteraction_on_Server");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_PerformInteraction_on_Server, InteractingPawn) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_PerformInteraction_on_Server::InteractingPawn' has a wrong offset!");

// Function BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TGF_CharacterInvSee_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterInvSee_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TGF_CharacterInvSee_C_ReceiveEndPlay");
static_assert(sizeof(BP_TGF_CharacterInvSee_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TGF_CharacterInvSee_C_ReceiveEndPlay");
static_assert(offsetof(BP_TGF_CharacterInvSee_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TGF_CharacterInvSee_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

