#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tgf_Monster

#include "Basic.hpp"

#include "TGF_FRetreatEntry_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TGF_FDormantEntry_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AGRPRO_structs.hpp"


namespace SDK::Params
{

// Function BP_Tgf_Monster.BP_Tgf_Monster_C.AddThreatWithForceTargetable
// 0x0030 (0x0030 - 0x0000)
struct BP_Tgf_Monster_C_AddThreatWithForceTargetable final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Threat;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddThreat_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIC_Monster_Default_C*                 K2Node_DynamicCast_AsAIC_Monster_Default;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AddThreat_Threat_ImplicitCast;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tgf_Monster_C_AddThreatWithForceTargetable) == 0x000008, "Wrong alignment on BP_Tgf_Monster_C_AddThreatWithForceTargetable");
static_assert(sizeof(BP_Tgf_Monster_C_AddThreatWithForceTargetable) == 0x000030, "Wrong size on BP_Tgf_Monster_C_AddThreatWithForceTargetable");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, Actor) == 0x000000, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::Actor' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, Threat) == 0x000008, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::Threat' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, CallFunc_AddThreat_ReturnValue) == 0x000014, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::CallFunc_AddThreat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, K2Node_DynamicCast_AsAIC_Monster_Default) == 0x000020, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::K2Node_DynamicCast_AsAIC_Monster_Default' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddThreatWithForceTargetable, CallFunc_AddThreat_Threat_ImplicitCast) == 0x00002C, "Member 'BP_Tgf_Monster_C_AddThreatWithForceTargetable::CallFunc_AddThreat_Threat_ImplicitCast' has a wrong offset!");

// Function BP_Tgf_Monster.BP_Tgf_Monster_C.AddTraceMesh
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Tgf_Monster_C_AddTraceMesh final
{
public:
	class FName                                   StartSocketTraceName;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndSocketTraceName;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAGR_CombatColliderType                       CollisionHandling;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TraceMeshInsId;                                    // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResultTraceMeshInsId;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FHitResult& Hit, class UPrimitiveComponent* Mesh)> K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddTraceMesh_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tgf_Monster_C_AddTraceMesh) == 0x000008, "Wrong alignment on BP_Tgf_Monster_C_AddTraceMesh");
static_assert(sizeof(BP_Tgf_Monster_C_AddTraceMesh) == 0x0000D0, "Wrong size on BP_Tgf_Monster_C_AddTraceMesh");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, StartSocketTraceName) == 0x000000, "Member 'BP_Tgf_Monster_C_AddTraceMesh::StartSocketTraceName' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, EndSocketTraceName) == 0x000008, "Member 'BP_Tgf_Monster_C_AddTraceMesh::EndSocketTraceName' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, CollisionHandling) == 0x000010, "Member 'BP_Tgf_Monster_C_AddTraceMesh::CollisionHandling' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, TraceMeshInsId) == 0x000014, "Member 'BP_Tgf_Monster_C_AddTraceMesh::TraceMeshInsId' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, ResultTraceMeshInsId) == 0x000018, "Member 'BP_Tgf_Monster_C_AddTraceMesh::ResultTraceMeshInsId' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, Temp_int_Variable) == 0x00001C, "Member 'BP_Tgf_Monster_C_AddTraceMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'BP_Tgf_Monster_C_AddTraceMesh::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_Tgf_Monster_C_AddTraceMesh::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'BP_Tgf_Monster_C_AddTraceMesh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_Tgf_Monster_C_AddTraceMesh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_Tgf_Monster_C_AddTraceMesh::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'BP_Tgf_Monster_C_AddTraceMesh::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'BP_Tgf_Monster_C_AddTraceMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'BP_Tgf_Monster_C_AddTraceMesh::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AddTraceMesh, CallFunc_AddTraceMesh_ReturnValue) == 0x0000CC, "Member 'BP_Tgf_Monster_C_AddTraceMesh::CallFunc_AddTraceMesh_ReturnValue' has a wrong offset!");

// Function BP_Tgf_Monster.BP_Tgf_Monster_C.ApplyDormantGravity
// 0x0018 (0x0018 - 0x0000)
struct BP_Tgf_Monster_C_ApplyDormantGravity final
{
public:
	bool                                          Apply;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDormantable_Result;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDormantWithGravity_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetGravityScale_Gravity_ImplicitCast;     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tgf_Monster_C_ApplyDormantGravity) == 0x000008, "Wrong alignment on BP_Tgf_Monster_C_ApplyDormantGravity");
static_assert(sizeof(BP_Tgf_Monster_C_ApplyDormantGravity) == 0x000018, "Wrong size on BP_Tgf_Monster_C_ApplyDormantGravity");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyDormantGravity, Apply) == 0x000000, "Member 'BP_Tgf_Monster_C_ApplyDormantGravity::Apply' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyDormantGravity, CallFunc_IsDormantable_Result) == 0x000001, "Member 'BP_Tgf_Monster_C_ApplyDormantGravity::CallFunc_IsDormantable_Result' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyDormantGravity, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'BP_Tgf_Monster_C_ApplyDormantGravity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyDormantGravity, CallFunc_IsDormantWithGravity_ReturnValue) == 0x000010, "Member 'BP_Tgf_Monster_C_ApplyDormantGravity::CallFunc_IsDormantWithGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyDormantGravity, CallFunc_SetGravityScale_Gravity_ImplicitCast) == 0x000014, "Member 'BP_Tgf_Monster_C_ApplyDormantGravity::CallFunc_SetGravityScale_Gravity_ImplicitCast' has a wrong offset!");

// Function BP_Tgf_Monster.BP_Tgf_Monster_C.ApplySpeedMod
// 0x0058 (0x0058 - 0x0000)
struct BP_Tgf_Monster_C_ApplySpeedMod final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Apply;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnySpeedMod_Result;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfSpeedAttributeSet*                  K2Node_DynamicCast_AsTgf_Speed_Attribute_Set;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplySpeedBaseMod_Mod_ImplicitCast;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tgf_Monster_C_ApplySpeedMod) == 0x000008, "Wrong alignment on BP_Tgf_Monster_C_ApplySpeedMod");
static_assert(sizeof(BP_Tgf_Monster_C_ApplySpeedMod) == 0x000058, "Wrong size on BP_Tgf_Monster_C_ApplySpeedMod");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, Tag) == 0x000000, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::Tag' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, Apply) == 0x000008, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::Apply' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_HasAnySpeedMod_Result) == 0x000009, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_HasAnySpeedMod_Result' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_RemoveGameplayTag_ReturnValue) == 0x000019, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_GetAttributeSet_ReturnValue) == 0x000020, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, K2Node_DynamicCast_AsTgf_Speed_Attribute_Set) == 0x000028, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::K2Node_DynamicCast_AsTgf_Speed_Attribute_Set' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_HasTag_ReturnValue) == 0x000031, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_Map_Find_Value) == 0x000038, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplySpeedMod, CallFunc_ApplySpeedBaseMod_Mod_ImplicitCast) == 0x000054, "Member 'BP_Tgf_Monster_C_ApplySpeedMod::CallFunc_ApplySpeedBaseMod_Mod_ImplicitCast' has a wrong offset!");

// Function BP_Tgf_Monster.BP_Tgf_Monster_C.ApplyTurnSpeedMod
// 0x0050 (0x0050 - 0x0000)
struct BP_Tgf_Monster_C_ApplyTurnSpeedMod final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Apply;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTurnSpeedMod_Result;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfAIAttributeSet*                     K2Node_DynamicCast_AsTgf_AIAttribute_Set;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyAngleSpeedBaseMod_Mod_ImplicitCast;  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tgf_Monster_C_ApplyTurnSpeedMod) == 0x000008, "Wrong alignment on BP_Tgf_Monster_C_ApplyTurnSpeedMod");
static_assert(sizeof(BP_Tgf_Monster_C_ApplyTurnSpeedMod) == 0x000050, "Wrong size on BP_Tgf_Monster_C_ApplyTurnSpeedMod");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, Tag) == 0x000000, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::Tag' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, Apply) == 0x000008, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::Apply' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_HasAnyTurnSpeedMod_Result) == 0x000009, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_HasAnyTurnSpeedMod_Result' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_Map_Find_Value) == 0x000018, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_RemoveGameplayTag_ReturnValue) == 0x000031, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_HasTag_ReturnValue) == 0x000032, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_IsValid_ReturnValue) == 0x000033, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_GetAttributeSet_ReturnValue) == 0x000038, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, K2Node_DynamicCast_AsTgf_AIAttribute_Set) == 0x000040, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::K2Node_DynamicCast_AsTgf_AIAttribute_Set' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_ApplyTurnSpeedMod, CallFunc_ApplyAngleSpeedBaseMod_Mod_ImplicitCast) == 0x00004C, "Member 'BP_Tgf_Monster_C_ApplyTurnSpeedMod::CallFunc_ApplyAngleSpeedBaseMod_Mod_ImplicitCast' has a wrong offset!");

// Function BP_Tgf_Monster.BP_Tgf_Monster_C.AttackHitEventHandle
// 0x0940 (0x0940 - 0x0000)
struct BP_Tgf_Monster_C_AttackHitEventHandle final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    Param_Mesh;                                        // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x00F8(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0178(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02B0(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x02C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02F0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0340(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0350(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContextSimple_ReturnValue;      // 0x0380(0x0018)()
	class UTgfInteractorBattleComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_3;          // 0x03A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x03C0(0x0050)(HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0420(0x0028)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_4;          // 0x0448(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_5;          // 0x0460(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0478(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x04C8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0518(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0528(0x0018)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_6;          // 0x0540(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0568(0x0050)(HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x3];                                      // 0x05C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CB[0x1];                                      // 0x05CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x05D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x05F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0638(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0648(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0670(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0688(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_7;          // 0x06A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x06C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0710(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0720(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0738(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0748(0x00B0)()
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_8;          // 0x07F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0810(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0860(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_9;          // 0x0870(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0888(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x08A0(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x08F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0900(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x0910(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0930(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tgf_Monster_C_AttackHitEventHandle) == 0x000008, "Wrong alignment on BP_Tgf_Monster_C_AttackHitEventHandle");
static_assert(sizeof(BP_Tgf_Monster_C_AttackHitEventHandle) == 0x000940, "Wrong size on BP_Tgf_Monster_C_AttackHitEventHandle");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, Hit) == 0x000000, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::Hit' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, Param_Mesh) == 0x0000E8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::Param_Mesh' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_GetOwner_ReturnValue) == 0x0000F0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue) == 0x0000F8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x000110, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData) == 0x000128, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000178, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeArray_Array) == 0x0001C8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001D9, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Time) == 0x0001DC, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Distance) == 0x0001E0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Location) == 0x0001E8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_ImpactPoint) == 0x000200, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Normal) == 0x000218, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_ImpactNormal) == 0x000230, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_PhysMat) == 0x000248, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitActor) == 0x000250, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitComponent) == 0x000258, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitBoneName) == 0x000260, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_BoneName) == 0x000268, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitItem) == 0x000270, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_ElementIndex) == 0x000274, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_FaceIndex) == 0x000278, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_TraceStart) == 0x000280, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_TraceEnd) == 0x000298, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Format_ReturnValue) == 0x0002B0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x0002C8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue) == 0x0002E0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002F0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeArray_Array_1) == 0x000340, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_1) == 0x000350, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000368, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_IsValid_ReturnValue) == 0x000378, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_MakeEffectContextSimple_ReturnValue) == 0x000380, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_MakeEffectContextSimple_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_GetComponentByClass_ReturnValue) == 0x000398, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_IsValid_ReturnValue_1) == 0x0003A0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_3) == 0x0003A8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_3) == 0x0003C0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000410, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_IsValid_ReturnValue_2) == 0x000418, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000420, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_4) == 0x000448, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_5) == 0x000460, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_4) == 0x000478, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_5) == 0x0004C8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeArray_Array_2) == 0x000518, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Format_ReturnValue_2) == 0x000528, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_ObjectToText_ReturnValue_6) == 0x000540, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_ObjectToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000558, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_MakeStruct_FormatArgumentData_6) == 0x000568, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_DynamicCast_AsLyra_Character) == 0x0005B8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, K2Node_DynamicCast_bSuccess) == 0x0005C0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_Array_AddUnique_ReturnValue) == 0x0005C4, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_IsDeadOrDying_ReturnValue) == 0x0005C8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0005C9, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0005CA, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Time_1) == 0x0005CC, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Distance_1) == 0x0005D0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Location_1) == 0x0005D8, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0005F0, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_Normal_1) == 0x000608, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000620, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_PhysMat_1) == 0x000638, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitActor_1) == 0x000640, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitComponent_1) == 0x000648, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitBoneName_1) == 0x000650, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_BoneName_1) == 0x000658, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_BoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_HitItem_1) == 0x000660, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_ElementIndex_1) == 0x000664, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Tgf_Monster_C_AttackHitEventHandle, CallFunc_BreakHitResult_FaceIndex_1) == 0x000668, "Member 'BP_Tgf_Monster_C_AttackHitEventHandle::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
