#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrapBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TrapBase.BP_TrapBase_C.BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_TrapBase_C_BndEvt__BP_FloorSpikes_DamageTrgger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_TrapBase.BP_TrapBase_C.BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_TrapBase.BP_TrapBase_C.BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_TrapBase_C_BndEvt__BP_TrapBase_BoxTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_TrapBase.BP_TrapBase_C.ExecuteUbergraph_BP_TrapBase
// 0x04A8 (0x04A8 - 0x0000)
struct BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0050(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0158(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x01D8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfDefendAttributeSet*                 K2Node_DynamicCast_AsTgf_Defend_Attribute_Set;     // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefendValueWithAnim_ReturnValue;       // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyHitValueAndInterrupt_ReturnValue;    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_IntParam;                       // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0260(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_1;                  // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_2;                  // 0x0365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0366(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0367(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_3;                  // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_4;                  // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0390(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x047C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492[0x6];                                      // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DefendHitValue_ImplicitCast;    // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyHitValueAndInterrupt_HitValue_ImplicitCast; // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase) == 0x000008, "Wrong alignment on BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase");
static_assert(sizeof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase) == 0x0004A8, "Wrong size on BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, EntryPoint) == 0x000000, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, Temp_object_Variable) == 0x000008, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, Temp_int_Variable) == 0x000018, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, Temp_int_Array_Index_Variable) == 0x000024, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, Temp_bool_Has_Been_Initd_Variable) == 0x000028, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000030, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000038, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000040, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000048, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x00004C, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000050, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetGameState_ReturnValue) == 0x000138, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetComponentByClass_ReturnValue) == 0x000140, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000148, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_MakeEffectContext_ReturnValue) == 0x000158, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetComponentBounds_Origin) == 0x000178, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetComponentBounds_BoxExtent) == 0x000190, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetComponentBounds_SphereRadius) == 0x0001A8, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B0, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_ObjectIsA_ReturnValue) == 0x0001C8, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0001D0, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetAttributeSet_ReturnValue) == 0x0001D8, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Not_PreBool_ReturnValue) == 0x0001E0, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_IsValid_ReturnValue_2) == 0x0001E1, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_BooleanOR_ReturnValue) == 0x0001E2, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_DynamicCast_AsTgf_Defend_Attribute_Set) == 0x0001E8, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_DynamicCast_AsTgf_Defend_Attribute_Set' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_IsValid_ReturnValue_3) == 0x0001F1, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_GetDefendValueWithAnim_ReturnValue) == 0x0001F4, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_GetDefendValueWithAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F8, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Less_IntInt_ReturnValue) == 0x0001F9, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001FC, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Add_IntInt_ReturnValue_1) == 0x000200, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, Temp_bool_IsClosed_Variable) == 0x000204, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_HasAuthority_ReturnValue) == 0x000205, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000208, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000210, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_ApplyHitValueAndInterrupt_ReturnValue) == 0x000228, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_ApplyHitValueAndInterrupt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x000229, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Not_PreBool_ReturnValue_2) == 0x00022A, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, Temp_int_Variable_1) == 0x00022C, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_HasAuthority_ReturnValue_1) == 0x000230, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_CustomEvent_IntParam) == 0x000234, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_CustomEvent_IntParam' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000238, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000240, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000248, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000250, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000258, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_bFromSweep) == 0x00025C, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_SweepResult) == 0x000260, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000348, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherActor) == 0x000350, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherComp) == 0x000358, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000360, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_ObjectIsA_ReturnValue_1) == 0x000364, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_ObjectIsA_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_ObjectIsA_ReturnValue_2) == 0x000365, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_ObjectIsA_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_BooleanOR_ReturnValue_1) == 0x000366, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_BooleanOR_ReturnValue_2) == 0x000367, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_ObjectIsA_ReturnValue_3) == 0x000368, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_ObjectIsA_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_ObjectIsA_ReturnValue_4) == 0x000369, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_ObjectIsA_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000370, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Array_Get_Item) == 0x000388, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_LineTraceSingle_OutHit) == 0x000390, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_LineTraceSingle_ReturnValue) == 0x000478, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00047C, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Array_Length_ReturnValue) == 0x000484, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Less_IntInt_ReturnValue_1) == 0x000488, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Array_Add_ReturnValue) == 0x00048C, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_Array_Contains_ReturnValue) == 0x000490, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_HasAuthority_ReturnValue_2) == 0x000491, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, K2Node_VariableSet_DefendHitValue_ImplicitCast) == 0x000498, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::K2Node_VariableSet_DefendHitValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase, CallFunc_ApplyHitValueAndInterrupt_HitValue_ImplicitCast) == 0x0004A0, "Member 'BP_TrapBase_C_ExecuteUbergraph_BP_TrapBase::CallFunc_ApplyHitValueAndInterrupt_HitValue_ImplicitCast' has a wrong offset!");

// Function BP_TrapBase.BP_TrapBase_C.OnTriggered
// 0x0004 (0x0004 - 0x0000)
struct BP_TrapBase_C_OnTriggered final
{
public:
	int32                                         IntParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrapBase_C_OnTriggered) == 0x000004, "Wrong alignment on BP_TrapBase_C_OnTriggered");
static_assert(sizeof(BP_TrapBase_C_OnTriggered) == 0x000004, "Wrong size on BP_TrapBase_C_OnTriggered");
static_assert(offsetof(BP_TrapBase_C_OnTriggered, IntParam) == 0x000000, "Member 'BP_TrapBase_C_OnTriggered::IntParam' has a wrong offset!");

}

