#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TgfGame_MapHint

#include "Basic.hpp"

#include "S_DisplayKillInfo_structs.hpp"
#include "S_PretreatDisplayStateTagInfo_structs.hpp"
#include "LyraGame_structs.hpp"
#include "S_DisplayPersistentData_structs.hpp"
#include "S_PretreatDisplayKillInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_PretreatDisplayMarkPointInfo_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_Detected_Portal_Item_structs.hpp"
#include "S_PretreatDisplayDetectInfo_structs.hpp"
#include "S_PretreatDisplayCharacterInfo_structs.hpp"
#include "S_MarkPointMessage_structs.hpp"
#include "S_PretreatDisplayPortalInfo_structs.hpp"
#include "S_DisplayCombinedType_structs.hpp"
#include "S_DisplayPortalInfo_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "S_DisplayDropInfo_structs.hpp"
#include "S_PortalInfo_structs.hpp"
#include "S_DetectPortal_Msg_structs.hpp"


namespace SDK::Params
{

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddDisplayMessageDropInfo
// 0x0038 (0x0038 - 0x0000)
struct BP_TgfGame_MapHint_C_AddDisplayMessageDropInfo final
{
public:
	struct FS_DisplayDropInfo                     DropInfo;                                          // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddDisplayMessageDropInfo) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddDisplayMessageDropInfo");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddDisplayMessageDropInfo) == 0x000038, "Wrong size on BP_TgfGame_MapHint_C_AddDisplayMessageDropInfo");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddDisplayMessageDropInfo, DropInfo) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddDisplayMessageDropInfo::DropInfo' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddDisplayMessageKillInfo
// 0x00E8 (0x00E8 - 0x0000)
struct BP_TgfGame_MapHint_C_AddDisplayMessageKillInfo final
{
public:
	struct FS_PretreatDisplayKillInfo             PreKillInfo;                                       // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddDisplayMessageKillInfo) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddDisplayMessageKillInfo");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddDisplayMessageKillInfo) == 0x0000E8, "Wrong size on BP_TgfGame_MapHint_C_AddDisplayMessageKillInfo");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddDisplayMessageKillInfo, PreKillInfo) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddDisplayMessageKillInfo::PreKillInfo' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddDisplayMessagePortalInfo
// 0x0060 (0x0060 - 0x0000)
struct BP_TgfGame_MapHint_C_AddDisplayMessagePortalInfo final
{
public:
	struct FS_PretreatDisplayPortalInfo           PrePortalInfo;                                     // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddDisplayMessagePortalInfo) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddDisplayMessagePortalInfo");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddDisplayMessagePortalInfo) == 0x000060, "Wrong size on BP_TgfGame_MapHint_C_AddDisplayMessagePortalInfo");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddDisplayMessagePortalInfo, PrePortalInfo) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddDisplayMessagePortalInfo::PrePortalInfo' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddEscapeHintData
// 0x0038 (0x0038 - 0x0000)
struct BP_TgfGame_MapHint_C_AddEscapeHintData final
{
public:
	ETgfEscapeMapHintType                         HintType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                HandleObject;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         ReportCharacter;                                   // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         HandleObjectID;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddEscapeHintData) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddEscapeHintData");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddEscapeHintData) == 0x000038, "Wrong size on BP_TgfGame_MapHint_C_AddEscapeHintData");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddEscapeHintData, HintType) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddEscapeHintData::HintType' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddEscapeHintData, Location) == 0x000008, "Member 'BP_TgfGame_MapHint_C_AddEscapeHintData::Location' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddEscapeHintData, HandleObject) == 0x000020, "Member 'BP_TgfGame_MapHint_C_AddEscapeHintData::HandleObject' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddEscapeHintData, ReportCharacter) == 0x000028, "Member 'BP_TgfGame_MapHint_C_AddEscapeHintData::ReportCharacter' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddEscapeHintData, HandleObjectID) == 0x000030, "Member 'BP_TgfGame_MapHint_C_AddEscapeHintData::HandleObjectID' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddMarkPointMsg
// 0x0040 (0x0040 - 0x0000)
struct BP_TgfGame_MapHint_C_AddMarkPointMsg final
{
public:
	struct FS_PretreatDisplayMarkPointInfo        PreMarkPointData;                                  // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddMarkPointMsg) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddMarkPointMsg");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddMarkPointMsg) == 0x000040, "Wrong size on BP_TgfGame_MapHint_C_AddMarkPointMsg");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddMarkPointMsg, PreMarkPointData) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddMarkPointMsg::PreMarkPointData' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddMonsterMsgInfo
// 0x0050 (0x0050 - 0x0000)
struct BP_TgfGame_MapHint_C_AddMonsterMsgInfo final
{
public:
	struct FS_PretreatDisplayCharacterInfo        PreMonsterData;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddMonsterMsgInfo) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddMonsterMsgInfo");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddMonsterMsgInfo) == 0x000050, "Wrong size on BP_TgfGame_MapHint_C_AddMonsterMsgInfo");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddMonsterMsgInfo, PreMonsterData) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddMonsterMsgInfo::PreMonsterData' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddPortalDetectMsg
// 0x0040 (0x0040 - 0x0000)
struct BP_TgfGame_MapHint_C_AddPortalDetectMsg final
{
public:
	struct FS_PretreatDisplayDetectInfo           PreDetectData;                                     // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddPortalDetectMsg) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddPortalDetectMsg");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddPortalDetectMsg) == 0x000040, "Wrong size on BP_TgfGame_MapHint_C_AddPortalDetectMsg");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddPortalDetectMsg, PreDetectData) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddPortalDetectMsg::PreDetectData' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.AddStateTagMsg
// 0x0018 (0x0018 - 0x0000)
struct BP_TgfGame_MapHint_C_AddStateTagMsg final
{
public:
	struct FS_PretreatDisplayStateTagInfo         PreStateTagData;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_AddStateTagMsg) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_AddStateTagMsg");
static_assert(sizeof(BP_TgfGame_MapHint_C_AddStateTagMsg) == 0x000018, "Wrong size on BP_TgfGame_MapHint_C_AddStateTagMsg");
static_assert(offsetof(BP_TgfGame_MapHint_C_AddStateTagMsg, PreStateTagData) == 0x000000, "Member 'BP_TgfGame_MapHint_C_AddStateTagMsg::PreStateTagData' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.CheckDisplayPersistentDataEqual
// 0x0098 (0x0098 - 0x0000)
struct BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual final
{
public:
	class UObject*                                CheckObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfIntraGameDisplayInfoType                  MainType;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Subtype;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_DisplayPersistentData               TargetData;                                        // 0x0018(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CheckObjectID;                                     // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CheckAbilityOwnerID;                               // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEqual;                                           // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_1;      // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_2;      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual");
static_assert(sizeof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual) == 0x000098, "Wrong size on BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CheckObject) == 0x000000, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CheckObject' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, MainType) == 0x000008, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::MainType' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, Subtype) == 0x000010, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::Subtype' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, TargetData) == 0x000018, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::TargetData' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CheckObjectID) == 0x000078, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CheckObjectID' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CheckAbilityOwnerID) == 0x000080, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CheckAbilityOwnerID' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, IsEqual) == 0x000088, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::IsEqual' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_Greater_Int64Int64_ReturnValue) == 0x000089, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_Greater_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x00008A, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_EqualEqual_Int64Int64_ReturnValue_1) == 0x00008B, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_EqualEqual_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_EqualEqual_Int64Int64_ReturnValue_2) == 0x00008C, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_EqualEqual_Int64Int64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008D, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_BooleanAND_ReturnValue) == 0x00008E, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_BooleanAND_ReturnValue_1) == 0x00008F, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual, CallFunc_BooleanAND_ReturnValue_2) == 0x000090, "Member 'BP_TgfGame_MapHint_C_CheckDisplayPersistentDataEqual::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.CheckKillSubtype
// 0x0030 (0x0030 - 0x0000)
struct BP_TgfGame_MapHint_C_CheckKillSubtype final
{
public:
	class ALyraCharacter*                         KillChara;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         DeadChara;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfDisplayInfoKillSubType                    LocalKillSubtype;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSourceIsMonster_IsSourceCharaMonster; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_CheckSourceIsMonster_SourceChara;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSourceIsMonster_IsSummon;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_CheckSourceIsMonster_SummonChara;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_CheckKillSubtype) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_CheckKillSubtype");
static_assert(sizeof(BP_TgfGame_MapHint_C_CheckKillSubtype) == 0x000030, "Wrong size on BP_TgfGame_MapHint_C_CheckKillSubtype");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckKillSubtype, KillChara) == 0x000000, "Member 'BP_TgfGame_MapHint_C_CheckKillSubtype::KillChara' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckKillSubtype, DeadChara) == 0x000008, "Member 'BP_TgfGame_MapHint_C_CheckKillSubtype::DeadChara' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckKillSubtype, LocalKillSubtype) == 0x000010, "Member 'BP_TgfGame_MapHint_C_CheckKillSubtype::LocalKillSubtype' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckKillSubtype, CallFunc_CheckSourceIsMonster_IsSourceCharaMonster) == 0x000011, "Member 'BP_TgfGame_MapHint_C_CheckKillSubtype::CallFunc_CheckSourceIsMonster_IsSourceCharaMonster' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckKillSubtype, CallFunc_CheckSourceIsMonster_SourceChara) == 0x000018, "Member 'BP_TgfGame_MapHint_C_CheckKillSubtype::CallFunc_CheckSourceIsMonster_SourceChara' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckKillSubtype, CallFunc_CheckSourceIsMonster_IsSummon) == 0x000020, "Member 'BP_TgfGame_MapHint_C_CheckKillSubtype::CallFunc_CheckSourceIsMonster_IsSummon' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckKillSubtype, CallFunc_CheckSourceIsMonster_SummonChara) == 0x000028, "Member 'BP_TgfGame_MapHint_C_CheckKillSubtype::CallFunc_CheckSourceIsMonster_SummonChara' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.CheckMessageDataForMapView
// 0x0080 (0x0080 - 0x0000)
struct BP_TgfGame_MapHint_C_CheckMessageDataForMapView final
{
public:
	ETgfIntraGameDisplayInfoType                  MainType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Subtype;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasMapView;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_DisplayCombinedType                 CallFunc_Array_Get_Item;                           // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_1;      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_3;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_2;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_3;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_4;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_5;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_4;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_5;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_CheckMessageDataForMapView");
static_assert(sizeof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView) == 0x000080, "Wrong size on BP_TgfGame_MapHint_C_CheckMessageDataForMapView");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, MainType) == 0x000000, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::MainType' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, Subtype) == 0x000008, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::Subtype' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, HasMapView) == 0x000010, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::HasMapView' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Array_Get_Item) == 0x000024, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Conv_ByteToInt64_ReturnValue) == 0x000038, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Conv_ByteToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Conv_ByteToInt64_ReturnValue_1) == 0x000040, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Conv_ByteToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000048, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_EqualEqual_Int64Int64_ReturnValue_1) == 0x000049, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_EqualEqual_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Conv_ByteToInt64_ReturnValue_2) == 0x000050, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Conv_ByteToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Conv_ByteToInt64_ReturnValue_3) == 0x000058, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Conv_ByteToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_EqualEqual_Int64Int64_ReturnValue_2) == 0x000060, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_EqualEqual_Int64Int64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_EqualEqual_Int64Int64_ReturnValue_3) == 0x000061, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_EqualEqual_Int64Int64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Conv_ByteToInt64_ReturnValue_4) == 0x000068, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Conv_ByteToInt64_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_Conv_ByteToInt64_ReturnValue_5) == 0x000070, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_Conv_ByteToInt64_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_EqualEqual_Int64Int64_ReturnValue_4) == 0x000078, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_EqualEqual_Int64Int64_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_EqualEqual_Int64Int64_ReturnValue_5) == 0x000079, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_EqualEqual_Int64Int64_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007A, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckMessageDataForMapView, K2Node_SwitchEnum_CmpSuccess) == 0x00007B, "Member 'BP_TgfGame_MapHint_C_CheckMessageDataForMapView::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.CheckSourceIsMonster
// 0x0058 (0x0058 - 0x0000)
struct BP_TgfGame_MapHint_C_CheckSourceIsMonster final
{
public:
	class ALyraCharacter*                         Chara;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSourceCharaMonster;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         SourceChara;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSummon;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         SummonChara;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         InChara;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSummonType;                                      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfCharacterSummonComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSummonSource_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMonster_ReturnValue;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMonster_ReturnValue_1;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfGame_MapHint_C_CheckSourceIsMonster) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_CheckSourceIsMonster");
static_assert(sizeof(BP_TgfGame_MapHint_C_CheckSourceIsMonster) == 0x000058, "Wrong size on BP_TgfGame_MapHint_C_CheckSourceIsMonster");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, Chara) == 0x000000, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::Chara' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, IsSourceCharaMonster) == 0x000008, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::IsSourceCharaMonster' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, SourceChara) == 0x000010, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::SourceChara' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, IsSummon) == 0x000018, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::IsSummon' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, SummonChara) == 0x000020, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::SummonChara' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, InChara) == 0x000028, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::InChara' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, IsSummonType) == 0x000030, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::IsSummonType' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, CallFunc_GetSummonSource_ReturnValue) == 0x000040, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::CallFunc_GetSummonSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, K2Node_DynamicCast_AsLyra_Character) == 0x000048, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000051, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, CallFunc_IsMonster_ReturnValue) == 0x000052, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::CallFunc_IsMonster_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, CallFunc_Not_PreBool_ReturnValue) == 0x000053, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, CallFunc_IsMonster_ReturnValue_1) == 0x000054, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::CallFunc_IsMonster_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TgfGame_MapHint_C_CheckSourceIsMonster, CallFunc_BooleanAND_ReturnValue) == 0x000055, "Member 'BP_TgfGame_MapHint_C_CheckSourceIsMonster::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7
// 0x00B0 (0x00B0 - 0x0000)
struct BP_TgfGame_MapHint_C_EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_TgfGame_MapHint_C_EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7) == 0x000008, "Wrong alignment on BP_TgfGame_MapHint_C_EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7");
static_assert(sizeof(BP_TgfGame_MapHint_C_EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7) == 0x0000B0, "Wrong size on BP_TgfGame_MapHint_C_EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7");
static_assert(offsetof(BP_TgfGame_MapHint_C_EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7, Payload) == 0x000000, "Member 'BP_TgfGame_MapHint_C_EventReceived_397400A84FCF1E63DE5EBCA18ABBD8C7::Payload' has a wrong offset!");

// Function BP_TgfGame_MapHint.BP_TgfGame_MapHint_C.ExecuteUbergraph_BP_TgfGame_MapHint
// 0x2BD0 (0x2BD0 - 0x0000)
struct BP_TgfGame_MapHint_C_ExecuteUbergraph_BP_TgfGame_MapHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_12;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_12;               // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       Temp_struct_Variable;                              // 0x0028(0x0080)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ActorSpawnPoint_C*                  K2Node_DynamicCast_AsBP_Actor_Spawn_Point;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GenPretreatDisplayMonsterData_IsValidForMap; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PretreatDisplayCharacterInfo        CallFunc_GenPretreatDisplayMonsterData_PreCharacterInfo; // 0x00E0(0x0050)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       Temp_struct_Variable_2;                            // 0x0138(0x0080)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_11;                 // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_11;               // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       Temp_struct_Variable_3;                            // 0x01E0(0x0080)()
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default_1;   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ActorSpawnPoint_C*                  K2Node_DynamicCast_AsBP_Actor_Spawn_Point_1;       // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GenPretreatDisplayMonsterData_IsValidForMap_1; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PretreatDisplayCharacterInfo        CallFunc_GenPretreatDisplayMonsterData_PreCharacterInfo_1; // 0x02A0(0x0050)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLyraVerbMessage                       Temp_struct_Variable_5;                            // 0x02F8(0x0080)()
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_10;                 // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_10;               // 0x0380(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0388(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       Temp_struct_Variable_6;                            // 0x0398(0x0080)()
	struct FGameplayTag                           Temp_struct_Variable_7;                            // 0x0418(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_2;                            // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default_2;   // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ActorSpawnPoint_C*                  K2Node_DynamicCast_AsBP_Actor_Spawn_Point_2;       // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_2;  // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GenPretreatDisplayMonsterData_IsValidForMap_2; // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PretreatDisplayCharacterInfo        CallFunc_GenPretreatDisplayMonsterData_PreCharacterInfo_2; // 0x0458(0x0050)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DetectPortal_Msg                    Temp_struct_Variable_8;                            // 0x04B0(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_9;                  // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_9;                // 0x04D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x04E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DetectPortal_Msg                    Temp_struct_Variable_9;                            // 0x04F0(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_10;                           // 0x0510(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_3;                            // 0x0518(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_2;                 // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PretreatDisplayDetectInfo           CallFunc_GenPretreatDisplayPortalDetectData_PretreatDetectData; // 0x0530(0x0040)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GenPretreatDisplayPortalDetectData_IsValid; // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_3;  // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DetectPortal_Msg                    Temp_struct_Variable_11;                           // 0x0588(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_8;                  // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_8;                // 0x05B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x05B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DetectPortal_Msg                    Temp_struct_Variable_12;                           // 0x05C8(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_13;                           // 0x05E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_4;                            // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_4;  // 0x05F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_3;                 // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_602[0x6];                                      // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PortalInfo                          Temp_struct_Variable_14;                           // 0x0608(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_7;                  // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_7;                // 0x0630(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0638(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PortalInfo                          Temp_struct_Variable_15;                           // 0x0648(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_16;                           // 0x0668(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_5;                            // 0x0670(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_5;  // 0x0678(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_4;                 // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682[0x6];                                      // 0x0682(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue;             // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_1;           // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_PretreatDisplayPortalInfo           CallFunc_GenPretreatDisplayPortalData_PrePortalData; // 0x0698(0x0060)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_2;           // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_3;           // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_ByteToInt64_ReturnValue_4;           // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_MarkPointMessage                    Temp_struct_Variable_17;                           // 0x0710(0x0028)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_6;                  // 0x0738(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_6;                // 0x0740(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0748(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_MarkPointMessage                    Temp_struct_Variable_18;                           // 0x0758(0x0028)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_19;                           // 0x0780(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_6;                            // 0x0788(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_PretreatDisplayMarkPointInfo        CallFunc_GenPretreatDisplayMarkPointData_PretreatMarkPointData; // 0x0790(0x0040)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GenPretreatDisplayMarkPointData_IsValid;  // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_5;                 // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D2[0x6];                                      // 0x07D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_6;  // 0x07D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_MarkPointMessage                    Temp_struct_Variable_20;                           // 0x07E0(0x0028)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
