#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TGF_CharacterLoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_InteractableBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TGF_CharacterLoot.BP_TGF_CharacterLoot_C
// 0x0060 (0x03B0 - 0x0350)
class ABP_TGF_CharacterLoot_C final : public ABP_InteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_TGF_CharacterLoot_C;             // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Tgf_Character_Default_C*            Character;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class APawn*>                            InteractedCharacters;                              // 0x0360(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void AttachToCharacter(class ABP_Tgf_Character_Default_C* Param_Character);
	void ExecuteUbergraph_BP_TGF_CharacterLoot(int32 EntryPoint);
	void Get_Server_Check_Distance(double* Param_ServerCheckDistanceXY, double* Param_ServerCheckDistanceZ);
	void GetInteractionPromptText(class APlayerController* Param_Instigator, class FText* Key, class FText* Out_Text_Line_1, class FText* Out_Text_Line_2);
	void GetTraceActor(class AActor** Actor);
	void PerformInteraction_on_Server(class APawn* InteractingPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TGF_CharacterLoot_C">();
	}
	static class ABP_TGF_CharacterLoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TGF_CharacterLoot_C>();
	}
};
static_assert(alignof(ABP_TGF_CharacterLoot_C) == 0x000008, "Wrong alignment on ABP_TGF_CharacterLoot_C");
static_assert(sizeof(ABP_TGF_CharacterLoot_C) == 0x0003B0, "Wrong size on ABP_TGF_CharacterLoot_C");
static_assert(offsetof(ABP_TGF_CharacterLoot_C, UberGraphFrame_BP_TGF_CharacterLoot_C) == 0x000350, "Member 'ABP_TGF_CharacterLoot_C::UberGraphFrame_BP_TGF_CharacterLoot_C' has a wrong offset!");
static_assert(offsetof(ABP_TGF_CharacterLoot_C, Character) == 0x000358, "Member 'ABP_TGF_CharacterLoot_C::Character' has a wrong offset!");
static_assert(offsetof(ABP_TGF_CharacterLoot_C, InteractedCharacters) == 0x000360, "Member 'ABP_TGF_CharacterLoot_C::InteractedCharacters' has a wrong offset!");

}

