#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TgfPawnCosmetics

#include "Basic.hpp"

#include "Struct_AvatarCosmeticPart_structs.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TgfPawnCosmetics.BP_TgfPawnCosmetics_C
// 0x0020 (0x03C8 - 0x03A8)
class UBP_TgfPawnCosmetics_C final : public ULyraPawnComponent_CharacterParts
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FStruct_AvatarCosmeticPart>     Parts;                                             // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLyraCharacterPartHandle               PancherHandle;                                     // 0x03C0(0x0004)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor)
	struct FLyraCharacterPartHandle               HumanHandle;                                       // 0x03C4(0x0004)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_TgfPawnCosmetics(int32 EntryPoint);
	void HumanMode();
	void InitializeWithAbilitySystem(class ULyraAbilitySystemComponent* InASC);
	void PantherMode();
	void PickBestAvatarPart(const struct FGameplayTagContainer& Tags, struct FLyraCharacterPart* Part);
	void ReceiveBeginPlay();
	void ResetAnimInstance();
	void Set_Anim_Mesh(bool Panther);
	void ShowHumanMesh();
	void ShowPantherMesh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TgfPawnCosmetics_C">();
	}
	static class UBP_TgfPawnCosmetics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TgfPawnCosmetics_C>();
	}
};
static_assert(alignof(UBP_TgfPawnCosmetics_C) == 0x000008, "Wrong alignment on UBP_TgfPawnCosmetics_C");
static_assert(sizeof(UBP_TgfPawnCosmetics_C) == 0x0003C8, "Wrong size on UBP_TgfPawnCosmetics_C");
static_assert(offsetof(UBP_TgfPawnCosmetics_C, UberGraphFrame) == 0x0003A8, "Member 'UBP_TgfPawnCosmetics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TgfPawnCosmetics_C, Parts) == 0x0003B0, "Member 'UBP_TgfPawnCosmetics_C::Parts' has a wrong offset!");
static_assert(offsetof(UBP_TgfPawnCosmetics_C, PancherHandle) == 0x0003C0, "Member 'UBP_TgfPawnCosmetics_C::PancherHandle' has a wrong offset!");
static_assert(offsetof(UBP_TgfPawnCosmetics_C, HumanHandle) == 0x0003C4, "Member 'UBP_TgfPawnCosmetics_C::HumanHandle' has a wrong offset!");

}

