#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TGF_CharacterLoot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TGF_CharacterLoot.BP_TGF_CharacterLoot_C.AttachToCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterLoot_C_AttachToCharacter final
{
public:
	class ABP_Tgf_Character_Default_C*            Param_Character;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterLoot_C_AttachToCharacter) == 0x000008, "Wrong alignment on BP_TGF_CharacterLoot_C_AttachToCharacter");
static_assert(sizeof(BP_TGF_CharacterLoot_C_AttachToCharacter) == 0x000008, "Wrong size on BP_TGF_CharacterLoot_C_AttachToCharacter");
static_assert(offsetof(BP_TGF_CharacterLoot_C_AttachToCharacter, Param_Character) == 0x000000, "Member 'BP_TGF_CharacterLoot_C_AttachToCharacter::Param_Character' has a wrong offset!");

// Function BP_TGF_CharacterLoot.BP_TGF_CharacterLoot_C.ExecuteUbergraph_BP_TGF_CharacterLoot
// 0x0068 (0x0068 - 0x0000)
struct BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_InteractingPawn;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraEquipmentManagerComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraInventoryManagerComponent*         CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraEquipmentManagerComponent*         Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraEquipmentManagerComponent*         K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot) == 0x000008, "Wrong alignment on BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot");
static_assert(sizeof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot) == 0x000068, "Wrong size on BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, EntryPoint) == 0x000000, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, Temp_bool_Variable) == 0x000004, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, K2Node_Event_InteractingPawn) == 0x000010, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_IsPlayer_ReturnValue) == 0x000020, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000028, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_GetController_ReturnValue) == 0x000030, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000040, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, Temp_object_Variable) == 0x000050, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, CallFunc_Set_Contains_ReturnValue) == 0x000058, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot, K2Node_Select_Default) == 0x000060, "Member 'BP_TGF_CharacterLoot_C_ExecuteUbergraph_BP_TGF_CharacterLoot::K2Node_Select_Default' has a wrong offset!");

// Function BP_TGF_CharacterLoot.BP_TGF_CharacterLoot_C.Get Server Check Distance
// 0x0010 (0x0010 - 0x0000)
struct BP_TGF_CharacterLoot_C_Get_Server_Check_Distance final
{
public:
	double                                        Param_ServerCheckDistanceXY;                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_ServerCheckDistanceZ;                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterLoot_C_Get_Server_Check_Distance) == 0x000008, "Wrong alignment on BP_TGF_CharacterLoot_C_Get_Server_Check_Distance");
static_assert(sizeof(BP_TGF_CharacterLoot_C_Get_Server_Check_Distance) == 0x000010, "Wrong size on BP_TGF_CharacterLoot_C_Get_Server_Check_Distance");
static_assert(offsetof(BP_TGF_CharacterLoot_C_Get_Server_Check_Distance, Param_ServerCheckDistanceXY) == 0x000000, "Member 'BP_TGF_CharacterLoot_C_Get_Server_Check_Distance::Param_ServerCheckDistanceXY' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_Get_Server_Check_Distance, Param_ServerCheckDistanceZ) == 0x000008, "Member 'BP_TGF_CharacterLoot_C_Get_Server_Check_Distance::Param_ServerCheckDistanceZ' has a wrong offset!");

// Function BP_TGF_CharacterLoot.BP_TGF_CharacterLoot_C.GetInteractionPromptText
// 0x0050 (0x0050 - 0x0000)
struct BP_TGF_CharacterLoot_C_GetInteractionPromptText final
{
public:
	class APlayerController*                      Param_Instigator;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Key;                                               // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_1;                                   // 0x0020(0x0018)(Parm, OutParm)
	class FText                                   Out_Text_Line_2;                                   // 0x0038(0x0018)(Parm, OutParm)
};
static_assert(alignof(BP_TGF_CharacterLoot_C_GetInteractionPromptText) == 0x000008, "Wrong alignment on BP_TGF_CharacterLoot_C_GetInteractionPromptText");
static_assert(sizeof(BP_TGF_CharacterLoot_C_GetInteractionPromptText) == 0x000050, "Wrong size on BP_TGF_CharacterLoot_C_GetInteractionPromptText");
static_assert(offsetof(BP_TGF_CharacterLoot_C_GetInteractionPromptText, Param_Instigator) == 0x000000, "Member 'BP_TGF_CharacterLoot_C_GetInteractionPromptText::Param_Instigator' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_GetInteractionPromptText, Key) == 0x000008, "Member 'BP_TGF_CharacterLoot_C_GetInteractionPromptText::Key' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_GetInteractionPromptText, Out_Text_Line_1) == 0x000020, "Member 'BP_TGF_CharacterLoot_C_GetInteractionPromptText::Out_Text_Line_1' has a wrong offset!");
static_assert(offsetof(BP_TGF_CharacterLoot_C_GetInteractionPromptText, Out_Text_Line_2) == 0x000038, "Member 'BP_TGF_CharacterLoot_C_GetInteractionPromptText::Out_Text_Line_2' has a wrong offset!");

// Function BP_TGF_CharacterLoot.BP_TGF_CharacterLoot_C.GetTraceActor
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterLoot_C_GetTraceActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterLoot_C_GetTraceActor) == 0x000008, "Wrong alignment on BP_TGF_CharacterLoot_C_GetTraceActor");
static_assert(sizeof(BP_TGF_CharacterLoot_C_GetTraceActor) == 0x000008, "Wrong size on BP_TGF_CharacterLoot_C_GetTraceActor");
static_assert(offsetof(BP_TGF_CharacterLoot_C_GetTraceActor, Actor) == 0x000000, "Member 'BP_TGF_CharacterLoot_C_GetTraceActor::Actor' has a wrong offset!");

// Function BP_TGF_CharacterLoot.BP_TGF_CharacterLoot_C.PerformInteraction on Server
// 0x0008 (0x0008 - 0x0000)
struct BP_TGF_CharacterLoot_C_PerformInteraction_on_Server final
{
public:
	class APawn*                                  InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TGF_CharacterLoot_C_PerformInteraction_on_Server) == 0x000008, "Wrong alignment on BP_TGF_CharacterLoot_C_PerformInteraction_on_Server");
static_assert(sizeof(BP_TGF_CharacterLoot_C_PerformInteraction_on_Server) == 0x000008, "Wrong size on BP_TGF_CharacterLoot_C_PerformInteraction_on_Server");
static_assert(offsetof(BP_TGF_CharacterLoot_C_PerformInteraction_on_Server, InteractingPawn) == 0x000000, "Member 'BP_TGF_CharacterLoot_C_PerformInteraction_on_Server::InteractingPawn' has a wrong offset!");

}

