#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TgfMonsterMaterialManagerComponent

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TgfMonsterMaterialManagerComponent.BP_TgfMonsterMaterialManagerComponent_C.ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent
// 0x001C (0x001C - 0x0000)
struct BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfCharaMatStateType                         K2Node_Event_NewStateType;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfCharaMatStateType                         K2Node_Event_OldStateType;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfCharaMatStateType                         K2Node_Event_NewStateType_1;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfCharaMatStateType                         K2Node_Event_OldStateType_1;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent) == 0x000004, "Wrong alignment on BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent");
static_assert(sizeof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent) == 0x00001C, "Wrong size on BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, EntryPoint) == 0x000000, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, K2Node_Event_NewStateType) == 0x000004, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::K2Node_Event_NewStateType' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, K2Node_Event_OldStateType) == 0x000005, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::K2Node_Event_OldStateType' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, K2Node_Event_NewStateType_1) == 0x000007, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::K2Node_Event_NewStateType_1' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, K2Node_Event_OldStateType_1) == 0x000008, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::K2Node_Event_OldStateType_1' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, K2Node_SwitchEnum_CmpSuccess_1) == 0x000009, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_TgfMonsterMaterialManagerComponent_C_ExecuteUbergraph_BP_TgfMonsterMaterialManagerComponent::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_TgfMonsterMaterialManagerComponent.BP_TgfMonsterMaterialManagerComponent_C.OnMaterialUpdatedAfter
// 0x0002 (0x0002 - 0x0000)
struct BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter final
{
public:
	ETgfCharaMatStateType                         NewStateType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfCharaMatStateType                         OldStateType;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter) == 0x000001, "Wrong alignment on BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter");
static_assert(sizeof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter) == 0x000002, "Wrong size on BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter, NewStateType) == 0x000000, "Member 'BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter::NewStateType' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter, OldStateType) == 0x000001, "Member 'BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedAfter::OldStateType' has a wrong offset!");

// Function BP_TgfMonsterMaterialManagerComponent.BP_TgfMonsterMaterialManagerComponent_C.OnMaterialUpdatedBefore
// 0x0002 (0x0002 - 0x0000)
struct BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore final
{
public:
	ETgfCharaMatStateType                         NewStateType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfCharaMatStateType                         OldStateType;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore) == 0x000001, "Wrong alignment on BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore");
static_assert(sizeof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore) == 0x000002, "Wrong size on BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore, NewStateType) == 0x000000, "Member 'BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore::NewStateType' has a wrong offset!");
static_assert(offsetof(BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore, OldStateType) == 0x000001, "Member 'BP_TgfMonsterMaterialManagerComponent_C_OnMaterialUpdatedBefore::OldStateType' has a wrong offset!");

}

