#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TgfGame_PlayerGameFlow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TgfGame_PlayerGameFlow.BP_TgfGame_PlayerGameFlow_C
// 0x0068 (0x0118 - 0x00B0)
class UBP_TgfGame_PlayerGameFlow_C final : public UTgfPlayerGameFlow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsInWaitingRoom;                                   // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DisappearDuration;                                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FGameplayTag> EventTagMap;                                       // 0x00C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ClientEscape();
	void ClientTeleport();
	void ExecuteUbergraph_BP_TgfGame_PlayerGameFlow(int32 EntryPoint);
	void Extract_Client();
	void FreezePlayer(class ALyraCharacter* Character);
	void K2_ServerTeleport();
	void OnPlayerEnterPortal(const struct FTgfEnterPortalParameter& Parameter);
	void Quit(double Delay);
	void SelectEventTag(const struct FGameplayTag& PortalTag, struct FGameplayTag* Tag);
	void SetPlayerSceneTag(class ALyraPlayerState* PlayerState, const struct FGameplayTag& Tag);
	void Teleport_Client();
	void UnFreezePlayer(class ALyraCharacter* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TgfGame_PlayerGameFlow_C">();
	}
	static class UBP_TgfGame_PlayerGameFlow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TgfGame_PlayerGameFlow_C>();
	}
};
static_assert(alignof(UBP_TgfGame_PlayerGameFlow_C) == 0x000008, "Wrong alignment on UBP_TgfGame_PlayerGameFlow_C");
static_assert(sizeof(UBP_TgfGame_PlayerGameFlow_C) == 0x000118, "Wrong size on UBP_TgfGame_PlayerGameFlow_C");
static_assert(offsetof(UBP_TgfGame_PlayerGameFlow_C, UberGraphFrame) == 0x0000B0, "Member 'UBP_TgfGame_PlayerGameFlow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TgfGame_PlayerGameFlow_C, IsInWaitingRoom) == 0x0000B8, "Member 'UBP_TgfGame_PlayerGameFlow_C::IsInWaitingRoom' has a wrong offset!");
static_assert(offsetof(UBP_TgfGame_PlayerGameFlow_C, DisappearDuration) == 0x0000C0, "Member 'UBP_TgfGame_PlayerGameFlow_C::DisappearDuration' has a wrong offset!");
static_assert(offsetof(UBP_TgfGame_PlayerGameFlow_C, EventTagMap) == 0x0000C8, "Member 'UBP_TgfGame_PlayerGameFlow_C::EventTagMap' has a wrong offset!");

}

