#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TGF_CharacterInvSee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_InteractableBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TGF_CharacterInvSee.BP_TGF_CharacterInvSee_C
// 0x0030 (0x0380 - 0x0350)
class ABP_TGF_CharacterInvSee_C final : public ABP_InteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_TGF_CharacterInvSee_C;           // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Tgf_Character_Default_C*            Character;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  UntargetableTags;                                  // 0x0360(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AttachToCharacter(class ABP_Tgf_Character_Default_C* Param_Character);
	void BindParentDestroy(class AActor* Param_Character);
	void CanPlayerInteract(class ALyraCharacter* Player, bool* bCanInteract);
	void DestroySelfWhenDetached(class AActor* DestroyedActor);
	void ExecuteUbergraph_BP_TGF_CharacterInvSee(int32 EntryPoint);
	void GetEnabled(bool* Result);
	void GetInteractionPromptText(class APlayerController* Param_Instigator, class FText* Key, class FText* Out_Text_Line_1, class FText* Out_Text_Line_2);
	void GetTraceActor(class AActor** Actor);
	void PerformInteraction_on_Server(class APawn* InteractingPawn);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TGF_CharacterInvSee_C">();
	}
	static class ABP_TGF_CharacterInvSee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TGF_CharacterInvSee_C>();
	}
};
static_assert(alignof(ABP_TGF_CharacterInvSee_C) == 0x000008, "Wrong alignment on ABP_TGF_CharacterInvSee_C");
static_assert(sizeof(ABP_TGF_CharacterInvSee_C) == 0x000380, "Wrong size on ABP_TGF_CharacterInvSee_C");
static_assert(offsetof(ABP_TGF_CharacterInvSee_C, UberGraphFrame_BP_TGF_CharacterInvSee_C) == 0x000350, "Member 'ABP_TGF_CharacterInvSee_C::UberGraphFrame_BP_TGF_CharacterInvSee_C' has a wrong offset!");
static_assert(offsetof(ABP_TGF_CharacterInvSee_C, Character) == 0x000358, "Member 'ABP_TGF_CharacterInvSee_C::Character' has a wrong offset!");
static_assert(offsetof(ABP_TGF_CharacterInvSee_C, UntargetableTags) == 0x000360, "Member 'ABP_TGF_CharacterInvSee_C::UntargetableTags' has a wrong offset!");

}

