#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_ActivateAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_ActivateAbility.BTS_ActivateAbility_C
// 0x0038 (0x00D0 - 0x0098)
class UBTS_ActivateAbility_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Ability;                                           // 0x00A0(0x0028)(Edit, BlueprintVisible)
	class UClass*                                 GameplayAbility;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_ActivateAbility(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_ActivateAbility_C">();
	}
	static class UBTS_ActivateAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_ActivateAbility_C>();
	}
};
static_assert(alignof(UBTS_ActivateAbility_C) == 0x000008, "Wrong alignment on UBTS_ActivateAbility_C");
static_assert(sizeof(UBTS_ActivateAbility_C) == 0x0000D0, "Wrong size on UBTS_ActivateAbility_C");
static_assert(offsetof(UBTS_ActivateAbility_C, UberGraphFrame) == 0x000098, "Member 'UBTS_ActivateAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_ActivateAbility_C, Ability) == 0x0000A0, "Member 'UBTS_ActivateAbility_C::Ability' has a wrong offset!");
static_assert(offsetof(UBTS_ActivateAbility_C, GameplayAbility) == 0x0000C8, "Member 'UBTS_ActivateAbility_C::GameplayAbility' has a wrong offset!");

}

