#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_Retreat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "TGF_FRetreatEntry_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_Retreat.BTS_Retreat_C
// 0x00F0 (0x0188 - 0x0098)
class UBTS_Retreat_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetAgainst;                                     // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 RetreatIndex;                                      // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FTGF_FRetreatEntry                     RetreatData;                                       // 0x00F0(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ExecutingTag;                                      // 0x0158(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          InterruptByApproachCheck;                          // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterruptByApproachCheckTime;                      // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_Retreat(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_Retreat_C">();
	}
	static class UBTS_Retreat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_Retreat_C>();
	}
};
static_assert(alignof(UBTS_Retreat_C) == 0x000008, "Wrong alignment on UBTS_Retreat_C");
static_assert(sizeof(UBTS_Retreat_C) == 0x000188, "Wrong size on UBTS_Retreat_C");
static_assert(offsetof(UBTS_Retreat_C, UberGraphFrame) == 0x000098, "Member 'UBTS_Retreat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_Retreat_C, TargetAgainst) == 0x0000A0, "Member 'UBTS_Retreat_C::TargetAgainst' has a wrong offset!");
static_assert(offsetof(UBTS_Retreat_C, RetreatIndex) == 0x0000C8, "Member 'UBTS_Retreat_C::RetreatIndex' has a wrong offset!");
static_assert(offsetof(UBTS_Retreat_C, RetreatData) == 0x0000F0, "Member 'UBTS_Retreat_C::RetreatData' has a wrong offset!");
static_assert(offsetof(UBTS_Retreat_C, ExecutingTag) == 0x000158, "Member 'UBTS_Retreat_C::ExecutingTag' has a wrong offset!");
static_assert(offsetof(UBTS_Retreat_C, InterruptByApproachCheck) == 0x000178, "Member 'UBTS_Retreat_C::InterruptByApproachCheck' has a wrong offset!");
static_assert(offsetof(UBTS_Retreat_C, InterruptByApproachCheckTime) == 0x000180, "Member 'UBTS_Retreat_C::InterruptByApproachCheckTime' has a wrong offset!");

}

