#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_Alert

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_Alert.BTS_Alert_C
// 0x0058 (0x00F0 - 0x0098)
class UBTS_Alert_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 AlertState;                                        // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 AlertCompeleted;                                   // 0x00C8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTS_Alert(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveDeactivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_Alert_C">();
	}
	static class UBTS_Alert_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_Alert_C>();
	}
};
static_assert(alignof(UBTS_Alert_C) == 0x000008, "Wrong alignment on UBTS_Alert_C");
static_assert(sizeof(UBTS_Alert_C) == 0x0000F0, "Wrong size on UBTS_Alert_C");
static_assert(offsetof(UBTS_Alert_C, UberGraphFrame) == 0x000098, "Member 'UBTS_Alert_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_Alert_C, AlertState) == 0x0000A0, "Member 'UBTS_Alert_C::AlertState' has a wrong offset!");
static_assert(offsetof(UBTS_Alert_C, AlertCompeleted) == 0x0000C8, "Member 'UBTS_Alert_C::AlertCompeleted' has a wrong offset!");

}

