#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_CheckInAbilityRange

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTS_CheckInAbilityRange.BTS_CheckInAbilityRange_C.ExecuteUbergraph_BTS_CheckInAbilityRange
// 0x0310 (0x0310 - 0x0000)
struct BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UClass*                                 CallFunc_GetBlackboardValueAsClass_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorSimpleCollisionHalfHeight_ReturnValue; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAbilityActivateRange_Result;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCheckAbilitySightRange_Result;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEvade_Result;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetActorSimpleCollisionHalfHeight_ReturnValue_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0190(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x0210(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange) == 0x000008, "Wrong alignment on BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange");
static_assert(sizeof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange) == 0x000310, "Wrong size on BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, EntryPoint) == 0x000000, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, Temp_object_Variable) == 0x000008, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_GetBlackboardValueAsClass_ReturnValue) == 0x000018, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_GetBlackboardValueAsClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, K2Node_Event_OwnerController) == 0x000020, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, K2Node_Event_ControlledPawn) == 0x000028, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_GetActorSimpleCollisionHalfHeight_ReturnValue) == 0x000034, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_GetActorSimpleCollisionHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000038, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000040, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_GetAbilityActivateRange_Result) == 0x000050, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_GetAbilityActivateRange_Result' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_ShouldCheckAbilitySightRange_Result) == 0x000058, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_ShouldCheckAbilitySightRange_Result' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_IsEvade_Result) == 0x000059, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_IsEvade_Result' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_GetActorSimpleCollisionHalfHeight_ReturnValue_1) == 0x00005C, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_GetActorSimpleCollisionHalfHeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000078, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_LineTraceSingle_OutHit) == 0x000090, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_LineTraceSingle_ReturnValue) == 0x000178, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Not_PreBool_ReturnValue) == 0x000179, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Vector_Distance_ReturnValue) == 0x000180, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000188, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, Temp_object_Variable_1) == 0x000190, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001A0, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001A8, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_MakeVector_ReturnValue) == 0x0001B0, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_MakeVector_ReturnValue_1) == 0x0001C8, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Add_VectorVector_ReturnValue) == 0x0001E0, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001F8, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_LineTraceSingle_OutHit_1) == 0x000210, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_LineTraceSingle_ReturnValue_1) == 0x0002F8, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002F9, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000300, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000308, "Member 'BTS_CheckInAbilityRange_C_ExecuteUbergraph_BTS_CheckInAbilityRange::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BTS_CheckInAbilityRange.BTS_CheckInAbilityRange_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_CheckInAbilityRange_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_CheckInAbilityRange_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_CheckInAbilityRange_C_ReceiveTickAI");
static_assert(sizeof(BTS_CheckInAbilityRange_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_CheckInAbilityRange_C_ReceiveTickAI");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_CheckInAbilityRange_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_CheckInAbilityRange_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_CheckInAbilityRange_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_CheckInAbilityRange_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

