#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_Flank

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTS_Flank.BTS_Flank_C.ExecuteUbergraph_BTS_Flank
// 0x00F0 (0x00F0 - 0x0000)
struct BTS_Flank_C_ExecuteUbergraph_BTS_Flank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster_1;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue_1;  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster_2;             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIC_Monster_Default_C*                 K2Node_DynamicCast_AsAIC_Monster_Default;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank) == 0x000008, "Wrong alignment on BTS_Flank_C_ExecuteUbergraph_BTS_Flank");
static_assert(sizeof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank) == 0x0000F0, "Wrong size on BTS_Flank_C_ExecuteUbergraph_BTS_Flank");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, EntryPoint) == 0x000000, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000008, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_Event_OwnerController_2) == 0x000010, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_Event_ControlledPawn_2) == 0x000018, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000028, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_Event_OwnerController_1) == 0x000050, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_Event_ControlledPawn_1) == 0x000058, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_AsBP_Tgf_Monster_1) == 0x000060, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_AsBP_Tgf_Monster_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_GetBlackboardValueAsActor_ReturnValue_1) == 0x000070, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_GetBlackboardValueAsActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000079, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_Event_OwnerController) == 0x000080, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_Event_ControlledPawn) == 0x000088, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_Event_DeltaSeconds) == 0x000090, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000094, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_AsBP_Tgf_Monster_2) == 0x000098, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_AsBP_Tgf_Monster_2' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_AsAIC_Monster_Default) == 0x0000A8, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_AsAIC_Monster_Default' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B8, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_Vector_Distance2D_ReturnValue) == 0x0000D0, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000D9, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000DA, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ExecuteUbergraph_BTS_Flank, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0000E8, "Member 'BTS_Flank_C_ExecuteUbergraph_BTS_Flank::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BTS_Flank.BTS_Flank_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_Flank_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_Flank_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_Flank_C_ReceiveActivationAI");
static_assert(sizeof(BTS_Flank_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_Flank_C_ReceiveActivationAI");
static_assert(offsetof(BTS_Flank_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_Flank_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_Flank_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_Flank.BTS_Flank_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_Flank_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_Flank_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on BTS_Flank_C_ReceiveDeactivationAI");
static_assert(sizeof(BTS_Flank_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on BTS_Flank_C_ReceiveDeactivationAI");
static_assert(offsetof(BTS_Flank_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'BTS_Flank_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'BTS_Flank_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function BTS_Flank.BTS_Flank_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTS_Flank_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_Flank_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTS_Flank_C_ReceiveTickAI");
static_assert(sizeof(BTS_Flank_C_ReceiveTickAI) == 0x000018, "Wrong size on BTS_Flank_C_ReceiveTickAI");
static_assert(offsetof(BTS_Flank_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTS_Flank_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTS_Flank_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_Flank_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTS_Flank_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

