#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_PatrolReachPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_PatrolReachPoint.BTT_PatrolReachPoint_C
// 0x0030 (0x00D8 - 0x00A8)
class UBTT_PatrolReachPoint_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   PatrolPointIndex;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PatrolPoint;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PatrolDirection;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PatrolCompleted;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_BTT_PatrolReachPoint_C;                      // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Direction;                                         // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_PatrolReachPoint(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_PatrolReachPoint_C">();
	}
	static class UBTT_PatrolReachPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_PatrolReachPoint_C>();
	}
};
static_assert(alignof(UBTT_PatrolReachPoint_C) == 0x000008, "Wrong alignment on UBTT_PatrolReachPoint_C");
static_assert(sizeof(UBTT_PatrolReachPoint_C) == 0x0000D8, "Wrong size on UBTT_PatrolReachPoint_C");
static_assert(offsetof(UBTT_PatrolReachPoint_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_PatrolReachPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_PatrolReachPoint_C, PatrolPointIndex) == 0x0000B0, "Member 'UBTT_PatrolReachPoint_C::PatrolPointIndex' has a wrong offset!");
static_assert(offsetof(UBTT_PatrolReachPoint_C, PatrolPoint) == 0x0000B8, "Member 'UBTT_PatrolReachPoint_C::PatrolPoint' has a wrong offset!");
static_assert(offsetof(UBTT_PatrolReachPoint_C, PatrolDirection) == 0x0000C0, "Member 'UBTT_PatrolReachPoint_C::PatrolDirection' has a wrong offset!");
static_assert(offsetof(UBTT_PatrolReachPoint_C, PatrolCompleted) == 0x0000C8, "Member 'UBTT_PatrolReachPoint_C::PatrolCompleted' has a wrong offset!");
static_assert(offsetof(UBTT_PatrolReachPoint_C, Index_BTT_PatrolReachPoint_C) == 0x0000D0, "Member 'UBTT_PatrolReachPoint_C::Index_BTT_PatrolReachPoint_C' has a wrong offset!");
static_assert(offsetof(UBTT_PatrolReachPoint_C, Direction) == 0x0000D4, "Member 'UBTT_PatrolReachPoint_C::Direction' has a wrong offset!");

}

