#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_CheckRetreatOnDistance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_CheckRetreatOnDistance.BTT_CheckRetreatOnDistance_C.ExecuteUbergraph_BTT_CheckRetreatOnDistance
// 0x0078 (0x0078 - 0x0000)
struct BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickRetreat_Result;                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PickRetreat_Index;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance) == 0x000008, "Wrong alignment on BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance");
static_assert(sizeof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance) == 0x000078, "Wrong size on BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, EntryPoint) == 0x000000, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000030, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_PickRetreat_Result) == 0x000039, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_PickRetreat_Result' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_PickRetreat_Index) == 0x00003C, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_PickRetreat_Index' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000040, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_Vector_Distance_ReturnValue) == 0x000068, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000071, "Member 'BTT_CheckRetreatOnDistance_C_ExecuteUbergraph_BTT_CheckRetreatOnDistance::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BTT_CheckRetreatOnDistance.BTT_CheckRetreatOnDistance_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_CheckRetreatOnDistance_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

