#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AbilityEnd

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BTT_AbilityEnd.BTT_AbilityEnd_C.ExecuteUbergraph_BTT_AbilityEnd
// 0x0148 (0x0148 - 0x0000)
struct BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetBlackboardValueAsClass_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsGameplay_Ability;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       CallFunc_GetClassDefaultObject_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0080(0x00B0)()
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd) == 0x000008, "Wrong alignment on BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd");
static_assert(sizeof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd) == 0x000148, "Wrong size on BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, EntryPoint) == 0x000000, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000008, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, K2Node_Event_OwnerController) == 0x000028, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, K2Node_Event_ControlledPawn) == 0x000030, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000038, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000041, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000042, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_GetBlackboardValueAsClass_ReturnValue) == 0x000058, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_GetBlackboardValueAsClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000060, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, K2Node_ClassDynamicCast_AsGameplay_Ability) == 0x000068, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::K2Node_ClassDynamicCast_AsGameplay_Ability' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, K2Node_ClassDynamicCast_bSuccess) == 0x000070, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_GetClassDefaultObject_ReturnValue) == 0x000078, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_GetClassDefaultObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, K2Node_MakeStruct_GameplayEventData) == 0x000080, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_GetTimeSeconds_ReturnValue) == 0x000130, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000138, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd, CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast) == 0x000140, "Member 'BTT_AbilityEnd_C_ExecuteUbergraph_BTT_AbilityEnd::CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast' has a wrong offset!");

// Function BTT_AbilityEnd.BTT_AbilityEnd_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_AbilityEnd_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AbilityEnd_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_AbilityEnd_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_AbilityEnd_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_AbilityEnd_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_AbilityEnd_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_AbilityEnd_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_AbilityEnd_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_AbilityEnd_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

