#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetWanderOnce

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_SetWanderOnce.BTT_SetWanderOnce_C.ExecuteUbergraph_BTT_SetWanderOnce
// 0x0018 (0x0018 - 0x0000)
struct BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce) == 0x000008, "Wrong alignment on BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce");
static_assert(sizeof(BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce) == 0x000018, "Wrong size on BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce");
static_assert(offsetof(BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce, EntryPoint) == 0x000000, "Member 'BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_SetWanderOnce_C_ExecuteUbergraph_BTT_SetWanderOnce::K2Node_Event_ControlledPawn' has a wrong offset!");

// Function BTT_SetWanderOnce.BTT_SetWanderOnce_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_SetWanderOnce_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetWanderOnce_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_SetWanderOnce_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_SetWanderOnce_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_SetWanderOnce_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_SetWanderOnce_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_SetWanderOnce_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetWanderOnce_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_SetWanderOnce_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

