#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetAbilityAngleRange

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_SetAbilityAngleRange.BTT_SetAbilityAngleRange_C.ExecuteUbergraph_BTT_SetAbilityAngleRange
// 0x0040 (0x0040 - 0x0000)
struct BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetBlackboardValueAsClass_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsTgf_Gameplay_Ability;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfGameplayAbility*                    CallFunc_GetClassDefaultObject_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange) == 0x000008, "Wrong alignment on BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange");
static_assert(sizeof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange) == 0x000040, "Wrong size on BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, EntryPoint) == 0x000000, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, CallFunc_GetBlackboardValueAsClass_ReturnValue) == 0x000018, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::CallFunc_GetBlackboardValueAsClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, K2Node_ClassDynamicCast_AsTgf_Gameplay_Ability) == 0x000020, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::K2Node_ClassDynamicCast_AsTgf_Gameplay_Ability' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, CallFunc_GetClassDefaultObject_ReturnValue) == 0x000030, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::CallFunc_GetClassDefaultObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BTT_SetAbilityAngleRange_C_ExecuteUbergraph_BTT_SetAbilityAngleRange::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTT_SetAbilityAngleRange.BTT_SetAbilityAngleRange_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_SetAbilityAngleRange_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetAbilityAngleRange_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_SetAbilityAngleRange_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_SetAbilityAngleRange_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_SetAbilityAngleRange_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_SetAbilityAngleRange_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_SetAbilityAngleRange_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_SetAbilityAngleRange_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

