#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_PatrolReachPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_PatrolReachPoint.BTT_PatrolReachPoint_C.ExecuteUbergraph_BTT_PatrolReachPoint
// 0x0098 (0x0098 - 0x0000)
struct BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTaskExecuting_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_2;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValueAsInt_ReturnValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValueAsInt_ReturnValue_1;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PatrolPoint_C*                      CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PatrolPoint_C*                      CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint) == 0x000008, "Wrong alignment on BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint");
static_assert(sizeof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint) == 0x000098, "Wrong size on BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, EntryPoint) == 0x000000, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_IsTaskExecuting_ReturnValue) == 0x000004, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_IsTaskExecuting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000018, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_GetBlackboard_ReturnValue) == 0x000028, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, K2Node_SwitchEnum_CmpSuccess) == 0x000034, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_GetBlackboard_ReturnValue_1) == 0x000038, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_GetBlackboard_ReturnValue_2) == 0x000040, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_GetBlackboard_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_GetValueAsInt_ReturnValue) == 0x000048, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_GetValueAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_GetValueAsInt_ReturnValue_1) == 0x00004C, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_GetValueAsInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000054, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Multiply_IntInt_ReturnValue) == 0x000058, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_BooleanOR_ReturnValue) == 0x00005D, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Array_Get_Item) == 0x000068, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000090, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint, CallFunc_Delay_Duration_ImplicitCast) == 0x000094, "Member 'BTT_PatrolReachPoint_C_ExecuteUbergraph_BTT_PatrolReachPoint::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BTT_PatrolReachPoint.BTT_PatrolReachPoint_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_PatrolReachPoint_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_PatrolReachPoint_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_PatrolReachPoint_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_PatrolReachPoint_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_PatrolReachPoint_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_PatrolReachPoint_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_PatrolReachPoint_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_PatrolReachPoint_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_PatrolReachPoint_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

