#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetAbilityAngleRange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_SetAbilityAngleRange.BTT_SetAbilityAngleRange_C
// 0x0058 (0x0100 - 0x00A8)
class UBTT_SetAbilityAngleRange_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Ability;                                           // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 AbilityAngleRange;                                 // 0x00D8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_SetAbilityAngleRange(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_SetAbilityAngleRange_C">();
	}
	static class UBTT_SetAbilityAngleRange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_SetAbilityAngleRange_C>();
	}
};
static_assert(alignof(UBTT_SetAbilityAngleRange_C) == 0x000008, "Wrong alignment on UBTT_SetAbilityAngleRange_C");
static_assert(sizeof(UBTT_SetAbilityAngleRange_C) == 0x000100, "Wrong size on UBTT_SetAbilityAngleRange_C");
static_assert(offsetof(UBTT_SetAbilityAngleRange_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_SetAbilityAngleRange_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_SetAbilityAngleRange_C, Ability) == 0x0000B0, "Member 'UBTT_SetAbilityAngleRange_C::Ability' has a wrong offset!");
static_assert(offsetof(UBTT_SetAbilityAngleRange_C, AbilityAngleRange) == 0x0000D8, "Member 'UBTT_SetAbilityAngleRange_C::AbilityAngleRange' has a wrong offset!");

}

