#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FindRetreatLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_FindRetreatLocation.BTT_FindRetreatLocation_C
// 0x0080 (0x0128 - 0x00A8)
class UBTT_FindRetreatLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetAgainst;                                     // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 RetreatIndex;                                      // 0x00D8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 RetreatLocation;                                   // 0x0100(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_FindRetreatLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_FindRetreatLocation_C">();
	}
	static class UBTT_FindRetreatLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_FindRetreatLocation_C>();
	}
};
static_assert(alignof(UBTT_FindRetreatLocation_C) == 0x000008, "Wrong alignment on UBTT_FindRetreatLocation_C");
static_assert(sizeof(UBTT_FindRetreatLocation_C) == 0x000128, "Wrong size on UBTT_FindRetreatLocation_C");
static_assert(offsetof(UBTT_FindRetreatLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_FindRetreatLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_FindRetreatLocation_C, TargetAgainst) == 0x0000B0, "Member 'UBTT_FindRetreatLocation_C::TargetAgainst' has a wrong offset!");
static_assert(offsetof(UBTT_FindRetreatLocation_C, RetreatIndex) == 0x0000D8, "Member 'UBTT_FindRetreatLocation_C::RetreatIndex' has a wrong offset!");
static_assert(offsetof(UBTT_FindRetreatLocation_C, RetreatLocation) == 0x000100, "Member 'UBTT_FindRetreatLocation_C::RetreatLocation' has a wrong offset!");

}

