#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FleeReachPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_FleeReachPoint.BTT_FleeReachPoint_C
// 0x0088 (0x0130 - 0x00A8)
class UBTT_FleeReachPoint_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 FleePointIndex;                                    // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FleePoint;                                         // 0x00D8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FleeCompleted;                                     // 0x0100(0x0028)(Edit, BlueprintVisible)
	int32                                         Index_BTT_FleeReachPoint_C;                        // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_FleeReachPoint(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_FleeReachPoint_C">();
	}
	static class UBTT_FleeReachPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_FleeReachPoint_C>();
	}
};
static_assert(alignof(UBTT_FleeReachPoint_C) == 0x000008, "Wrong alignment on UBTT_FleeReachPoint_C");
static_assert(sizeof(UBTT_FleeReachPoint_C) == 0x000130, "Wrong size on UBTT_FleeReachPoint_C");
static_assert(offsetof(UBTT_FleeReachPoint_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_FleeReachPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_FleeReachPoint_C, FleePointIndex) == 0x0000B0, "Member 'UBTT_FleeReachPoint_C::FleePointIndex' has a wrong offset!");
static_assert(offsetof(UBTT_FleeReachPoint_C, FleePoint) == 0x0000D8, "Member 'UBTT_FleeReachPoint_C::FleePoint' has a wrong offset!");
static_assert(offsetof(UBTT_FleeReachPoint_C, FleeCompleted) == 0x000100, "Member 'UBTT_FleeReachPoint_C::FleeCompleted' has a wrong offset!");
static_assert(offsetof(UBTT_FleeReachPoint_C, Index_BTT_FleeReachPoint_C) == 0x000128, "Member 'UBTT_FleeReachPoint_C::Index_BTT_FleeReachPoint_C' has a wrong offset!");

}

