#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FindRetreatLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_FindRetreatLocation.BTT_FindRetreatLocation_C.ExecuteUbergraph_BTT_FindRetreatLocation
// 0x0168 (0x0168 - 0x0000)
struct BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomLocationInNavigableRadius_RandomLocation; // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomLocationInNavigableRadius_ReturnValue; // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetRandomLocationInNavigableRadius_Radius_ImplicitCast; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast;    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation) == 0x000008, "Wrong alignment on BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation");
static_assert(sizeof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation) == 0x000168, "Wrong size on BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, EntryPoint) == 0x000000, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_GetBlackboardValueAsInt_ReturnValue) == 0x000004, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_GetBlackboardValueAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000008, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, K2Node_Event_OwnerController) == 0x000010, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000028, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_RandomFloatInRange_ReturnValue) == 0x000050, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000078, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000098, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_BreakVector_X) == 0x0000B0, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_BreakVector_Y) == 0x0000B8, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_BreakVector_Z) == 0x0000C0, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_MakeVector_ReturnValue_1) == 0x0000C8, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_Normal_ReturnValue) == 0x0000E0, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000F8, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000110, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_K2_GetRandomLocationInNavigableRadius_RandomLocation) == 0x000140, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_K2_GetRandomLocationInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_K2_GetRandomLocationInNavigableRadius_ReturnValue) == 0x000158, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_K2_GetRandomLocationInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_K2_GetRandomLocationInNavigableRadius_Radius_ImplicitCast) == 0x00015C, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_K2_GetRandomLocationInNavigableRadius_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation, CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast) == 0x000160, "Member 'BTT_FindRetreatLocation_C_ExecuteUbergraph_BTT_FindRetreatLocation::CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast' has a wrong offset!");

// Function BTT_FindRetreatLocation.BTT_FindRetreatLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_FindRetreatLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_FindRetreatLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_FindRetreatLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_FindRetreatLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_FindRetreatLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_FindRetreatLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_FindRetreatLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_FindRetreatLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_FindRetreatLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

