#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_CheckChaseResult

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_CheckChaseResult.BTT_CheckChaseResult_C.ExecuteUbergraph_BTT_CheckChaseResult
// 0x0060 (0x0060 - 0x0000)
struct BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Monster_C*                      K2Node_DynamicCast_AsBP_Tgf_Monster;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEvadable_Result;                        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNavigationPath*                        CallFunc_FindPathToActorSynchronously_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartial_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult) == 0x000008, "Wrong alignment on BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult");
static_assert(sizeof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult) == 0x000060, "Wrong size on BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, EntryPoint) == 0x000000, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000008, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, K2Node_Event_OwnerController) == 0x000010, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, K2Node_DynamicCast_AsBP_Tgf_Monster) == 0x000028, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::K2Node_DynamicCast_AsBP_Tgf_Monster' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_IsEvadable_Result) == 0x000031, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_IsEvadable_Result' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_FindPathToActorSynchronously_ReturnValue) == 0x000050, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_FindPathToActorSynchronously_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_IsPartial_ReturnValue) == 0x00005A, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_IsPartial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_Not_PreBool_ReturnValue) == 0x00005B, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult, CallFunc_BooleanAND_ReturnValue) == 0x00005C, "Member 'BTT_CheckChaseResult_C_ExecuteUbergraph_BTT_CheckChaseResult::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BTT_CheckChaseResult.BTT_CheckChaseResult_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_CheckChaseResult_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_CheckChaseResult_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_CheckChaseResult_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_CheckChaseResult_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_CheckChaseResult_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_CheckChaseResult_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_CheckChaseResult_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_CheckChaseResult_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_CheckChaseResult_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

