#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ClearInterrupts

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ClearInterrupts.BTT_ClearInterrupts_C.ExecuteUbergraph_BTT_ClearInterrupts
// 0x0028 (0x0028 - 0x0000)
struct BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIC_Monster_Default_C*                 K2Node_DynamicCast_AsAIC_Monster_Default;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts) == 0x000008, "Wrong alignment on BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts");
static_assert(sizeof(BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts) == 0x000028, "Wrong size on BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts");
static_assert(offsetof(BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts, EntryPoint) == 0x000000, "Member 'BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts, K2Node_DynamicCast_AsAIC_Monster_Default) == 0x000018, "Member 'BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts::K2Node_DynamicCast_AsAIC_Monster_Default' has a wrong offset!");
static_assert(offsetof(BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_ClearInterrupts_C_ExecuteUbergraph_BTT_ClearInterrupts::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTT_ClearInterrupts.BTT_ClearInterrupts_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ClearInterrupts_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ClearInterrupts_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ClearInterrupts_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ClearInterrupts_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ClearInterrupts_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ClearInterrupts_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_ClearInterrupts_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ClearInterrupts_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ClearInterrupts_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

