#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AbilityInterval

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_AbilityInterval.BTT_AbilityInterval_C
// 0x0058 (0x0100 - 0x00A8)
class UBTT_AbilityInterval_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 AbilityTarget;                                     // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 AbilityActivateTime;                               // 0x00D8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_AbilityInterval(int32 EntryPoint);
	void IsInAbilityInterval(bool* Result);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_AbilityInterval_C">();
	}
	static class UBTT_AbilityInterval_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AbilityInterval_C>();
	}
};
static_assert(alignof(UBTT_AbilityInterval_C) == 0x000008, "Wrong alignment on UBTT_AbilityInterval_C");
static_assert(sizeof(UBTT_AbilityInterval_C) == 0x000100, "Wrong size on UBTT_AbilityInterval_C");
static_assert(offsetof(UBTT_AbilityInterval_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_AbilityInterval_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_AbilityInterval_C, AbilityTarget) == 0x0000B0, "Member 'UBTT_AbilityInterval_C::AbilityTarget' has a wrong offset!");
static_assert(offsetof(UBTT_AbilityInterval_C, AbilityActivateTime) == 0x0000D8, "Member 'UBTT_AbilityInterval_C::AbilityActivateTime' has a wrong offset!");

}

