#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FindWanderLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_FindWanderLocation.BTT_FindWanderLocation_C
// 0x0058 (0x0100 - 0x00A8)
class UBTT_FindWanderLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 WanderBaseLocation;                                // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 WanderLocation;                                    // 0x00D8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_FindWanderLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_FindWanderLocation_C">();
	}
	static class UBTT_FindWanderLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_FindWanderLocation_C>();
	}
};
static_assert(alignof(UBTT_FindWanderLocation_C) == 0x000008, "Wrong alignment on UBTT_FindWanderLocation_C");
static_assert(sizeof(UBTT_FindWanderLocation_C) == 0x000100, "Wrong size on UBTT_FindWanderLocation_C");
static_assert(offsetof(UBTT_FindWanderLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_FindWanderLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_FindWanderLocation_C, WanderBaseLocation) == 0x0000B0, "Member 'UBTT_FindWanderLocation_C::WanderBaseLocation' has a wrong offset!");
static_assert(offsetof(UBTT_FindWanderLocation_C, WanderLocation) == 0x0000D8, "Member 'UBTT_FindWanderLocation_C::WanderLocation' has a wrong offset!");

}

