#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ActivateAbilityNextTime

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_ActivateAbilityNextTime.BTT_ActivateAbilityNextTime_C.ExecuteUbergraph_BTT_ActivateAbilityNextTime
// 0x0040 (0x0040 - 0x0000)
struct BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetBlackboardValueAsClass_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsGameplay_Ability;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIC_Monster_Default_C*                 K2Node_DynamicCast_AsAIC_Monster_Default;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTaskExecuting_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime) == 0x000008, "Wrong alignment on BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime");
static_assert(sizeof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime) == 0x000040, "Wrong size on BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, EntryPoint) == 0x000000, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, CallFunc_GetBlackboardValueAsClass_ReturnValue) == 0x000008, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::CallFunc_GetBlackboardValueAsClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, K2Node_Event_OwnerController) == 0x000010, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, K2Node_Event_ControlledPawn) == 0x000018, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, K2Node_ClassDynamicCast_AsGameplay_Ability) == 0x000020, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::K2Node_ClassDynamicCast_AsGameplay_Ability' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, K2Node_ClassDynamicCast_bSuccess) == 0x000028, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, K2Node_DynamicCast_AsAIC_Monster_Default) == 0x000030, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::K2Node_DynamicCast_AsAIC_Monster_Default' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, CallFunc_IsTaskExecuting_ReturnValue) == 0x000039, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::CallFunc_IsTaskExecuting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime, CallFunc_Delay_Duration_ImplicitCast) == 0x00003C, "Member 'BTT_ActivateAbilityNextTime_C_ExecuteUbergraph_BTT_ActivateAbilityNextTime::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BTT_ActivateAbilityNextTime.BTT_ActivateAbilityNextTime_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_ActivateAbilityNextTime_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

