#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_ActivateAbilityNextTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_ActivateAbilityNextTime.BTT_ActivateAbilityNextTime_C
// 0x0038 (0x00E0 - 0x00A8)
class UBTT_ActivateAbilityNextTime_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Ability;                                           // 0x00B0(0x0028)(Edit, BlueprintVisible)
	double                                        Delay;                                             // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_ActivateAbilityNextTime(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_ActivateAbilityNextTime_C">();
	}
	static class UBTT_ActivateAbilityNextTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_ActivateAbilityNextTime_C>();
	}
};
static_assert(alignof(UBTT_ActivateAbilityNextTime_C) == 0x000008, "Wrong alignment on UBTT_ActivateAbilityNextTime_C");
static_assert(sizeof(UBTT_ActivateAbilityNextTime_C) == 0x0000E0, "Wrong size on UBTT_ActivateAbilityNextTime_C");
static_assert(offsetof(UBTT_ActivateAbilityNextTime_C, UberGraphFrame) == 0x0000A8, "Member 'UBTT_ActivateAbilityNextTime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_ActivateAbilityNextTime_C, Ability) == 0x0000B0, "Member 'UBTT_ActivateAbilityNextTime_C::Ability' has a wrong offset!");
static_assert(offsetof(UBTT_ActivateAbilityNextTime_C, Delay) == 0x0000D8, "Member 'UBTT_ActivateAbilityNextTime_C::Delay' has a wrong offset!");

}

