#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonLoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonLoadingScreen.LoadingScreenManager.GetDebugReasonForShowingOrHidingLoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen) == 0x000008, "Wrong alignment on LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen");
static_assert(sizeof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen) == 0x000010, "Wrong size on LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen");
static_assert(offsetof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen, ReturnValue) == 0x000000, "Member 'LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen::ReturnValue' has a wrong offset!");

// Function CommonLoadingScreen.LoadingProcessTask.CreateLoadingScreenProcessTask
// 0x0020 (0x0020 - 0x0000)
struct LoadingProcessTask_CreateLoadingScreenProcessTask final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowLoadingScreenReason;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULoadingProcessTask*                    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingProcessTask_CreateLoadingScreenProcessTask) == 0x000008, "Wrong alignment on LoadingProcessTask_CreateLoadingScreenProcessTask");
static_assert(sizeof(LoadingProcessTask_CreateLoadingScreenProcessTask) == 0x000020, "Wrong size on LoadingProcessTask_CreateLoadingScreenProcessTask");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, WorldContextObject) == 0x000000, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, ShowLoadingScreenReason) == 0x000008, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::ShowLoadingScreenReason' has a wrong offset!");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, ReturnValue) == 0x000018, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::ReturnValue' has a wrong offset!");

// Function CommonLoadingScreen.LoadingProcessTask.SetShowLoadingScreenReason
// 0x0010 (0x0010 - 0x0000)
struct LoadingProcessTask_SetShowLoadingScreenReason final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingProcessTask_SetShowLoadingScreenReason) == 0x000008, "Wrong alignment on LoadingProcessTask_SetShowLoadingScreenReason");
static_assert(sizeof(LoadingProcessTask_SetShowLoadingScreenReason) == 0x000010, "Wrong size on LoadingProcessTask_SetShowLoadingScreenReason");
static_assert(offsetof(LoadingProcessTask_SetShowLoadingScreenReason, InReason) == 0x000000, "Member 'LoadingProcessTask_SetShowLoadingScreenReason::InReason' has a wrong offset!");

}

