#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleVariablesEditorRuntime

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct ConsoleVariablesEditorRuntime.ConsoleVariablesEditorAssetSaveData
// 0x0028 (0x0028 - 0x0000)
struct FConsoleVariablesEditorAssetSaveData final
{
public:
	class FString                                 CommandName;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandValueAsString;                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECheckBoxState                                CheckedState;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConsoleVariablesEditorAssetSaveData) == 0x000008, "Wrong alignment on FConsoleVariablesEditorAssetSaveData");
static_assert(sizeof(FConsoleVariablesEditorAssetSaveData) == 0x000028, "Wrong size on FConsoleVariablesEditorAssetSaveData");
static_assert(offsetof(FConsoleVariablesEditorAssetSaveData, CommandName) == 0x000000, "Member 'FConsoleVariablesEditorAssetSaveData::CommandName' has a wrong offset!");
static_assert(offsetof(FConsoleVariablesEditorAssetSaveData, CommandValueAsString) == 0x000010, "Member 'FConsoleVariablesEditorAssetSaveData::CommandValueAsString' has a wrong offset!");
static_assert(offsetof(FConsoleVariablesEditorAssetSaveData, CheckedState) == 0x000020, "Member 'FConsoleVariablesEditorAssetSaveData::CheckedState' has a wrong offset!");

}

