#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig_Panther_FootPlant

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "Engine_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass ControlRig_Panther_FootPlant.ControlRig_Panther_FootPlant_C
// 0x0058 (0x05B8 - 0x0560)
class UControlRig_Panther_FootPlant_C final : public UControlRig
{
public:
	double                                        StartOffset;                                       // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndOffset;                                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDrawDebug;                                        // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0579(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A[0x6];                                      // 0x057A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RootInitOffset;                                    // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FrontFootInitOffset_r;                             // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FrontFootInitOffset_l;                             // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BehindFootInitOffset_r;                            // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BehindFootInitOffset_l;                            // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BoneTurnInitOffset;                                // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIKFlag;                                           // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocalSpace;                                       // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControlRig_Panther_FootPlant_C">();
	}
	static class UControlRig_Panther_FootPlant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRig_Panther_FootPlant_C>();
	}
};
static_assert(alignof(UControlRig_Panther_FootPlant_C) == 0x000008, "Wrong alignment on UControlRig_Panther_FootPlant_C");
static_assert(sizeof(UControlRig_Panther_FootPlant_C) == 0x0005B8, "Wrong size on UControlRig_Panther_FootPlant_C");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, StartOffset) == 0x000560, "Member 'UControlRig_Panther_FootPlant_C::StartOffset' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, EndOffset) == 0x000568, "Member 'UControlRig_Panther_FootPlant_C::EndOffset' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, Radius) == 0x000570, "Member 'UControlRig_Panther_FootPlant_C::Radius' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, bDrawDebug) == 0x000578, "Member 'UControlRig_Panther_FootPlant_C::bDrawDebug' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, bEnable) == 0x000579, "Member 'UControlRig_Panther_FootPlant_C::bEnable' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, RootInitOffset) == 0x000580, "Member 'UControlRig_Panther_FootPlant_C::RootInitOffset' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, FrontFootInitOffset_r) == 0x000588, "Member 'UControlRig_Panther_FootPlant_C::FrontFootInitOffset_r' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, FrontFootInitOffset_l) == 0x000590, "Member 'UControlRig_Panther_FootPlant_C::FrontFootInitOffset_l' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, BehindFootInitOffset_r) == 0x000598, "Member 'UControlRig_Panther_FootPlant_C::BehindFootInitOffset_r' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, BehindFootInitOffset_l) == 0x0005A0, "Member 'UControlRig_Panther_FootPlant_C::BehindFootInitOffset_l' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, BoneTurnInitOffset) == 0x0005A8, "Member 'UControlRig_Panther_FootPlant_C::BoneTurnInitOffset' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, bIKFlag) == 0x0005B0, "Member 'UControlRig_Panther_FootPlant_C::bIKFlag' has a wrong offset!");
static_assert(offsetof(UControlRig_Panther_FootPlant_C, bLocalSpace) == 0x0005B1, "Member 'UControlRig_Panther_FootPlant_C::bLocalSpace' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass ControlRig_Panther_FootPlant.RigVMMemory_Literal
// 0x0798 (0x07C0 - 0x0028)
class ControlRig_Panther_FootPlant::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FVector                                LocalVariableDefault__GetSloping_StartLocation__Const; // 0x0028(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GetSloping_EndLocation__Const; // 0x0040(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GetSloping_StartNormal__Const; // 0x0058(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GetSloping_EndNormal__Const; // 0x0070(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GetSloping_OriginStart__Const; // 0x0088(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GetSloping_OriginEnd__Const; // 0x00A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         LocalVariableDefault__GetSloping_bStartTrace__Const : 1; // 0x00B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_B8_1 : 7;                                   // 0x00B8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         LocalVariableDefault__GetSloping_bEndTrace__Const : 1; // 0x00B9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalVariableDefault__TraceBone_GroundLocation__Const; // 0x00C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__TraceBone_GroundNormal__Const; // 0x00D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__TraceBone_TraceStart__Const; // 0x00F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__TraceBone_TraceEnd__Const;   // 0x0108(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__TraceBone_TraceStartOffset__Const; // 0x0120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__TraceBone_TraceEndOffset__Const; // 0x0138(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        LocalVariableDefault__TraceBone_Distance__Const;   // 0x0150(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalVariableDefault__TraceBone_Rotation__Const;   // 0x0160(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__InternalModifyHeight_TargetHeight__Const; // 0x01C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_Item__Const; // 0x01D8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_Space__Const; // 0x01E4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_bInitial__Const : 1; // 0x01E5(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___InitBoneOffset_GetInitHeightDelta_1_GetTransform_Item__Const; // 0x01E8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___InitBoneOffset_GetInitHeightDelta_2_GetTransform_Item__Const; // 0x01F4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___InitBoneOffset_GetInitHeightDelta_1_1_GetTransform_Item__Const; // 0x0200(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___InitBoneOffset_GetInitHeightDelta_1_2_GetTransform_Item__Const; // 0x020C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___InitBoneOffset_GetInitHeightDelta_1_2_1_GetTransform_Item__Const; // 0x0218(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x0228(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	float                                         RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_ScreenDuration__Const; // 0x0238(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_ScreenColor__Const; // 0x023C(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x0250(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_2_Prefix__Const; // 0x0260(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_2_Prefix__Const; // 0x0270(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_1_Prefix__Const; // 0x0280(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_1_1_Prefix__Const; // 0x0290(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	uint8                                         RigVMModel___VariableNode_14_Value__Const : 1;     // 0x02A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_1_Item__Const;   // 0x02A4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetTransform_1_Weight__Const; // 0x02B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Slope_Rotate_Vector_Vector__Const;    // 0x02B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Slope_Rotate_Vector_1_Vector__Const;  // 0x02D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Slope_GetSloping_1_Add_B__Const;      // 0x02E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Slope_GetSloping_1_Add_1_B__Const;    // 0x0300(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               RigVMModel___Slope_GetSloping_1_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0318(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Slope_GetSloping_1_Add_2_B__Const;    // 0x0320(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariable__RigVMModel___Slope_GetSloping_1_VariableNode_22_Value__Const; // 0x0338(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Color__Const; // 0x0350(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Thickness__Const; // 0x0360(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Space__Const; // 0x0364(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_WorldOffset__Const; // 0x0370(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Mode__Const; // 0x03D0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Scale__Const; // 0x03D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Space__Const; // 0x03D8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RigVMModel___Slope_GetSloping_1_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x03E8(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___Slope_GetSloping_1_AimBoneMath_Primary__Const; // 0x03F8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                RigVMModel___Slope_GetSloping_1_AimBoneMath_Secondary__Const; // 0x0440(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___Slope_GetSloping_1_AimBoneMath_DebugSettings__Const; // 0x0490(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	class FString                                 RigVMModel___Slope_TanAngle_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x0500(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___Slope_TanAngle_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x0510(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	double                                        RigVMModel___Slope_TanAngle_Greater_B__Const;      // 0x0520(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Slope_TanAngle_If_True__Const;        // 0x0528(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Slope_TanAngle_If_False__Const;       // 0x0530(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Slope_RigUnit_SetRotation_Item__Const; // 0x0538(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RigVMModel___Slope_Cast_1_Value__Const;            // 0x0548(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         RigVMModel___Slope_SpringInterp_Strength__Const;   // 0x0560(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Slope_SpringInterp_Force__Const;      // 0x0564(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Slope_RigUnit_GetControlRotator_Control__Const; // 0x0568(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 RigVMModel___Slope_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x0570(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_Item__Const;     // 0x0580(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Mode__Const; // 0x058C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Color__Const; // 0x0590(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Thickness__Const; // 0x05A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Scale__Const; // 0x05A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_0_Rotate_Vector_1_Vector__Const; // 0x05A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_0_Rotate_Vector_Vector__Const; // 0x05C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 RigVMModel___TraceBone_0_DISPATCH_RigDispatch_Print_1_1_Prefix__Const; // 0x05D8(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	class FString                                 RigVMModel___TraceBone_0_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x05E8(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	float                                         RigVMModel___TraceBone_0_DebugTransformMutableItemSpace_Thickness__Const; // 0x05F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___TraceBone_0_1_Rotate_Vector_1_Vector__Const; // 0x0600(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_0_1_Rotate_Vector_Vector__Const; // 0x0618(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_0_2_Rotate_Vector_1_Vector__Const; // 0x0630(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_0_2_Rotate_Vector_Vector__Const; // 0x0648(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_0_1_1_Rotate_Vector_1_Vector__Const; // 0x0660(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_0_1_1_Rotate_Vector_Vector__Const; // 0x0678(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_1_Rotate_Vector_1_Vector__Const; // 0x0690(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TraceBone_1_Rotate_Vector_Vector__Const; // 0x06A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___TraceBone_1_DebugLineItemSpace_Color__Const; // 0x06C0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 RigVMModel___DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x06D0(0x0010)(Edit, ZeroConstructor, EditConst, NonTransactional, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___InternalModifyHeight_RigUnit_SetTransform_1_Item__Const; // 0x06E0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EC[0x4];                                      // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___InternalModifyHeight_RigUnit_SetTransform_Value__Const; // 0x06F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___InternalModifyHeight_DebugTransformMutableItemSpace_1_Color__Const; // 0x0750(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_Set_Transform_1_Item__Const; // 0x0760(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_Set_Transform_2_Item__Const; // 0x076C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_1_Set_Transform_1_Item__Const; // 0x0778(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_1_Set_Transform_2_Item__Const; // 0x0784(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_2_Set_Transform_1_Item__Const; // 0x0790(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_2_Set_Transform_2_Item__Const; // 0x079C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_1_1_Set_Transform_1_Item__Const; // 0x07A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetIKBoneTransform_1_1_Set_Transform_2_Item__Const; // 0x07B4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass ControlRig_Panther_FootPlant.RigVMMemory_Literal", true>();
	}
	static class ControlRig_Panther_FootPlant::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<ControlRig_Panther_FootPlant::URigVMMemory_Literal>();
	}
};
static_assert(alignof(ControlRig_Panther_FootPlant::URigVMMemory_Literal) == 0x000010, "Wrong alignment on ControlRig_Panther_FootPlant::URigVMMemory_Literal");
static_assert(sizeof(ControlRig_Panther_FootPlant::URigVMMemory_Literal) == 0x0007C0, "Wrong size on ControlRig_Panther_FootPlant::URigVMMemory_Literal");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__GetSloping_StartLocation__Const) == 0x000028, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__GetSloping_StartLocation__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__GetSloping_EndLocation__Const) == 0x000040, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__GetSloping_EndLocation__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__GetSloping_StartNormal__Const) == 0x000058, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__GetSloping_StartNormal__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__GetSloping_EndNormal__Const) == 0x000070, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__GetSloping_EndNormal__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__GetSloping_OriginStart__Const) == 0x000088, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__GetSloping_OriginStart__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__GetSloping_OriginEnd__Const) == 0x0000A0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__GetSloping_OriginEnd__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_GroundLocation__Const) == 0x0000C0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_GroundLocation__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_GroundNormal__Const) == 0x0000D8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_GroundNormal__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_TraceStart__Const) == 0x0000F0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_TraceStart__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_TraceEnd__Const) == 0x000108, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_TraceEnd__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_TraceStartOffset__Const) == 0x000120, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_TraceStartOffset__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_TraceEndOffset__Const) == 0x000138, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_TraceEndOffset__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_Distance__Const) == 0x000150, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_Distance__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__TraceBone_Rotation__Const) == 0x000160, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__TraceBone_Rotation__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariableDefault__InternalModifyHeight_TargetHeight__Const) == 0x0001C0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariableDefault__InternalModifyHeight_TargetHeight__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_Item__Const) == 0x0001D8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_Space__Const) == 0x0001E4, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_GetInitHeightDelta_1_GetTransform_Item__Const) == 0x0001E8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_GetInitHeightDelta_1_GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_GetInitHeightDelta_2_GetTransform_Item__Const) == 0x0001F4, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_GetInitHeightDelta_2_GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_GetInitHeightDelta_1_1_GetTransform_Item__Const) == 0x000200, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_GetInitHeightDelta_1_1_GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_GetInitHeightDelta_1_2_GetTransform_Item__Const) == 0x00020C, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_GetInitHeightDelta_1_2_GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_GetInitHeightDelta_1_2_1_GetTransform_Item__Const) == 0x000218, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_GetInitHeightDelta_1_2_1_GetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_Prefix__Const) == 0x000228, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_ScreenDuration__Const) == 0x000238, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_ScreenDuration__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_ScreenColor__Const) == 0x00023C, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_ScreenColor__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_Prefix__Const) == 0x000250, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_2_Prefix__Const) == 0x000260, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_2_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_2_Prefix__Const) == 0x000270, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_2_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_1_Prefix__Const) == 0x000280, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_1_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_1_1_Prefix__Const) == 0x000290, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InitBoneOffset_DISPATCH_RigDispatch_Print_2_1_1_1_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_1_Item__Const) == 0x0002A4, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_1_Weight__Const) == 0x0002B0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_1_Weight__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_Rotate_Vector_Vector__Const) == 0x0002B8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_Rotate_Vector_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_Rotate_Vector_1_Vector__Const) == 0x0002D0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_Rotate_Vector_1_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_Add_B__Const) == 0x0002E8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_Add_B__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_Add_1_B__Const) == 0x000300, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_Add_1_B__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_SphereTraceByTraceChannel_TraceChannel__Const) == 0x000318, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_SphereTraceByTraceChannel_TraceChannel__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_Add_2_B__Const) == 0x000320, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_Add_2_B__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, LocalVariable__RigVMModel___Slope_GetSloping_1_VariableNode_22_Value__Const) == 0x000338, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::LocalVariable__RigVMModel___Slope_GetSloping_1_VariableNode_22_Value__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Color__Const) == 0x000350, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Thickness__Const) == 0x000360, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Thickness__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Space__Const) == 0x000364, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_Space__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_WorldOffset__Const) == 0x000370, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DebugLineItemSpace_WorldOffset__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Mode__Const) == 0x0003D0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Mode__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Scale__Const) == 0x0003D4, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Scale__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Space__Const) == 0x0003D8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DebugTransformMutableItemSpace_Space__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_DISPATCH_RigDispatch_Print_Prefix__Const) == 0x0003E8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_DISPATCH_RigDispatch_Print_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_AimBoneMath_Primary__Const) == 0x0003F8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_AimBoneMath_Primary__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_AimBoneMath_Secondary__Const) == 0x000440, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_AimBoneMath_Secondary__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_GetSloping_1_AimBoneMath_DebugSettings__Const) == 0x000490, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_GetSloping_1_AimBoneMath_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_TanAngle_DISPATCH_RigDispatch_Print_Prefix__Const) == 0x000500, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_TanAngle_DISPATCH_RigDispatch_Print_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_TanAngle_DISPATCH_RigDispatch_Print_1_Prefix__Const) == 0x000510, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_TanAngle_DISPATCH_RigDispatch_Print_1_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_TanAngle_Greater_B__Const) == 0x000520, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_TanAngle_Greater_B__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_TanAngle_If_True__Const) == 0x000528, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_TanAngle_If_True__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_TanAngle_If_False__Const) == 0x000530, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_TanAngle_If_False__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_RigUnit_SetRotation_Item__Const) == 0x000538, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_RigUnit_SetRotation_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_Cast_1_Value__Const) == 0x000548, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_Cast_1_Value__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_SpringInterp_Strength__Const) == 0x000560, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_SpringInterp_Strength__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_SpringInterp_Force__Const) == 0x000564, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_SpringInterp_Force__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_RigUnit_GetControlRotator_Control__Const) == 0x000568, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_RigUnit_GetControlRotator_Control__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___Slope_DISPATCH_RigDispatch_Print_Prefix__Const) == 0x000570, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___Slope_DISPATCH_RigDispatch_Print_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Item__Const) == 0x000580, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Mode__Const) == 0x00058C, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Mode__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Color__Const) == 0x000590, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Thickness__Const) == 0x0005A0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Thickness__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Scale__Const) == 0x0005A4, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___DrawAxis_DebugTransformMutableItemSpace_Scale__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_Rotate_Vector_1_Vector__Const) == 0x0005A8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_Rotate_Vector_1_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_Rotate_Vector_Vector__Const) == 0x0005C0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_Rotate_Vector_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_DISPATCH_RigDispatch_Print_1_1_Prefix__Const) == 0x0005D8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_DISPATCH_RigDispatch_Print_1_1_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_DISPATCH_RigDispatch_Print_Prefix__Const) == 0x0005E8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_DISPATCH_RigDispatch_Print_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_DebugTransformMutableItemSpace_Thickness__Const) == 0x0005F8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_DebugTransformMutableItemSpace_Thickness__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_1_Rotate_Vector_1_Vector__Const) == 0x000600, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_1_Rotate_Vector_1_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_1_Rotate_Vector_Vector__Const) == 0x000618, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_1_Rotate_Vector_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_2_Rotate_Vector_1_Vector__Const) == 0x000630, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_2_Rotate_Vector_1_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_2_Rotate_Vector_Vector__Const) == 0x000648, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_2_Rotate_Vector_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_1_1_Rotate_Vector_1_Vector__Const) == 0x000660, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_1_1_Rotate_Vector_1_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_0_1_1_Rotate_Vector_Vector__Const) == 0x000678, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_0_1_1_Rotate_Vector_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_1_Rotate_Vector_1_Vector__Const) == 0x000690, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_1_Rotate_Vector_1_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_1_Rotate_Vector_Vector__Const) == 0x0006A8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_1_Rotate_Vector_Vector__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___TraceBone_1_DebugLineItemSpace_Color__Const) == 0x0006C0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___TraceBone_1_DebugLineItemSpace_Color__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___DISPATCH_RigDispatch_Print_4_Prefix__Const) == 0x0006D0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___DISPATCH_RigDispatch_Print_4_Prefix__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InternalModifyHeight_RigUnit_SetTransform_1_Item__Const) == 0x0006E0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InternalModifyHeight_RigUnit_SetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InternalModifyHeight_RigUnit_SetTransform_Value__Const) == 0x0006F0, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InternalModifyHeight_RigUnit_SetTransform_Value__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___InternalModifyHeight_DebugTransformMutableItemSpace_1_Color__Const) == 0x000750, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___InternalModifyHeight_DebugTransformMutableItemSpace_1_Color__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_Set_Transform_1_Item__Const) == 0x000760, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_Set_Transform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_Set_Transform_2_Item__Const) == 0x00076C, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_Set_Transform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_1_Set_Transform_1_Item__Const) == 0x000778, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_1_Set_Transform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_1_Set_Transform_2_Item__Const) == 0x000784, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_1_Set_Transform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_2_Set_Transform_1_Item__Const) == 0x000790, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_2_Set_Transform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_2_Set_Transform_2_Item__Const) == 0x00079C, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_2_Set_Transform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_1_1_Set_Transform_1_Item__Const) == 0x0007A8, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_1_1_Set_Transform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_Panther_FootPlant::URigVMMemory_Literal, RigVMModel___SetIKBoneTransform_1_1_Set_Transform_2_Item__Const) == 0x0007B4, "Member 'ControlRig_Panther_FootPlant::URigVMMemory_Literal::RigVMModel___SetIKBoneTransform_1_1_Set_Transform_2_Item__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass ControlRig_Panther_FootPlant.RigVMMemory_Work
// 0x5368 (0x5390 - 0x0028)
class ControlRig_Panther_FootPlant::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0028(0x0038)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_Transform; // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___InitBoneOffset_GetInitHeightDelta_GetTransform_CachedIndex; // 0x00C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___InitBoneOffset_GetInitHeightDelta_1_GetTransform_Transform; // 0x00D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___InitBoneOffset_GetInitHeightDelta_1_GetTransform_CachedIndex; // 0x0130(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___InitBoneOffset_GetInitHeightDelta_2_GetTransform_Transform; // 0x0140(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___InitBoneOffset_GetInitHeightDelta_2_GetTransform_CachedIndex; // 0x01A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___InitBoneOffset_GetInitHeightDelta_1_1_GetTransform_Transform; // 0x01B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___InitBoneOffset_GetInitHeightDelta_1_1_GetTransform_CachedIndex; // 0x0210(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___InitBoneOffset_GetInitHeightDelta_1_2_GetTransform_Transform; // 0x0220(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
