#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig_HideHelpBone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass ControlRig_HideHelpBone.ControlRig_HideHelpBone_C
// 0x0008 (0x0568 - 0x0560)
class UControlRig_HideHelpBone_C final : public UControlRig
{
public:
	double                                        ScaleValue;                                        // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControlRig_HideHelpBone_C">();
	}
	static class UControlRig_HideHelpBone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRig_HideHelpBone_C>();
	}
};
static_assert(alignof(UControlRig_HideHelpBone_C) == 0x000008, "Wrong alignment on UControlRig_HideHelpBone_C");
static_assert(sizeof(UControlRig_HideHelpBone_C) == 0x000568, "Wrong size on UControlRig_HideHelpBone_C");
static_assert(offsetof(UControlRig_HideHelpBone_C, ScaleValue) == 0x000560, "Member 'UControlRig_HideHelpBone_C::ScaleValue' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_Literal
// 0x00E8 (0x0110 - 0x0028)
class ControlRig_HideHelpBone::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_Set_Transform_Item__Const; // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigVMModel___ModifyBoneScale_Set_Transform_Space__Const; // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___ModifyBoneScale_Set_Transform_bInitial__Const : 1; // 0x0035(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___ModifyBoneScale_Set_Transform_Value__Const; // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigVMModel___ModifyBoneScale_GetTransform_Space__Const; // 0x00A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___ModifyBoneScale_Set_Transform_Weight__Const; // 0x00A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___ModifyBoneScale_Set_Transform_bPropagateToChildren__Const : 1; // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_1_Set_Transform_Item__Const; // 0x00AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_2_Set_Transform_Item__Const; // 0x00B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_3_Set_Transform_Item__Const; // 0x00C4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_4_Set_Transform_Item__Const; // 0x00D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_5_Set_Transform_Item__Const; // 0x00DC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___GetCurveValue_Curve__Const;           // 0x00E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Greater_B__Const;                     // 0x00F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_4_1_Set_Transform_Item__Const; // 0x00F8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_5_1_Set_Transform_Item__Const; // 0x0104(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_Literal", true>();
	}
	static class ControlRig_HideHelpBone::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<ControlRig_HideHelpBone::URigVMMemory_Literal>();
	}
};
static_assert(alignof(ControlRig_HideHelpBone::URigVMMemory_Literal) == 0x000010, "Wrong alignment on ControlRig_HideHelpBone::URigVMMemory_Literal");
static_assert(sizeof(ControlRig_HideHelpBone::URigVMMemory_Literal) == 0x000110, "Wrong size on ControlRig_HideHelpBone::URigVMMemory_Literal");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_Set_Transform_Item__Const) == 0x000028, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_Set_Transform_Space__Const) == 0x000034, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_Set_Transform_Space__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_Set_Transform_Value__Const) == 0x000040, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_Set_Transform_Value__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_GetTransform_Space__Const) == 0x0000A0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_GetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_Set_Transform_Weight__Const) == 0x0000A4, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_Set_Transform_Weight__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_1_Set_Transform_Item__Const) == 0x0000AC, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_1_Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_2_Set_Transform_Item__Const) == 0x0000B8, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_2_Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_3_Set_Transform_Item__Const) == 0x0000C4, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_3_Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_4_Set_Transform_Item__Const) == 0x0000D0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_4_Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_5_Set_Transform_Item__Const) == 0x0000DC, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_5_Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___GetCurveValue_Curve__Const) == 0x0000E8, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___GetCurveValue_Curve__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___Greater_B__Const) == 0x0000F0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___Greater_B__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_4_1_Set_Transform_Item__Const) == 0x0000F8, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_4_1_Set_Transform_Item__Const' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Literal, RigVMModel___ModifyBoneScale_5_1_Set_Transform_Item__Const) == 0x000104, "Member 'ControlRig_HideHelpBone::URigVMMemory_Literal::RigVMModel___ModifyBoneScale_5_1_Set_Transform_Item__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_Work
// 0x0768 (0x0790 - 0x0028)
class ControlRig_HideHelpBone::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0028(0x0038)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_GetTransform_Transform; // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_GetTransform_CachedIndex; // 0x00C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_Set_Transform_Value__IO; // 0x00D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_Set_Transform_CachedIndex; // 0x0130(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_1_GetTransform_Transform; // 0x0140(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_1_GetTransform_CachedIndex; // 0x01A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_1_Set_Transform_Value__IO; // 0x01B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_1_Set_Transform_CachedIndex; // 0x0210(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_2_GetTransform_Transform; // 0x0220(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_2_GetTransform_CachedIndex; // 0x0280(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_2_Set_Transform_Value__IO; // 0x0290(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_2_Set_Transform_CachedIndex; // 0x02F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_3_GetTransform_Transform; // 0x0300(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_3_GetTransform_CachedIndex; // 0x0360(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_3_Set_Transform_Value__IO; // 0x0370(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_3_Set_Transform_CachedIndex; // 0x03D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_4_GetTransform_Transform; // 0x03E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_4_GetTransform_CachedIndex; // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_4_Set_Transform_Value__IO; // 0x0450(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_4_Set_Transform_CachedIndex; // 0x04B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_5_GetTransform_Transform; // 0x04C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_5_GetTransform_CachedIndex; // 0x0520(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_5_Set_Transform_Value__IO; // 0x0530(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_5_Set_Transform_CachedIndex; // 0x0590(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         RigVMModel___MathBoolAnd_Result : 1;               // 0x05A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_A0_1 : 7;                                   // 0x00A0(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         RigVMModel___GetCurveValue_Valid : 1;              // 0x05A1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5A2[0x2];                                      // 0x05A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_Value;                  // 0x05A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_CachedCurveIndex;       // 0x05A8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         RigVMModel___Greater_Result : 1;                   // 0x05B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Greater_A;                            // 0x05C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___ModifyBoneScale_4_1_GetTransform_Transform; // 0x05D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_4_1_GetTransform_CachedIndex; // 0x0630(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_4_1_Set_Transform_Value__IO; // 0x0640(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_4_1_Set_Transform_CachedIndex; // 0x06A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_5_1_GetTransform_Transform; // 0x06B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_5_1_GetTransform_CachedIndex; // 0x0710(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_5_1_Set_Transform_Value__IO; // 0x0720(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_5_1_Set_Transform_CachedIndex; // 0x0780(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_Work", true>();
	}
	static class ControlRig_HideHelpBone::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<ControlRig_HideHelpBone::URigVMMemory_Work>();
	}
};
static_assert(alignof(ControlRig_HideHelpBone::URigVMMemory_Work) == 0x000010, "Wrong alignment on ControlRig_HideHelpBone::URigVMMemory_Work");
static_assert(sizeof(ControlRig_HideHelpBone::URigVMMemory_Work) == 0x000790, "Wrong size on ControlRig_HideHelpBone::URigVMMemory_Work");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, ExecuteContext_) == 0x000028, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::ExecuteContext_' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_GetTransform_Transform) == 0x000060, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_GetTransform_CachedIndex) == 0x0000C0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_Set_Transform_Value__IO) == 0x0000D0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_Set_Transform_CachedIndex) == 0x000130, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_1_GetTransform_Transform) == 0x000140, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_1_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_1_GetTransform_CachedIndex) == 0x0001A0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_1_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_1_Set_Transform_Value__IO) == 0x0001B0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_1_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_1_Set_Transform_CachedIndex) == 0x000210, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_1_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_2_GetTransform_Transform) == 0x000220, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_2_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_2_GetTransform_CachedIndex) == 0x000280, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_2_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_2_Set_Transform_Value__IO) == 0x000290, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_2_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_2_Set_Transform_CachedIndex) == 0x0002F0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_2_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_3_GetTransform_Transform) == 0x000300, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_3_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_3_GetTransform_CachedIndex) == 0x000360, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_3_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_3_Set_Transform_Value__IO) == 0x000370, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_3_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_3_Set_Transform_CachedIndex) == 0x0003D0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_3_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_GetTransform_Transform) == 0x0003E0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_GetTransform_CachedIndex) == 0x000440, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_Set_Transform_Value__IO) == 0x000450, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_Set_Transform_CachedIndex) == 0x0004B0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_GetTransform_Transform) == 0x0004C0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_GetTransform_CachedIndex) == 0x000520, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_Set_Transform_Value__IO) == 0x000530, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_Set_Transform_CachedIndex) == 0x000590, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___GetCurveValue_Value) == 0x0005A4, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___GetCurveValue_Value' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___GetCurveValue_CachedCurveIndex) == 0x0005A8, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___GetCurveValue_CachedCurveIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___Greater_A) == 0x0005C0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___Greater_A' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_1_GetTransform_Transform) == 0x0005D0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_1_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_1_GetTransform_CachedIndex) == 0x000630, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_1_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_1_Set_Transform_Value__IO) == 0x000640, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_1_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_4_1_Set_Transform_CachedIndex) == 0x0006A0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_4_1_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_1_GetTransform_Transform) == 0x0006B0, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_1_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_1_GetTransform_CachedIndex) == 0x000710, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_1_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_1_Set_Transform_Value__IO) == 0x000720, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_1_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory_Work, RigVMModel___ModifyBoneScale_5_1_Set_Transform_CachedIndex) == 0x000780, "Member 'ControlRig_HideHelpBone::URigVMMemory_Work::RigVMModel___ModifyBoneScale_5_1_Set_Transform_CachedIndex' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_å\
// 0x0578 (0x05A0 - 0x0028)
class ControlRig_HideHelpBone::URigVMMemory___ final : public URigVMMemoryStorage
{
public:
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0028(0x0038)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_GetTransform_Transform; // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_GetTransform_CachedIndex; // 0x00C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_Set_Transform_Value__IO; // 0x00D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_Set_Transform_CachedIndex; // 0x0130(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_1_GetTransform_Transform; // 0x0140(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_1_GetTransform_CachedIndex; // 0x01A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_1_Set_Transform_Value__IO; // 0x01B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_1_Set_Transform_CachedIndex; // 0x0210(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_2_GetTransform_Transform; // 0x0220(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_2_GetTransform_CachedIndex; // 0x0280(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_2_Set_Transform_Value__IO; // 0x0290(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_2_Set_Transform_CachedIndex; // 0x02F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_3_GetTransform_Transform; // 0x0300(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_3_GetTransform_CachedIndex; // 0x0360(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_3_Set_Transform_Value__IO; // 0x0370(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_3_Set_Transform_CachedIndex; // 0x03D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_4_GetTransform_Transform; // 0x03E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_4_GetTransform_CachedIndex; // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_4_Set_Transform_Value__IO; // 0x0450(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_4_Set_Transform_CachedIndex; // 0x04B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_5_GetTransform_Transform; // 0x04C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_5_GetTransform_CachedIndex; // 0x0520(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___ModifyBoneScale_5_Set_Transform_Value__IO; // 0x0530(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___ModifyBoneScale_5_Set_Transform_CachedIndex; // 0x0590(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_å\", true>();
	}
	static class ControlRig_HideHelpBone::URigVMMemory___* GetDefaultObj()
	{
		return GetDefaultObjImpl<ControlRig_HideHelpBone::URigVMMemory___>();
	}
};
static_assert(alignof(ControlRig_HideHelpBone::URigVMMemory___) == 0x000010, "Wrong alignment on ControlRig_HideHelpBone::URigVMMemory___");
static_assert(sizeof(ControlRig_HideHelpBone::URigVMMemory___) == 0x0005A0, "Wrong size on ControlRig_HideHelpBone::URigVMMemory___");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, ExecuteContext_) == 0x000028, "Member 'ControlRig_HideHelpBone::URigVMMemory___::ExecuteContext_' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_GetTransform_Transform) == 0x000060, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_GetTransform_CachedIndex) == 0x0000C0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_Set_Transform_Value__IO) == 0x0000D0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_Set_Transform_CachedIndex) == 0x000130, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_1_GetTransform_Transform) == 0x000140, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_1_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_1_GetTransform_CachedIndex) == 0x0001A0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_1_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_1_Set_Transform_Value__IO) == 0x0001B0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_1_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_1_Set_Transform_CachedIndex) == 0x000210, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_1_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_2_GetTransform_Transform) == 0x000220, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_2_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_2_GetTransform_CachedIndex) == 0x000280, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_2_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_2_Set_Transform_Value__IO) == 0x000290, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_2_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_2_Set_Transform_CachedIndex) == 0x0002F0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_2_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_3_GetTransform_Transform) == 0x000300, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_3_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_3_GetTransform_CachedIndex) == 0x000360, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_3_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_3_Set_Transform_Value__IO) == 0x000370, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_3_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_3_Set_Transform_CachedIndex) == 0x0003D0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_3_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_4_GetTransform_Transform) == 0x0003E0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_4_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_4_GetTransform_CachedIndex) == 0x000440, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_4_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_4_Set_Transform_Value__IO) == 0x000450, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_4_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_4_Set_Transform_CachedIndex) == 0x0004B0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_4_Set_Transform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_5_GetTransform_Transform) == 0x0004C0, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_5_GetTransform_Transform' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_5_GetTransform_CachedIndex) == 0x000520, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_5_GetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_5_Set_Transform_Value__IO) == 0x000530, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_5_Set_Transform_Value__IO' has a wrong offset!");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory___, RigVMModel___ModifyBoneScale_5_Set_Transform_CachedIndex) == 0x000590, "Member 'ControlRig_HideHelpBone::URigVMMemory___::RigVMModel___ModifyBoneScale_5_Set_Transform_CachedIndex' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_‡W
// 0x00C8 (0x00F0 - 0x0028)
class ControlRig_HideHelpBone::URigVMMemory__W final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_Set_Transform_Item__Const; // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigVMModel___ModifyBoneScale_Set_Transform_Space__Const; // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___ModifyBoneScale_Set_Transform_bInitial__Const : 1; // 0x0035(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___ModifyBoneScale_Set_Transform_Value__Const; // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigVMModel___ModifyBoneScale_GetTransform_Space__Const; // 0x00A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___ModifyBoneScale_Set_Transform_Weight__Const; // 0x00A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigVMModel___ModifyBoneScale_Set_Transform_bPropagateToChildren__Const : 1; // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_1_Set_Transform_Item__Const; // 0x00AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_2_Set_Transform_Item__Const; // 0x00B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_3_Set_Transform_Item__Const; // 0x00C4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_4_Set_Transform_Item__Const; // 0x00D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ModifyBoneScale_5_Set_Transform_Item__Const; // 0x00DC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass ControlRig_HideHelpBone.RigVMMemory_‡W", true>();
	}
	static class ControlRig_HideHelpBone::URigVMMemory__W* GetDefaultObj()
	{
		return GetDefaultObjImpl<ControlRig_HideHelpBone::URigVMMemory__W>();
	}
};
static_assert(alignof(ControlRig_HideHelpBone::URigVMMemory__W) == 0x000010, "Wrong alignment on ControlRig_HideHelpBone::URigVMMemory__W");
static_assert(sizeof(ControlRig_HideHelpBone::URigVMMemory__W) == 0x0000F0, "Wrong size on ControlRig_HideHelpBone::URigVMMemory__W");
static_assert(offsetof(ControlRig_HideHelpBone::URigVMMemory__W, RigVMModel___ModifyBoneScale_Set_Transform_Item__Const) == 0x000028, "Member 'ControlRig_HideHelpBone::URigVMMemory__W::RigVMModel___ModifyBoneScale_Set_Transform_Item__Const' has a wrong offset!");
