#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_Jump

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UIExtension_structs.hpp"


namespace SDK::Params
{

// Function GA_Hero_Jump.GA_Hero_Jump_C.ExecuteUbergraph_GA_Hero_Jump
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIExtensionSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     CallFunc_K2_RegisterExtensionAsWidgetForContext_ReturnValue; // 0x0080(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAIControlled_Result;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump) == 0x000008, "Wrong alignment on GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump");
static_assert(sizeof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump) == 0x0000A0, "Wrong size on GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, EntryPoint) == 0x000000, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, K2Node_CustomEvent_TimeHeld) == 0x000024, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, Temp_real_Variable) == 0x000028, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_WaitInputRelease_ReturnValue) == 0x000030, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_StartAbilityState_ReturnValue) == 0x000060, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000070, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_IsValidClass_ReturnValue) == 0x000078, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_K2_RegisterExtensionAsWidgetForContext_ReturnValue) == 0x000080, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_K2_RegisterExtensionAsWidgetForContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump, CallFunc_IsAIControlled_Result) == 0x000098, "Member 'GA_Hero_Jump_C_ExecuteUbergraph_GA_Hero_Jump::CallFunc_IsAIControlled_Result' has a wrong offset!");

// Function GA_Hero_Jump.GA_Hero_Jump_C.IsAIControlled
// 0x0020 (0x0020 - 0x0000)
struct GA_Hero_Jump_C_IsAIControlled final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_Jump_C_IsAIControlled) == 0x000008, "Wrong alignment on GA_Hero_Jump_C_IsAIControlled");
static_assert(sizeof(GA_Hero_Jump_C_IsAIControlled) == 0x000020, "Wrong size on GA_Hero_Jump_C_IsAIControlled");
static_assert(offsetof(GA_Hero_Jump_C_IsAIControlled, Result) == 0x000000, "Member 'GA_Hero_Jump_C_IsAIControlled::Result' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_IsAIControlled, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Hero_Jump_C_IsAIControlled::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_IsAIControlled, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'GA_Hero_Jump_C_IsAIControlled::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_IsAIControlled, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Hero_Jump_C_IsAIControlled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_IsAIControlled, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'GA_Hero_Jump_C_IsAIControlled::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_IsAIControlled, CallFunc_ObjectIsA_ReturnValue) == 0x00001A, "Member 'GA_Hero_Jump_C_IsAIControlled::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");

// Function GA_Hero_Jump.GA_Hero_Jump_C.OnRelease_EDFEACC049280120720047851B878951
// 0x0004 (0x0004 - 0x0000)
struct GA_Hero_Jump_C_OnRelease_EDFEACC049280120720047851B878951 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_Jump_C_OnRelease_EDFEACC049280120720047851B878951) == 0x000004, "Wrong alignment on GA_Hero_Jump_C_OnRelease_EDFEACC049280120720047851B878951");
static_assert(sizeof(GA_Hero_Jump_C_OnRelease_EDFEACC049280120720047851B878951) == 0x000004, "Wrong size on GA_Hero_Jump_C_OnRelease_EDFEACC049280120720047851B878951");
static_assert(offsetof(GA_Hero_Jump_C_OnRelease_EDFEACC049280120720047851B878951, TimeHeld) == 0x000000, "Member 'GA_Hero_Jump_C_OnRelease_EDFEACC049280120720047851B878951::TimeHeld' has a wrong offset!");

// Function GA_Hero_Jump.GA_Hero_Jump_C.K2_CanActivateAbility
// 0x0098 (0x0098 - 0x0000)
struct GA_Hero_Jump_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_Jump_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Hero_Jump_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Hero_Jump_C_K2_CanActivateAbility) == 0x000098, "Wrong size on GA_Hero_Jump_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000080, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000090, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Jump_C_K2_CanActivateAbility, CallFunc_Not_PreBool_ReturnValue) == 0x000092, "Member 'GA_Hero_Jump_C_K2_CanActivateAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

