#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_Jump

#include "Basic.hpp"

#include "LyraGame_classes.hpp"
#include "UIExtension_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Hero_Jump.GA_Hero_Jump_C
// 0x0030 (0x06B8 - 0x0688)
class UGA_Hero_Jump_C final : public ULyraGameplayAbility_Jump
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FUIExtensionHandle                     WidgetExtensionHandle;                             // 0x0690(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           WidgetExtensionPointTag;                           // 0x06A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Hero_Jump(int32 EntryPoint);
	void IsAIControlled(bool* Result);
	void K2_ActivateAbility();
	void K2_OnAbilityAdded();
	void K2_OnAbilityRemoved();
	void OnRelease_EDFEACC049280120720047851B878951(float TimeHeld);
	void OnStateEnded_F066D7A34FAFC3D7A6BC11B96F6F6569();
	void OnStateInterrupted_F066D7A34FAFC3D7A6BC11B96F6F6569();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Hero_Jump_C">();
	}
	static class UGA_Hero_Jump_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Hero_Jump_C>();
	}
};
static_assert(alignof(UGA_Hero_Jump_C) == 0x000008, "Wrong alignment on UGA_Hero_Jump_C");
static_assert(sizeof(UGA_Hero_Jump_C) == 0x0006B8, "Wrong size on UGA_Hero_Jump_C");
static_assert(offsetof(UGA_Hero_Jump_C, UberGraphFrame) == 0x000688, "Member 'UGA_Hero_Jump_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Jump_C, WidgetExtensionHandle) == 0x000690, "Member 'UGA_Hero_Jump_C::WidgetExtensionHandle' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Jump_C, WidgetExtensionPointTag) == 0x0006A8, "Member 'UGA_Hero_Jump_C::WidgetExtensionPointTag' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Jump_C, WidgetClass) == 0x0006B0, "Member 'UGA_Hero_Jump_C::WidgetClass' has a wrong offset!");

}

