#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TalentRogue_ExitStealth

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TalentRogue_ExitStealth.GA_TalentRogue_ExitStealth_C
// 0x0020 (0x09C0 - 0x09A0)
class UGA_TalentRogue_ExitStealth_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 AddAtk;                                            // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Remove_Delay;                                      // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_TalentRogue_ExitStealth(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TalentRogue_ExitStealth_C">();
	}
	static class UGA_TalentRogue_ExitStealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TalentRogue_ExitStealth_C>();
	}
};
static_assert(alignof(UGA_TalentRogue_ExitStealth_C) == 0x000010, "Wrong alignment on UGA_TalentRogue_ExitStealth_C");
static_assert(sizeof(UGA_TalentRogue_ExitStealth_C) == 0x0009C0, "Wrong size on UGA_TalentRogue_ExitStealth_C");
static_assert(offsetof(UGA_TalentRogue_ExitStealth_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TalentRogue_ExitStealth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TalentRogue_ExitStealth_C, AddAtk) == 0x0009A8, "Member 'UGA_TalentRogue_ExitStealth_C::AddAtk' has a wrong offset!");
static_assert(offsetof(UGA_TalentRogue_ExitStealth_C, Remove_Delay) == 0x0009B0, "Member 'UGA_TalentRogue_ExitStealth_C::Remove_Delay' has a wrong offset!");

}

