#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_TalentLich_WhenCausingIceDamage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_TalentLich_WhenCausingIceDamage.GA_TGF_TalentLich_WhenCausingIceDamage_C.EventReceived_08F3FA65471F2100F92FC581D3B40888
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_TalentLich_WhenCausingIceDamage_C_EventReceived_08F3FA65471F2100F92FC581D3B40888 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_TalentLich_WhenCausingIceDamage_C_EventReceived_08F3FA65471F2100F92FC581D3B40888) == 0x000008, "Wrong alignment on GA_TGF_TalentLich_WhenCausingIceDamage_C_EventReceived_08F3FA65471F2100F92FC581D3B40888");
static_assert(sizeof(GA_TGF_TalentLich_WhenCausingIceDamage_C_EventReceived_08F3FA65471F2100F92FC581D3B40888) == 0x0000B0, "Wrong size on GA_TGF_TalentLich_WhenCausingIceDamage_C_EventReceived_08F3FA65471F2100F92FC581D3B40888");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_EventReceived_08F3FA65471F2100F92FC581D3B40888, Payload) == 0x000000, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_EventReceived_08F3FA65471F2100F92FC581D3B40888::Payload' has a wrong offset!");

// Function GA_TGF_TalentLich_WhenCausingIceDamage.GA_TGF_TalentLich_WhenCausingIceDamage_C.ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage
// 0x01F0 (0x01F0 - 0x0000)
struct GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0008(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsByClass_ReturnValue;   // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_ParseDamageBattleElementTagFromEnum_ReturnValue; // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x01C8(0x0020)()
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage) == 0x000008, "Wrong alignment on GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage");
static_assert(sizeof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage) == 0x0001F0, "Wrong size on GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, EntryPoint) == 0x000000, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, K2Node_CustomEvent_Payload) == 0x000008, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, Temp_struct_Variable) == 0x0000C8, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000178, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000188, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000190, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_CompareTeams_TeamIdA) == 0x000198, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_CompareTeams_TeamIdB) == 0x00019C, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_CompareTeams_ReturnValue) == 0x0001A0, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0001A8, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, K2Node_SwitchEnum_CmpSuccess) == 0x0001B0, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_IsValid_ReturnValue_1) == 0x0001B1, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_RemoveActiveEffectsByClass_ReturnValue) == 0x0001B4, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_RemoveActiveEffectsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_ParseDamageBattleElementTagFromEnum_ReturnValue) == 0x0001B8, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_ParseDamageBattleElementTagFromEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, K2Node_Event_bWasCancelled) == 0x0001C0, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0001C8, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage, CallFunc_HasAnyTags_ReturnValue) == 0x0001E8, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_ExecuteUbergraph_GA_TGF_TalentLich_WhenCausingIceDamage::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");

// Function GA_TGF_TalentLich_WhenCausingIceDamage.GA_TGF_TalentLich_WhenCausingIceDamage_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_TalentLich_WhenCausingIceDamage_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_TalentLich_WhenCausingIceDamage_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_TalentLich_WhenCausingIceDamage_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_TalentLich_WhenCausingIceDamage_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_TalentLich_WhenCausingIceDamage_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_TalentLich_WhenCausingIceDamage_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_TalentLich_WhenCausingIceDamage_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

