#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_HideAllGCN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_TGF_PassiveMove_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_HideAllGCN.GA_TGF_HideAllGCN_C
// 0x0020 (0x0DA0 - 0x0D80)
class UGA_TGF_HideAllGCN_C final : public UGA_TGF_PassiveMove_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_TGF_HideAllGCN_C;                // 0x0D80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UNiagaraComponent*>              HideParticles;                                     // 0x0D88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bIsHide;                                           // 0x0D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_TGF_HideAllGCN(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_HideAllGCN_C">();
	}
	static class UGA_TGF_HideAllGCN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_HideAllGCN_C>();
	}
};
static_assert(alignof(UGA_TGF_HideAllGCN_C) == 0x000010, "Wrong alignment on UGA_TGF_HideAllGCN_C");
static_assert(sizeof(UGA_TGF_HideAllGCN_C) == 0x000DA0, "Wrong size on UGA_TGF_HideAllGCN_C");
static_assert(offsetof(UGA_TGF_HideAllGCN_C, UberGraphFrame_GA_TGF_HideAllGCN_C) == 0x000D80, "Member 'UGA_TGF_HideAllGCN_C::UberGraphFrame_GA_TGF_HideAllGCN_C' has a wrong offset!");
static_assert(offsetof(UGA_TGF_HideAllGCN_C, HideParticles) == 0x000D88, "Member 'UGA_TGF_HideAllGCN_C::HideParticles' has a wrong offset!");
static_assert(offsetof(UGA_TGF_HideAllGCN_C, bIsHide) == 0x000D98, "Member 'UGA_TGF_HideAllGCN_C::bIsHide' has a wrong offset!");

}

