#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_DeathToQuit

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_DeathToQuit.GA_TGF_DeathToQuit_C.ExecuteUbergraph_GA_TGF_DeathToQuit
// 0x01D0 (0x01D0 - 0x0000)
struct GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_DoubleToInt64_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0018(0x00B0)(ConstParm)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraGameMode*                          K2Node_DynamicCast_AsLyra_Game_Mode;               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfMatchType                                 CallFunc_GetMatchType_ReturnValue;                 // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfNpcStateManagerComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfNpcState*                           CallFunc_GetCurrentState_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FReportRecord                          K2Node_MakeStruct_ReportRecord;                    // 0x0140(0x0090)()
};
static_assert(alignof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit) == 0x000008, "Wrong alignment on GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit");
static_assert(sizeof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit) == 0x0001D0, "Wrong size on GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, EntryPoint) == 0x000000, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_Conv_DoubleToInt64_ReturnValue) == 0x000010, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_Conv_DoubleToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, K2Node_Event_EventData) == 0x000018, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_IsStandalone_ReturnValue) == 0x0000C8, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetGameMode_ReturnValue) == 0x0000D0, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, K2Node_DynamicCast_AsLyra_Game_Mode) == 0x0000D8, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::K2Node_DynamicCast_AsLyra_Game_Mode' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetGameState_ReturnValue) == 0x0000E8, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetMatchType_ReturnValue) == 0x0000F0, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetMatchType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetDisplayName_ReturnValue) == 0x0000F8, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000108, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetComponentByClass_ReturnValue) == 0x000110, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetCurrentState_ReturnValue) == 0x000120, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetObjectClass_ReturnValue) == 0x000128, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, CallFunc_GetClassDisplayName_ReturnValue) == 0x000130, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit, K2Node_MakeStruct_ReportRecord) == 0x000140, "Member 'GA_TGF_DeathToQuit_C_ExecuteUbergraph_GA_TGF_DeathToQuit::K2Node_MakeStruct_ReportRecord' has a wrong offset!");

// Function GA_TGF_DeathToQuit.GA_TGF_DeathToQuit_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_DeathToQuit_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_DeathToQuit_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_DeathToQuit_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_DeathToQuit_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_DeathToQuit_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_DeathToQuit_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_DeathToQuit_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

