#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_InteractWithMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_InteractWithMap.GA_TGF_InteractWithMap_C
// 0x0060 (0x0A50 - 0x09F0)
class UGA_TGF_InteractWithMap_C : public UTgfGameplayAbility_Interact
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_MapInteractionComponent_C*          CachedMapInteractionComponent;                     // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Gameplay_Tags;                                     // 0x0A00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         AudioPlayingID;                                    // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A24[0x4];                                      // 0x0A24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bWeaponVisible;                                    // 0x0A30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfInterrupting;                                 // 0x0A31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A32[0x6];                                      // 0x0A32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   PressEvents;                                       // 0x0A38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ZeroInteractionTime;                               // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddWeaponTags();
	void EndMontage();
	void EventReceived_F6B4200B400FD5A548B047AC89BCCBAF(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_InteractWithMap(int32 EntryPoint);
	void GetMapInteractionComponent(class UBP_MapInteractionComponent_C** Component);
	void K2_ActivateAbility();
	bool K2_CheckValidFromInputTag(const struct FGameplayTag& InputTag);
	void K2_OnAbilityAdded();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_23E98B6448743E77D97E5198B01FE8A7(class FName NotifyName);
	void OnBlendOut_904267E44DDE12EFB5E300B31BA01992(class FName NotifyName);
	void OnCancelled_23E98B6448743E77D97E5198B01FE8A7(class FName NotifyName);
	void OnCancelled_904267E44DDE12EFB5E300B31BA01992(class FName NotifyName);
	void OnCompleted_23E98B6448743E77D97E5198B01FE8A7(class FName NotifyName);
	void OnCompleted_904267E44DDE12EFB5E300B31BA01992(class FName NotifyName);
	void OnFinishInteract();
	void OnInterrupted_23E98B6448743E77D97E5198B01FE8A7(class FName NotifyName);
	void OnInterrupted_904267E44DDE12EFB5E300B31BA01992(class FName NotifyName);
	void OnNotifyBegin_23E98B6448743E77D97E5198B01FE8A7(class FName NotifyName);
	void OnNotifyBegin_904267E44DDE12EFB5E300B31BA01992(class FName NotifyName);
	void OnNotifyEnd_23E98B6448743E77D97E5198B01FE8A7(class FName NotifyName);
	void OnNotifyEnd_904267E44DDE12EFB5E300B31BA01992(class FName NotifyName);
	void OnRelease_7F652B2046C0AAB8941A3FA9FE0173F1(float TimeHeld);
	void SetAudioSwitch(class AActor* Actor, const class FString& AttachName);
	void WaitForCancel();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_InteractWithMap_C">();
	}
	static class UGA_TGF_InteractWithMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_InteractWithMap_C>();
	}
};
static_assert(alignof(UGA_TGF_InteractWithMap_C) == 0x000010, "Wrong alignment on UGA_TGF_InteractWithMap_C");
static_assert(sizeof(UGA_TGF_InteractWithMap_C) == 0x000A50, "Wrong size on UGA_TGF_InteractWithMap_C");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, UberGraphFrame) == 0x0009F0, "Member 'UGA_TGF_InteractWithMap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, CachedMapInteractionComponent) == 0x0009F8, "Member 'UGA_TGF_InteractWithMap_C::CachedMapInteractionComponent' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, Gameplay_Tags) == 0x000A00, "Member 'UGA_TGF_InteractWithMap_C::Gameplay_Tags' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, AudioPlayingID) == 0x000A20, "Member 'UGA_TGF_InteractWithMap_C::AudioPlayingID' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, AudioEvent) == 0x000A28, "Member 'UGA_TGF_InteractWithMap_C::AudioEvent' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, bWeaponVisible) == 0x000A30, "Member 'UGA_TGF_InteractWithMap_C::bWeaponVisible' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, bSelfInterrupting) == 0x000A31, "Member 'UGA_TGF_InteractWithMap_C::bSelfInterrupting' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, PressEvents) == 0x000A38, "Member 'UGA_TGF_InteractWithMap_C::PressEvents' has a wrong offset!");
static_assert(offsetof(UGA_TGF_InteractWithMap_C, ZeroInteractionTime) == 0x000A48, "Member 'UGA_TGF_InteractWithMap_C::ZeroInteractionTime' has a wrong offset!");

}

