#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_CollectFireFromTorch

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_CollectFireFromTorch.GA_TGF_CollectFireFromTorch_C.ExecuteUbergraph_GA_TGF_CollectFireFromTorch
// 0x0118 (0x0118 - 0x0000)
struct GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0018(0x00B0)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraEquipmentInstance*                 CallFunc_GetCurrentWeaponInstances_OutRightWeapon; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraEquipmentInstance*                 CallFunc_GetCurrentWeaponInstances_OutLeftWeapon;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraInventoryItemInstance*             CallFunc_GetInventory_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class ULyraInventoryItemDefinition> CallFunc_GetItemDef_ReturnValue;                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FTgfWeaponSlot                         CallFunc_GetCurrentWeaponSlot_ReturnValue;         // 0x00F8(0x0018)(NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch) == 0x000008, "Wrong alignment on GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch");
static_assert(sizeof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch) == 0x000118, "Wrong size on GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, EntryPoint) == 0x000000, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, K2Node_Event_EventData) == 0x000018, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_GetCurrentWeaponInstances_OutRightWeapon) == 0x0000D0, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_GetCurrentWeaponInstances_OutRightWeapon' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_GetCurrentWeaponInstances_OutLeftWeapon) == 0x0000D8, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_GetCurrentWeaponInstances_OutLeftWeapon' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_IsValid_ReturnValue_1) == 0x0000E0, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_GetInventory_ReturnValue) == 0x0000E8, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_GetItemDef_ReturnValue) == 0x0000F0, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_GetItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_GetCurrentWeaponSlot_ReturnValue) == 0x0000F8, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_GetCurrentWeaponSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch, CallFunc_ClassIsChildOf_ReturnValue) == 0x000110, "Member 'GA_TGF_CollectFireFromTorch_C_ExecuteUbergraph_GA_TGF_CollectFireFromTorch::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");

// Function GA_TGF_CollectFireFromTorch.GA_TGF_CollectFireFromTorch_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_CollectFireFromTorch_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_CollectFireFromTorch_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_CollectFireFromTorch_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_CollectFireFromTorch_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_CollectFireFromTorch_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_CollectFireFromTorch_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_CollectFireFromTorch_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

