#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Rebirth_To_SpawnPoint_PVPMulti

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Rebirth_To_SpawnPoint_PVPMulti.GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C.ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti
// 0x0280 (0x0280 - 0x0000)
struct GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSpawnTransform_ReturnValue;            // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0130(0x00B0)()
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0230(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x0250(0x0020)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti) == 0x000010, "Wrong alignment on GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti");
static_assert(sizeof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti) == 0x000280, "Wrong size on GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, EntryPoint) == 0x000000, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, K2Node_Event_EventData) == 0x000008, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0000B8, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_GetSpawnTransform_ReturnValue) == 0x0000D0, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_GetSpawnTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, K2Node_MakeStruct_GameplayEventData) == 0x000130, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_BreakTransform_Location) == 0x0001E0, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_BreakTransform_Rotation) == 0x0001F8, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_BreakTransform_Scale) == 0x000210, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_K2_TeleportTo_ReturnValue) == 0x000228, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_IsDeadOrDying_ReturnValue) == 0x000229, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000230, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x000250, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000270, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint_PVPMulti::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_TGF_Rebirth_To_SpawnPoint_PVPMulti.GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_Rebirth_To_SpawnPoint_PVPMulti_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

