#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Killing_Player

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AttrBuffMap_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Killing_Player.GA_TGF_Killing_Player_C.ExecuteUbergraph_GA_TGF_Killing_Player
// 0x0180 (0x0180 - 0x0000)
struct GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacterWithAbilities*            K2Node_DynamicCast_AsLyra_Character_with_Abilities; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Increase;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttrBuffMap                           CallFunc_Array_Get_Item;                           // 0x00F8(0x0068)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player) == 0x000008, "Wrong alignment on GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player");
static_assert(sizeof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player) == 0x000180, "Wrong size on GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, EntryPoint) == 0x000000, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, K2Node_Event_EventData) == 0x000008, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, K2Node_DynamicCast_AsLyra_Character_with_Abilities) == 0x0000C0, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::K2Node_DynamicCast_AsLyra_Character_with_Abilities' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000C9, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0000CA, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0000D8, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000E0, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x0000E8, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x0000EC, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, K2Node_CustomEvent_Increase) == 0x0000F0, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::K2Node_CustomEvent_Increase' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_FTrunc_ReturnValue) == 0x0000F4, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x000168, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_Add_IntInt_ReturnValue_1) == 0x00016C, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_K2_CommitAbility_ReturnValue) == 0x000170, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player, CallFunc_FTrunc_A_ImplicitCast) == 0x000178, "Member 'GA_TGF_Killing_Player_C_ExecuteUbergraph_GA_TGF_Killing_Player::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function GA_TGF_Killing_Player.GA_TGF_Killing_Player_C.GiveBonusToPlayer
// 0x00C0 (0x00C0 - 0x0000)
struct GA_TGF_Killing_Player_C_GiveBonusToPlayer final
{
public:
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_2; // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_2; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_3; // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_3; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3; // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Killing_Player_C_GiveBonusToPlayer) == 0x000008, "Wrong alignment on GA_TGF_Killing_Player_C_GiveBonusToPlayer");
static_assert(sizeof(GA_TGF_Killing_Player_C_GiveBonusToPlayer) == 0x0000C0, "Wrong size on GA_TGF_Killing_Player_C_GiveBonusToPlayer");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000010, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000020, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000028, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000038, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000040, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000050, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000058, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000060, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000069, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00006C, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000071, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x000074, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000079, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BooleanAND_ReturnValue_1) == 0x00007A, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BooleanAND_ReturnValue_2) == 0x00007B, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BooleanAND_ReturnValue_3) == 0x00007C, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_2) == 0x00007D, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_2) == 0x000080, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000084, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_3) == 0x000085, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_3) == 0x000088, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BooleanAND_ReturnValue_4) == 0x00008C, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x00008D, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BooleanAND_ReturnValue_5) == 0x00008E, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BooleanAND_ReturnValue_6) == 0x00008F, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x000090, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3) == 0x000098, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x0000B0, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_GiveBonusToPlayer, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x0000B8, "Member 'GA_TGF_Killing_Player_C_GiveBonusToPlayer::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");

// Function GA_TGF_Killing_Player.GA_TGF_Killing_Player_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_Killing_Player_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_Killing_Player_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_Killing_Player_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_Killing_Player_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_Killing_Player_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_Killing_Player_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_Killing_Player_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_TGF_Killing_Player.GA_TGF_Killing_Player_C.UpdateAllGEStack
// 0x0004 (0x0004 - 0x0000)
struct GA_TGF_Killing_Player_C_UpdateAllGEStack final
{
public:
	int32                                         Increase;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Killing_Player_C_UpdateAllGEStack) == 0x000004, "Wrong alignment on GA_TGF_Killing_Player_C_UpdateAllGEStack");
static_assert(sizeof(GA_TGF_Killing_Player_C_UpdateAllGEStack) == 0x000004, "Wrong size on GA_TGF_Killing_Player_C_UpdateAllGEStack");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateAllGEStack, Increase) == 0x000000, "Member 'GA_TGF_Killing_Player_C_UpdateAllGEStack::Increase' has a wrong offset!");

// Function GA_TGF_Killing_Player.GA_TGF_Killing_Player_C.UpdateGEStack
// 0x00B8 (0x00B8 - 0x0000)
struct GA_TGF_Killing_Player_C_UpdateGEStack final
{
public:
	struct FAttrBuffMap                           GEInfo;                                            // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         TargetStackCount;                                  // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DiffVar;                                           // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Killing_Player_C_UpdateGEStack) == 0x000008, "Wrong alignment on GA_TGF_Killing_Player_C_UpdateGEStack");
static_assert(sizeof(GA_TGF_Killing_Player_C_UpdateGEStack) == 0x0000B8, "Wrong size on GA_TGF_Killing_Player_C_UpdateGEStack");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, GEInfo) == 0x000000, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::GEInfo' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, TargetStackCount) == 0x000068, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::TargetStackCount' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, DiffVar) == 0x00006C, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::DiffVar' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000070, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000078, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000080, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000088, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_GetFloatAttribute_ReturnValue) == 0x00008C, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_FTrunc_ReturnValue) == 0x000090, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000094, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_Clamp_ReturnValue) == 0x000098, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_Greater_IntInt_ReturnValue) == 0x00009C, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_GetGameplayEffectCount_ReturnValue) == 0x0000A0, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_GetGameplayEffectCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A4, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_Abs_Int_ReturnValue) == 0x0000A8, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateGEStack, CallFunc_FTrunc_A_ImplicitCast) == 0x0000B0, "Member 'GA_TGF_Killing_Player_C_UpdateGEStack::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");

// Function GA_TGF_Killing_Player.GA_TGF_Killing_Player_C.UpdateTotalStackEffect
// 0x0090 (0x0090 - 0x0000)
struct GA_TGF_Killing_Player_C_UpdateTotalStackEffect final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttrBuffMap                           CallFunc_Array_Get_Item;                           // 0x0018(0x0068)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGameplayEffectCount_ReturnValue;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Killing_Player_C_UpdateTotalStackEffect) == 0x000008, "Wrong alignment on GA_TGF_Killing_Player_C_UpdateTotalStackEffect");
static_assert(sizeof(GA_TGF_Killing_Player_C_UpdateTotalStackEffect) == 0x000090, "Wrong size on GA_TGF_Killing_Player_C_UpdateTotalStackEffect");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateTotalStackEffect, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GA_TGF_Killing_Player_C_UpdateTotalStackEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Killing_Player_C_UpdateTotalStackEffect, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GA_TGF_Killing_Player_C_UpdateTotalStackEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
