#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TalentRogue_EnterStealth

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TalentRogue_EnterStealth.GA_TalentRogue_EnterStealth_C
// 0x0020 (0x09C0 - 0x09A0)
class UGA_TalentRogue_EnterStealth_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 AddAtk;                                            // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CritRateMax;                                       // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Speed_Burst_GE;                                    // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_TalentRogue_EnterStealth(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TalentRogue_EnterStealth_C">();
	}
	static class UGA_TalentRogue_EnterStealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TalentRogue_EnterStealth_C>();
	}
};
static_assert(alignof(UGA_TalentRogue_EnterStealth_C) == 0x000010, "Wrong alignment on UGA_TalentRogue_EnterStealth_C");
static_assert(sizeof(UGA_TalentRogue_EnterStealth_C) == 0x0009C0, "Wrong size on UGA_TalentRogue_EnterStealth_C");
static_assert(offsetof(UGA_TalentRogue_EnterStealth_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TalentRogue_EnterStealth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TalentRogue_EnterStealth_C, AddAtk) == 0x0009A8, "Member 'UGA_TalentRogue_EnterStealth_C::AddAtk' has a wrong offset!");
static_assert(offsetof(UGA_TalentRogue_EnterStealth_C, CritRateMax) == 0x0009B0, "Member 'UGA_TalentRogue_EnterStealth_C::CritRateMax' has a wrong offset!");
static_assert(offsetof(UGA_TalentRogue_EnterStealth_C, Speed_Burst_GE) == 0x0009B8, "Member 'UGA_TalentRogue_EnterStealth_C::Speed_Burst_GE' has a wrong offset!");

}

