#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_RollbackChargeProgress

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_RollbackChargeProgress.GA_TGF_RollbackChargeProgress_C.ExecuteUbergraph_GA_TGF_RollbackChargeProgress
// 0x0198 (0x0198 - 0x0000)
struct GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0018(0x00B0)(ConstParm)
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTgfGameplayEffect*                     K2Node_DynamicCast_AsTgf_Gameplay_Effect;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0100(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SendChargeRollbackEvent_AttackWeight_ImplicitCast; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress) == 0x000008, "Wrong alignment on GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress");
static_assert(sizeof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress) == 0x000198, "Wrong size on GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, EntryPoint) == 0x000000, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000010, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, K2Node_Event_EventData) == 0x000018, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_Conv_ObjectToString_ReturnValue) == 0x0000C8, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, K2Node_DynamicCast_AsTgf_Gameplay_Effect) == 0x0000D8, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::K2Node_DynamicCast_AsTgf_Gameplay_Effect' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000100, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, K2Node_MakeArray_Array) == 0x000150, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_Format_ReturnValue) == 0x000168, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000180, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000188, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress, CallFunc_SendChargeRollbackEvent_AttackWeight_ImplicitCast) == 0x000190, "Member 'GA_TGF_RollbackChargeProgress_C_ExecuteUbergraph_GA_TGF_RollbackChargeProgress::CallFunc_SendChargeRollbackEvent_AttackWeight_ImplicitCast' has a wrong offset!");

// Function GA_TGF_RollbackChargeProgress.GA_TGF_RollbackChargeProgress_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_RollbackChargeProgress_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_RollbackChargeProgress_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_RollbackChargeProgress_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_RollbackChargeProgress_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_RollbackChargeProgress_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_RollbackChargeProgress_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_TGF_RollbackChargeProgress.GA_TGF_RollbackChargeProgress_C.SendChargeRollbackEvent
// 0x00C8 (0x00C8 - 0x0000)
struct GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent final
{
public:
	double                                        AttackWeight;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0010(0x00B0)()
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent) == 0x000008, "Wrong alignment on GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent");
static_assert(sizeof(GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent) == 0x0000C8, "Wrong size on GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent, AttackWeight) == 0x000000, "Member 'GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent::AttackWeight' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent, CallFunc_GetFloatValue_ReturnValue) == 0x000008, "Member 'GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent, K2Node_MakeStruct_GameplayEventData) == 0x000010, "Member 'GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0000C0, "Member 'GA_TGF_RollbackChargeProgress_C_SendChargeRollbackEvent::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");

}

