#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_HideAllGCN

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_TGF_HideAllGCN.GA_TGF_HideAllGCN_C.ExecuteUbergraph_GA_TGF_HideAllGCN
// 0x0038 (0x0038 - 0x0000)
struct GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default_1;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN) == 0x000008, "Wrong alignment on GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN");
static_assert(sizeof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN) == 0x000038, "Wrong size on GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, EntryPoint) == 0x000000, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, K2Node_DynamicCast_AsBP_Tgf_Character_Default) == 0x000010, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::K2Node_DynamicCast_AsBP_Tgf_Character_Default' has a wrong offset!");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, K2Node_Event_bWasCancelled) == 0x000019, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000020, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, K2Node_DynamicCast_AsBP_Tgf_Character_Default_1) == 0x000028, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::K2Node_DynamicCast_AsBP_Tgf_Character_Default_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'GA_TGF_HideAllGCN_C_ExecuteUbergraph_GA_TGF_HideAllGCN::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GA_TGF_HideAllGCN.GA_TGF_HideAllGCN_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_HideAllGCN_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_HideAllGCN_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_HideAllGCN_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_HideAllGCN_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_HideAllGCN_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_HideAllGCN_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_HideAllGCN_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

