#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_AutoRecoverAmmo_PVP

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_AutoRecoverAmmo_PVP.GA_TGF_AutoRecoverAmmo_PVP_C.ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP
// 0x0038 (0x0038 - 0x0000)
struct GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP) == 0x000008, "Wrong alignment on GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP");
static_assert(sizeof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP) == 0x000038, "Wrong size on GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP, EntryPoint) == 0x000000, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP, K2Node_Event_bWasCancelled) == 0x000014, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000020, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_ExecuteUbergraph_GA_TGF_AutoRecoverAmmo_PVP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_TGF_AutoRecoverAmmo_PVP.GA_TGF_AutoRecoverAmmo_PVP_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_AutoRecoverAmmo_PVP_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_AutoRecoverAmmo_PVP_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_AutoRecoverAmmo_PVP_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_TGF_AutoRecoverAmmo_PVP.GA_TGF_AutoRecoverAmmo_PVP_C.K2_CanActivateAbility
// 0x00A0 (0x00A0 - 0x0000)
struct GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPVPMatchType_ReturnValue;               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility");
static_assert(sizeof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility) == 0x0000A0, "Wrong size on GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, CallFunc_GetGameState_ReturnValue) == 0x000080, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, K2Node_DynamicCast_AsLyra_Game_State) == 0x000090, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, CallFunc_IsPVPMatchType_ReturnValue) == 0x000099, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::CallFunc_IsPVPMatchType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00009A, "Member 'GA_TGF_AutoRecoverAmmo_PVP_C_K2_CanActivateAbility::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

