#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth.GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C
// 0x0020 (0x09C0 - 0x09A0)
class UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   ImmunityTags;                                      // 0x09A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            PoisonGE;                                          // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C">();
	}
	static class UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C>();
	}
};
static_assert(alignof(UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C) == 0x000010, "Wrong alignment on UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C");
static_assert(sizeof(UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C) == 0x0009C0, "Wrong size on UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C");
static_assert(offsetof(UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C, ImmunityTags) == 0x0009A8, "Member 'UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C::ImmunityTags' has a wrong offset!");
static_assert(offsetof(UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C, PoisonGE) == 0x0009B8, "Member 'UGA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C::PoisonGE' has a wrong offset!");

}

