#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_GameMenu

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_GameMenu.GA_TGF_GameMenu_C.ExecuteUbergraph_GA_TGF_GameMenu
// 0x00B8 (0x00B8 - 0x0000)
struct GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInputTrigger*>                  Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class UInputModifier*>                 Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      CallFunc_MakeInputActionValueOfType_ReturnValue;   // 0x0030(0x0020)(NoDestructor)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_InjectInputForAction_self_CastInput;      // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0078(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0098(0x0020)()
};
static_assert(alignof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu) == 0x000008, "Wrong alignment on GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu");
static_assert(sizeof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu) == 0x0000B8, "Wrong size on GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, EntryPoint) == 0x000000, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, Temp_object_Variable) == 0x000008, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, Temp_object_Variable_1) == 0x000018, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, K2Node_Event_bWasCancelled) == 0x000028, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_K2_HasAuthority_ReturnValue) == 0x000029, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_MakeInputActionValueOfType_ReturnValue) == 0x000030, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_MakeInputActionValueOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue) == 0x000050, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000058, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_InjectInputForAction_self_CastInput) == 0x000068, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_InjectInputForAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000078, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000098, "Member 'GA_TGF_GameMenu_C_ExecuteUbergraph_GA_TGF_GameMenu::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_GameMenu.GA_TGF_GameMenu_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_GameMenu_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_GameMenu_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_GameMenu_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_GameMenu_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_GameMenu_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_GameMenu_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_GameMenu_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_TGF_GameMenu.GA_TGF_GameMenu_C.OnWidgetPushSuccess
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_GameMenu_C_OnWidgetPushSuccess final
{
public:
	class UUserWidget*                            UserWidgetPage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_GameMenu_C_OnWidgetPushSuccess) == 0x000008, "Wrong alignment on GA_TGF_GameMenu_C_OnWidgetPushSuccess");
static_assert(sizeof(GA_TGF_GameMenu_C_OnWidgetPushSuccess) == 0x000008, "Wrong size on GA_TGF_GameMenu_C_OnWidgetPushSuccess");
static_assert(offsetof(GA_TGF_GameMenu_C_OnWidgetPushSuccess, UserWidgetPage) == 0x000000, "Member 'GA_TGF_GameMenu_C_OnWidgetPushSuccess::UserWidgetPage' has a wrong offset!");

}

