#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Fighter_E3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Fighter_E3.GA_TGF_Fighter_E3_C.ExecuteUbergraph_GA_TGF_Fighter_E3
// 0x1070 (0x1070 - 0x0000)
struct GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_ImpactHitResult;                // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfCharacterMovementExtensionComponent* CallFunc_FindCharacterMovementExtensionComponent_ReturnValue; // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CheckAbilityCost_ReturnValue;          // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CheckAbilityCooldown_ReturnValue;      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraCameraComponent*                   CallFunc_FindCameraComponent_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendables                    CallFunc_InsertPostProcessMaterial_ReturnValue;    // 0x0250(0x0010)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0260(0x06E0)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x0940(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraCameraComponent*                   CallFunc_FindCameraComponent_ReturnValue_1;        // 0x0948(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_951[0x7];                                      // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendables                    CallFunc_DeletePostProcessMaterial_ReturnValue;    // 0x0958(0x0010)()
	uint8                                         Pad_968[0x8];                                      // 0x0968(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings_1;           // 0x0970(0x06E0)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x1050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1051[0x7];                                     // 0x1051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_MoveActor*                 CallFunc_ApplyMoveActor_ReturnValue;               // 0x1058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x1060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1061[0x3];                                     // 0x1061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyMoveActor_Duration_ImplicitCast;     // 0x1064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x1068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3) == 0x000010, "Wrong alignment on GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3");
static_assert(sizeof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3) == 0x001070, "Wrong size on GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, EntryPoint) == 0x000000, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_K2_CommitAbility_ReturnValue) == 0x00000C, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000020, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_K2_HasAuthority_ReturnValue) == 0x000028, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, K2Node_CustomEvent_ImpactHitResult) == 0x000030, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::K2Node_CustomEvent_ImpactHitResult' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_bBlockingHit) == 0x000118, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_bInitialOverlap) == 0x000119, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_Location) == 0x000128, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_ImpactPoint) == 0x000140, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_Normal) == 0x000158, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_BoneName) == 0x0001A8, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_HitItem) == 0x0001B0, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_ElementIndex) == 0x0001B4, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_FaceIndex) == 0x0001B8, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_TraceStart) == 0x0001C0, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_BreakHitResult_TraceEnd) == 0x0001D8, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0001F0, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, K2Node_DynamicCast_AsLyra_Character) == 0x0001F8, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_IsValid_ReturnValue) == 0x000201, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000208, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_FindCharacterMovementExtensionComponent_ReturnValue) == 0x000220, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_FindCharacterMovementExtensionComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_IsValid_ReturnValue_1) == 0x000228, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_IsLocallyControlled_ReturnValue) == 0x000229, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_K2_CheckAbilityCost_ReturnValue) == 0x00022A, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_K2_CheckAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x00022B, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000230, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_K2_CheckAbilityCooldown_ReturnValue) == 0x000238, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_K2_CheckAbilityCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_FindCameraComponent_ReturnValue) == 0x000240, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_IsValid_ReturnValue_2) == 0x000248, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_InsertPostProcessMaterial_ReturnValue) == 0x000250, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_InsertPostProcessMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, K2Node_MakeStruct_PostProcessSettings) == 0x000260, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x000940, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_FindCameraComponent_ReturnValue_1) == 0x000948, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_FindCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_IsValid_ReturnValue_3) == 0x000950, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_DeletePostProcessMaterial_ReturnValue) == 0x000958, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_DeletePostProcessMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, K2Node_MakeStruct_PostProcessSettings_1) == 0x000970, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::K2Node_MakeStruct_PostProcessSettings_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, K2Node_Event_bWasCancelled) == 0x001050, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_ApplyMoveActor_ReturnValue) == 0x001058, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_ApplyMoveActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_IsValid_ReturnValue_4) == 0x001060, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_ApplyMoveActor_Duration_ImplicitCast) == 0x001064, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_ApplyMoveActor_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3, CallFunc_Delay_Duration_ImplicitCast) == 0x001068, "Member 'GA_TGF_Fighter_E3_C_ExecuteUbergraph_GA_TGF_Fighter_E3::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function GA_TGF_Fighter_E3.GA_TGF_Fighter_E3_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_Fighter_E3_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Fighter_E3_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_Fighter_E3_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_Fighter_E3_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_Fighter_E3_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_Fighter_E3_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_Fighter_E3_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_TGF_Fighter_E3.GA_TGF_Fighter_E3_C.MoveActorBlock111
// 0x00E8 (0x00E8 - 0x0000)
struct GA_TGF_Fighter_E3_C_MoveActorBlock111 final
{
public:
	struct FHitResult                             ImpactHitResult;                                   // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_TGF_Fighter_E3_C_MoveActorBlock111) == 0x000008, "Wrong alignment on GA_TGF_Fighter_E3_C_MoveActorBlock111");
static_assert(sizeof(GA_TGF_Fighter_E3_C_MoveActorBlock111) == 0x0000E8, "Wrong size on GA_TGF_Fighter_E3_C_MoveActorBlock111");
static_assert(offsetof(GA_TGF_Fighter_E3_C_MoveActorBlock111, ImpactHitResult) == 0x000000, "Member 'GA_TGF_Fighter_E3_C_MoveActorBlock111::ImpactHitResult' has a wrong offset!");

// Function GA_TGF_Fighter_E3.GA_TGF_Fighter_E3_C.PostEndAbility
// 0x0010 (0x0010 - 0x0000)
struct GA_TGF_Fighter_E3_C_PostEndAbility final
{
public:
	class UGameplayAbility*                       ActivatedAbility;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Fighter_E3_C_PostEndAbility) == 0x000008, "Wrong alignment on GA_TGF_Fighter_E3_C_PostEndAbility");
static_assert(sizeof(GA_TGF_Fighter_E3_C_PostEndAbility) == 0x000010, "Wrong size on GA_TGF_Fighter_E3_C_PostEndAbility");
static_assert(offsetof(GA_TGF_Fighter_E3_C_PostEndAbility, ActivatedAbility) == 0x000000, "Member 'GA_TGF_Fighter_E3_C_PostEndAbility::ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_TGF_Fighter_E3_C_PostEndAbility, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'GA_TGF_Fighter_E3_C_PostEndAbility::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

