#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Interrupt_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Interrupt_Base.GA_TGF_Interrupt_Base_C.CheckShouldInterrupt
// 0x01C8 (0x01C8 - 0x0000)
struct GA_TGF_Interrupt_Base_C_CheckShouldInterrupt final
{
public:
	bool                                          ShouldInterrupt;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0008(0x0018)()
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0128(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt) == 0x000008, "Wrong alignment on GA_TGF_Interrupt_Base_C_CheckShouldInterrupt");
static_assert(sizeof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt) == 0x0001C8, "Wrong size on GA_TGF_Interrupt_Base_C_CheckShouldInterrupt");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, ShouldInterrupt) == 0x000000, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::ShouldInterrupt' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000008, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_GetTagName_ReturnValue) == 0x000020, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Conv_NameToText_ReturnValue) == 0x000078, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, K2Node_MakeArray_Array) == 0x0000E0, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000F0, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Not_PreBool_ReturnValue) == 0x000110, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Conv_TextToString_ReturnValue) == 0x000118, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Conv_BoolToText_ReturnValue) == 0x000128, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, K2Node_MakeStruct_FormatArgumentData_2) == 0x000140, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, K2Node_MakeArray_Array_1) == 0x000190, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Format_ReturnValue_1) == 0x0001A0, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_CheckShouldInterrupt, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001B8, "Member 'GA_TGF_Interrupt_Base_C_CheckShouldInterrupt::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_Interrupt_Base.GA_TGF_Interrupt_Base_C.ExecuteUbergraph_GA_TGF_Interrupt_Base
// 0x0220 (0x0220 - 0x0000)
struct GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfActorType                                 CallFunc_GetActorType_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMonster_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0098(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	bool                                          CallFunc_CheckShouldInterrupt_ShouldInterrupt;     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0160(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue_1;       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0188(0x0020)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue_1;    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x01B8(0x0020)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue_2;       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorType                                 CallFunc_GetActorType_ReturnValue_1;               // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMonster_ReturnValue_1;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3; // 0x01F8(0x0020)()
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue_2;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base) == 0x000008, "Wrong alignment on GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base");
static_assert(sizeof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base) == 0x000220, "Wrong size on GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, EntryPoint) == 0x000000, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetActorType_ReturnValue) == 0x000010, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetActorType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_IsMonster_ReturnValue) == 0x000011, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_IsMonster_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, K2Node_Event_bWasCancelled) == 0x000012, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue) == 0x000018, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000028, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000098, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000100, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, K2Node_MakeArray_Array) == 0x000108, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_CheckShouldInterrupt_ShouldInterrupt) == 0x000118, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_CheckShouldInterrupt_ShouldInterrupt' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_Format_ReturnValue) == 0x000120, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_Conv_TextToString_ReturnValue) == 0x000138, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000148, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000150, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000160, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_AddLooseGameplayTags_ReturnValue_1) == 0x000180, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_AddLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000188, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x0001A8, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_RemoveLooseGameplayTags_ReturnValue_1) == 0x0001B0, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_RemoveLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x0001B8, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3) == 0x0001D8, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_AddLooseGameplayTags_ReturnValue_2) == 0x0001E0, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_AddLooseGameplayTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetActorType_ReturnValue_1) == 0x0001E1, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetActorType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4) == 0x0001E8, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_IsMonster_ReturnValue_1) == 0x0001F0, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_IsMonster_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3) == 0x0001F8, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base, CallFunc_RemoveLooseGameplayTags_ReturnValue_2) == 0x000218, "Member 'GA_TGF_Interrupt_Base_C_ExecuteUbergraph_GA_TGF_Interrupt_Base::CallFunc_RemoveLooseGameplayTags_ReturnValue_2' has a wrong offset!");

// Function GA_TGF_Interrupt_Base.GA_TGF_Interrupt_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_Interrupt_Base_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Interrupt_Base_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_Interrupt_Base_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_Interrupt_Base_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_Interrupt_Base_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_Interrupt_Base_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_Interrupt_Base_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

