#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_FunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TgfGameplayEffectHandleData_structs.hpp"
#include "LyraGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_FunctionLibrary.GA_TGF_FunctionLibrary_C.CalculateOffsetAccordingToActor
// 0x0188 (0x0188 - 0x0000)
struct GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor final
{
public:
	double                                        Forward;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Up;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Right;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BaseLocation;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BaseRot;                                           // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Result;                                            // 0x0050(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor) == 0x000008, "Wrong alignment on GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor");
static_assert(sizeof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor) == 0x000188, "Wrong size on GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, Forward) == 0x000000, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::Forward' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, Up) == 0x000008, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::Up' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, Right) == 0x000010, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::Right' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, BaseLocation) == 0x000018, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::BaseLocation' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, BaseRot) == 0x000030, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::BaseRot' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, __WorldContext) == 0x000048, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::__WorldContext' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, Result) == 0x000050, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000068, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_GetRightVector_ReturnValue) == 0x000080, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_GetUpVector_ReturnValue) == 0x000098, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B0, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_GetForwardVector_ReturnValue) == 0x0000C8, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0000E0, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x0000F8, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000110, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000128, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Add_VectorVector_ReturnValue) == 0x000140, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000158, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000170, "Member 'GA_TGF_FunctionLibrary_C_CalculateOffsetAccordingToActor::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");

// Function GA_TGF_FunctionLibrary.GA_TGF_FunctionLibrary_C.CanBeTarget
// 0x0018 (0x0018 - 0x0000)
struct GA_TGF_FunctionLibrary_C_CanBeTarget final
{
public:
	class AActor*                                 InputActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeTarget_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_FunctionLibrary_C_CanBeTarget) == 0x000008, "Wrong alignment on GA_TGF_FunctionLibrary_C_CanBeTarget");
static_assert(sizeof(GA_TGF_FunctionLibrary_C_CanBeTarget) == 0x000018, "Wrong size on GA_TGF_FunctionLibrary_C_CanBeTarget");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CanBeTarget, InputActor) == 0x000000, "Member 'GA_TGF_FunctionLibrary_C_CanBeTarget::InputActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CanBeTarget, __WorldContext) == 0x000008, "Member 'GA_TGF_FunctionLibrary_C_CanBeTarget::__WorldContext' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CanBeTarget, Result) == 0x000010, "Member 'GA_TGF_FunctionLibrary_C_CanBeTarget::Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CanBeTarget, CallFunc_CanBeTarget_ReturnValue) == 0x000011, "Member 'GA_TGF_FunctionLibrary_C_CanBeTarget::CallFunc_CanBeTarget_ReturnValue' has a wrong offset!");

// Function GA_TGF_FunctionLibrary.GA_TGF_FunctionLibrary_C.CheckAbilityAdditionalCostValid
// 0x00A8 (0x00A8 - 0x0000)
struct GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid final
{
public:
	TArray<ETgfEquipSlot>                         CanUseAdditionalList;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IgnoreCheck;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         InActor;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<ETgfEquipSlot>                         AllAdditionalList;                                 // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfEquipmentManagerComponent*          EquipmentComponent;                                // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CostValid;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          EquipmentComp;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSlot                                 CallFunc_Array_Get_Item_1;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULyraEquipmentInstance*                 CallFunc_GetEquipBySlot_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid) == 0x000008, "Wrong alignment on GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid");
static_assert(sizeof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid) == 0x0000A8, "Wrong size on GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CanUseAdditionalList) == 0x000000, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CanUseAdditionalList' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, IgnoreCheck) == 0x000010, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::IgnoreCheck' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, InActor) == 0x000018, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::InActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, AllAdditionalList) == 0x000020, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::AllAdditionalList' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, __WorldContext) == 0x000030, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, EquipmentComponent) == 0x000038, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CostValid) == 0x000040, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CostValid' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, EquipmentComp) == 0x000048, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::EquipmentComp' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, Temp_int_Array_Index_Variable) == 0x000050, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Array_Get_Item) == 0x000058, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Array_AddUnique_ReturnValue) == 0x00005C, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_GetComponentByClass_ReturnValue) == 0x000068, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Greater_IntInt_ReturnValue) == 0x000074, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, Temp_int_Array_Index_Variable_1) == 0x000084, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00008C, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_GetEquipBySlot_ReturnValue) == 0x000090, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_GetEquipBySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, Temp_int_Loop_Counter_Variable_1) == 0x000098, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009D, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid, CallFunc_IsValid_ReturnValue_1) == 0x0000A4, "Member 'GA_TGF_FunctionLibrary_C_CheckAbilityAdditionalCostValid::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_FunctionLibrary.GA_TGF_FunctionLibrary_C.CheckCharacterStateValid
// 0x0098 (0x0098 - 0x0000)
struct GA_TGF_FunctionLibrary_C_CheckCharacterStateValid final
{
public:
	class ALyraCharacter*                         InputActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  MustHaveTags;                                      // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  MustNotHaveTags;                                   // 0x0028(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          DontCareCharacterState;                            // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0058(0x0020)(Parm, OutParm)
	bool                                          Result;                                            // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipNormalCheck;                                   // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CurActor;                                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue_1; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNormalCharacterState_ReturnValue;       // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid) == 0x000008, "Wrong alignment on GA_TGF_FunctionLibrary_C_CheckCharacterStateValid");
static_assert(sizeof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid) == 0x000098, "Wrong size on GA_TGF_FunctionLibrary_C_CheckCharacterStateValid");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, InputActor) == 0x000000, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::InputActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, MustHaveTags) == 0x000008, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::MustHaveTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, MustNotHaveTags) == 0x000028, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::MustNotHaveTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, DontCareCharacterState) == 0x000048, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::DontCareCharacterState' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, __WorldContext) == 0x000050, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, RelevantTags) == 0x000058, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, Result) == 0x000078, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, SkipNormalCheck) == 0x000079, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::SkipNormalCheck' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CurActor) == 0x000080, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CurActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000088, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_GetNumGameplayTagsInContainer_ReturnValue_1) == 0x00008C, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_GetNumGameplayTagsInContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000091, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_IsValid_ReturnValue) == 0x000092, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000093, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000094, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCharacterStateValid, CallFunc_IsNormalCharacterState_ReturnValue) == 0x000095, "Member 'GA_TGF_FunctionLibrary_C_CheckCharacterStateValid::CallFunc_IsNormalCharacterState_ReturnValue' has a wrong offset!");

// Function GA_TGF_FunctionLibrary.GA_TGF_FunctionLibrary_C.CheckCrouch
// 0x0018 (0x0018 - 0x0000)
struct GA_TGF_FunctionLibrary_C_CheckCrouch final
{
public:
	class ALyraCharacter*                         InputActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_FunctionLibrary_C_CheckCrouch) == 0x000008, "Wrong alignment on GA_TGF_FunctionLibrary_C_CheckCrouch");
static_assert(sizeof(GA_TGF_FunctionLibrary_C_CheckCrouch) == 0x000018, "Wrong size on GA_TGF_FunctionLibrary_C_CheckCrouch");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCrouch, InputActor) == 0x000000, "Member 'GA_TGF_FunctionLibrary_C_CheckCrouch::InputActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCrouch, __WorldContext) == 0x000008, "Member 'GA_TGF_FunctionLibrary_C_CheckCrouch::__WorldContext' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_CheckCrouch, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'GA_TGF_FunctionLibrary_C_CheckCrouch::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_TGF_FunctionLibrary.GA_TGF_FunctionLibrary_C.Get Adjust Collision Spawn Pos
// 0x02D0 (0x02D0 - 0x0000)
struct GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos final
{
public:
	struct FVector                                OriginalPos;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         Instigator;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        AdjustDelta;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdjustPos;                                         // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerController_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetPlayerViewPoint_Location;              // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetPlayerViewPoint_Rotation;              // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos) == 0x000008, "Wrong alignment on GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos");
static_assert(sizeof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos) == 0x0002D0, "Wrong size on GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, OriginalPos) == 0x000000, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::OriginalPos' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, Instigator) == 0x000018, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::Instigator' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, AdjustDelta) == 0x000020, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::AdjustDelta' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, __WorldContext) == 0x000028, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::__WorldContext' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, AdjustPos) == 0x000030, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::AdjustPos' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000048, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_GetLyraPlayerController_ReturnValue) == 0x000060, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_GetLyraPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, K2Node_MakeArray_Array) == 0x000068, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_GetPlayerViewPoint_Location) == 0x000078, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_GetPlayerViewPoint_Location' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_GetPlayerViewPoint_Rotation) == 0x000090, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_GetPlayerViewPoint_Rotation' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_LineTraceSingle_OutHit) == 0x0000A8, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_LineTraceSingle_ReturnValue) == 0x000190, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000198, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_Normal_ReturnValue) == 0x0001B0, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_bBlockingHit) == 0x0001C8, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001C9, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_Time) == 0x0001CC, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_Distance) == 0x0001D0, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_Location) == 0x0001D8, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F0, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_Normal) == 0x000208, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_ImpactNormal) == 0x000220, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_PhysMat) == 0x000238, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_HitActor) == 0x000240, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_HitComponent) == 0x000248, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_HitBoneName) == 0x000250, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_BoneName) == 0x000258, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_HitItem) == 0x000260, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_ElementIndex) == 0x000264, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_FaceIndex) == 0x000268, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_TraceStart) == 0x000270, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_BreakHitResult_TraceEnd) == 0x000288, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002A0, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos, CallFunc_Add_VectorVector_ReturnValue) == 0x0002B8, "Member 'GA_TGF_FunctionLibrary_C_Get_Adjust_Collision_Spawn_Pos::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function GA_TGF_FunctionLibrary.GA_TGF_FunctionLibrary_C.Get Spawn Projectile Rot
// 0x0390 (0x0390 - 0x0000)
struct GA_TGF_FunctionLibrary_C_Get_Spawn_Projectile_Rot final
{
public:
	struct FVector                                SpawnPos;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LookDistance;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Instigator;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        MinDistance;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldIgnoreWeapon;                                // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         IgnoreActors;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCurrentWeaponFirstActor_ReturnValue;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCurrentWeaponFirstActor_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromObject_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0188(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
