#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_AttributeChangeHandle_CurShield

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_AttributeChangeHandle_CurShield.GA_TGF_AttributeChangeHandle_CurShield_C.AttrChangeHandle
// 0x0090 (0x0090 - 0x0000)
struct GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle final
{
public:
	class UTgfAttributeComponent*                 AttrComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     Attr;                                              // 0x0008(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0040(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfDefendAttributeSet*                 K2Node_DynamicCast_AsTgf_Defend_Attribute_Set;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurShieldFinal_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0068(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle) == 0x000008, "Wrong alignment on GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle");
static_assert(sizeof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle) == 0x000090, "Wrong size on GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, AttrComp) == 0x000000, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::AttrComp' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, Attr) == 0x000008, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::Attr' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_GetAttributeSet_ReturnValue) == 0x000040, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, K2Node_DynamicCast_AsTgf_Defend_Attribute_Set) == 0x000048, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::K2Node_DynamicCast_AsTgf_Defend_Attribute_Set' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_GetCurShieldFinal_ReturnValue) == 0x000054, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_GetCurShieldFinal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_IsValidClass_ReturnValue) == 0x000059, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_MakeEffectContext_ReturnValue) == 0x000068, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000080, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_AttrChangeHandle::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GA_TGF_AttributeChangeHandle_CurShield.GA_TGF_AttributeChangeHandle_CurShield_C.ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield
// 0x0004 (0x0004 - 0x0000)
struct GA_TGF_AttributeChangeHandle_CurShield_C_ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_AttributeChangeHandle_CurShield_C_ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield) == 0x000004, "Wrong alignment on GA_TGF_AttributeChangeHandle_CurShield_C_ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield");
static_assert(sizeof(GA_TGF_AttributeChangeHandle_CurShield_C_ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield) == 0x000004, "Wrong size on GA_TGF_AttributeChangeHandle_CurShield_C_ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield");
static_assert(offsetof(GA_TGF_AttributeChangeHandle_CurShield_C_ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield, EntryPoint) == 0x000000, "Member 'GA_TGF_AttributeChangeHandle_CurShield_C_ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield::EntryPoint' has a wrong offset!");

}

