#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_WeaponOperationTips

#include "Basic.hpp"

#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_WeaponOperationTips.GA_TGF_WeaponOperationTips_C.ExecuteUbergraph_GA_TGF_WeaponOperationTips
// 0x0018 (0x0018 - 0x0000)
struct GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHudBooleanMessage                     K2Node_MakeStruct_HudBooleanMessage;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips) == 0x000008, "Wrong alignment on GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips");
static_assert(sizeof(GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips) == 0x000018, "Wrong size on GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips");
static_assert(offsetof(GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips, EntryPoint) == 0x000000, "Member 'GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips, K2Node_MakeStruct_HudBooleanMessage) == 0x000010, "Member 'GA_TGF_WeaponOperationTips_C_ExecuteUbergraph_GA_TGF_WeaponOperationTips::K2Node_MakeStruct_HudBooleanMessage' has a wrong offset!");

}

