#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_SwitchWeaponSlot_SwitchPre

#include "Basic.hpp"

#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_SwitchWeaponSlot_SwitchPre.GA_TGF_SwitchWeaponSlot_SwitchPre_C.GetSlot
// 0x0020 (0x0020 - 0x0000)
struct GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot final
{
public:
	ETgfWeaponChangeSlot                          Slot;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETgfWeaponChangeSlot                          CallFunc_IterateAvailableSlot_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot) == 0x000008, "Wrong alignment on GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot");
static_assert(sizeof(GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot) == 0x000020, "Wrong size on GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot");
static_assert(offsetof(GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot, Slot) == 0x000000, "Member 'GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot::Slot' has a wrong offset!");
static_assert(offsetof(GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot, CallFunc_IterateAvailableSlot_ReturnValue) == 0x000018, "Member 'GA_TGF_SwitchWeaponSlot_SwitchPre_C_GetSlot::CallFunc_IterateAvailableSlot_ReturnValue' has a wrong offset!");

}

