#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_GuardEffect

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_GuardEffect.GA_TGF_GuardEffect_C
// 0x0020 (0x09C0 - 0x09A0)
class UGA_TGF_GuardEffect_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            GuardHealGE;                                       // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            CounterAttackGE;                                   // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void EventReceived_77F0B2494D2A6D2D59175FA19280BD4D(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_GuardEffect(int32 EntryPoint);
	void K2_ActivateAbility();
	void NeedApplyGuardCounter(bool* Result);
	void NeedApplyGuardOnHeal(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_GuardEffect_C">();
	}
	static class UGA_TGF_GuardEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_GuardEffect_C>();
	}
};
static_assert(alignof(UGA_TGF_GuardEffect_C) == 0x000010, "Wrong alignment on UGA_TGF_GuardEffect_C");
static_assert(sizeof(UGA_TGF_GuardEffect_C) == 0x0009C0, "Wrong size on UGA_TGF_GuardEffect_C");
static_assert(offsetof(UGA_TGF_GuardEffect_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_GuardEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_GuardEffect_C, GuardHealGE) == 0x0009A8, "Member 'UGA_TGF_GuardEffect_C::GuardHealGE' has a wrong offset!");
static_assert(offsetof(UGA_TGF_GuardEffect_C, CounterAttackGE) == 0x0009B0, "Member 'UGA_TGF_GuardEffect_C::CounterAttackGE' has a wrong offset!");

}

