#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_InventoryMenu

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_InventoryMenu.GA_TGF_InventoryMenu_C.EventReceived_673FA3394A21322883A6A0B35E48225F
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_InventoryMenu_C_EventReceived_673FA3394A21322883A6A0B35E48225F final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_InventoryMenu_C_EventReceived_673FA3394A21322883A6A0B35E48225F) == 0x000008, "Wrong alignment on GA_TGF_InventoryMenu_C_EventReceived_673FA3394A21322883A6A0B35E48225F");
static_assert(sizeof(GA_TGF_InventoryMenu_C_EventReceived_673FA3394A21322883A6A0B35E48225F) == 0x0000B0, "Wrong size on GA_TGF_InventoryMenu_C_EventReceived_673FA3394A21322883A6A0B35E48225F");
static_assert(offsetof(GA_TGF_InventoryMenu_C_EventReceived_673FA3394A21322883A6A0B35E48225F, Payload) == 0x000000, "Member 'GA_TGF_InventoryMenu_C_EventReceived_673FA3394A21322883A6A0B35E48225F::Payload' has a wrong offset!");

// Function GA_TGF_InventoryMenu.GA_TGF_InventoryMenu_C.ExecuteUbergraph_GA_TGF_InventoryMenu
// 0x0450 (0x0450 - 0x0000)
struct GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0010(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputModifier*>                 Temp_object_Variable;                              // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInputTrigger*>                  Temp_object_Variable_1;                            // 0x0140(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_1; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue_1;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue_1;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_2; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      CallFunc_MakeInputActionValueOfType_ReturnValue;   // 0x01F0(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0218(0x00B0)()
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_3; // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_InjectInputForAction_self_CastInput;      // 0x02D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0310(0x0020)()
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_4; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue_1;    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0340(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLyraVerbMessage                       K2Node_MakeStruct_LyraVerbMessage;                 // 0x0350(0x0080)()
	struct FLyraVerbMessage                       K2Node_MakeStruct_LyraVerbMessage_1;               // 0x03D0(0x0080)()
};
static_assert(alignof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu) == 0x000008, "Wrong alignment on GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu");
static_assert(sizeof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu) == 0x000450, "Wrong size on GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, EntryPoint) == 0x000000, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, K2Node_CustomEvent_Payload) == 0x000010, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, Temp_object_Variable) == 0x0000D0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000E0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue) == 0x0000E8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetViewTarget_ReturnValue) == 0x0000F0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_1) == 0x0000F9, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_Vector_Distance_ReturnValue) == 0x000130, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000138, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, Temp_object_Variable_1) == 0x000140, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, K2Node_Event_bWasCancelled) == 0x000150, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_2) == 0x000151, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000158, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_3) == 0x000160, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_1) == 0x000168, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetViewTarget_ReturnValue_1) == 0x000170, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetViewTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_4) == 0x000178, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_5) == 0x000179, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000180, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000198, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_Vector_Distance_ReturnValue_1) == 0x0001B0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0001B8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001BC, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_6) == 0x0001CC, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001D0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_2) == 0x0001D8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_K2_HasAuthority_ReturnValue) == 0x0001E0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_7) == 0x0001E1, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetComponentByClass_ReturnValue) == 0x0001E8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_MakeInputActionValueOfType_ReturnValue) == 0x0001F0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_MakeInputActionValueOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_8) == 0x000210, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, Temp_struct_Variable) == 0x000218, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_3) == 0x0002C8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x0002D0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_InjectInputForAction_self_CastInput) == 0x0002D8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_InjectInputForAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0002E8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_9) == 0x0002F0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0002F8, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x000300, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000308, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000309, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000310, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_4) == 0x000330, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_RemoveLooseGameplayTags_ReturnValue_1) == 0x000338, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_RemoveLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000340, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_10) == 0x000348, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, CallFunc_IsValid_ReturnValue_11) == 0x000349, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, K2Node_MakeStruct_LyraVerbMessage) == 0x000350, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::K2Node_MakeStruct_LyraVerbMessage' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu, K2Node_MakeStruct_LyraVerbMessage_1) == 0x0003D0, "Member 'GA_TGF_InventoryMenu_C_ExecuteUbergraph_GA_TGF_InventoryMenu::K2Node_MakeStruct_LyraVerbMessage_1' has a wrong offset!");

// Function GA_TGF_InventoryMenu.GA_TGF_InventoryMenu_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_InventoryMenu_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InventoryMenu_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_InventoryMenu_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_InventoryMenu_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_InventoryMenu_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_InventoryMenu_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_InventoryMenu_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_TGF_InventoryMenu.GA_TGF_InventoryMenu_C.OnWidgetPushSuccess
// 0x00D0 (0x00D0 - 0x0000)
struct GA_TGF_InventoryMenu_C_OnWidgetPushSuccess final
{
public:
	class UUserWidget*                            UserWidgetPage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_TgfGame_InventoryMenu_C*           K2Node_DynamicCast_AsWBP_Tgf_Game_Inventory_Menu;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0050(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TGF_CharacterLoot_C*                K2Node_DynamicCast_AsBP_TGF_Character_Loot;        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSpectatorMode_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_Select_Default;                             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_Select_Default_1;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess) == 0x000008, "Wrong alignment on GA_TGF_InventoryMenu_C_OnWidgetPushSuccess");
static_assert(sizeof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess) == 0x0000D0, "Wrong size on GA_TGF_InventoryMenu_C_OnWidgetPushSuccess");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, UserWidgetPage) == 0x000000, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::UserWidgetPage' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_DynamicCast_AsWBP_Tgf_Game_Inventory_Menu) == 0x000008, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_DynamicCast_AsWBP_Tgf_Game_Inventory_Menu' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, Temp_bool_Variable) == 0x000020, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, Temp_int_Array_Index_Variable) == 0x000024, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, Temp_bool_True_if_break_was_hit_Variable) == 0x000028, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000030, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetAttachedActors_OutActors) == 0x000050, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_Array_Get_Item) == 0x000060, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_DynamicCast_AsBP_TGF_Character_Loot) == 0x000070, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_DynamicCast_AsBP_TGF_Character_Loot' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue) == 0x000080, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, Temp_bool_Variable_1) == 0x000088, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetViewTarget_ReturnValue) == 0x000090, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetSpectatorMode_ReturnValue) == 0x000098, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetSpectatorMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_DynamicCast_AsLyra_Character) == 0x0000A0, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_IsValid_ReturnValue_2) == 0x0000A9, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_BooleanAND_ReturnValue_1) == 0x0000AA, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_GetComponentByClass_ReturnValue) == 0x0000B0, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, CallFunc_IsValid_ReturnValue_3) == 0x0000B8, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_Select_Default) == 0x0000C0, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_OnWidgetPushSuccess, K2Node_Select_Default_1) == 0x0000C8, "Member 'GA_TGF_InventoryMenu_C_OnWidgetPushSuccess::K2Node_Select_Default_1' has a wrong offset!");

// Function GA_TGF_InventoryMenu.GA_TGF_InventoryMenu_C.K2_CanActivateAbility
// 0x0098 (0x0098 - 0x0000)
struct GA_TGF_InventoryMenu_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InventoryMenu_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_TGF_InventoryMenu_C_K2_CanActivateAbility");
static_assert(sizeof(GA_TGF_InventoryMenu_C_K2_CanActivateAbility) == 0x000098, "Wrong size on GA_TGF_InventoryMenu_C_K2_CanActivateAbility");
static_assert(offsetof(GA_TGF_InventoryMenu_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_TGF_InventoryMenu_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_TGF_InventoryMenu_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_TGF_InventoryMenu_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_TGF_InventoryMenu_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
