#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_AdditionalElementFixedDamage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_AdditionalElementFixedDamage.GA_TGF_AdditionalElementFixedDamage_C.ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage
// 0x01C0 (0x01C0 - 0x0000)
struct GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0010(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfTriggerEffectAttributeSet*          K2Node_DynamicCast_AsTgf_Trigger_Effect_Attribute_Set; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_5;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_2; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_3; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2; // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_4; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3; // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_5; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_4; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_6; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_5; // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_7; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_6;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_6; // 0x00A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00B0(0x00B0)(ConstParm)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfGameplayEffect*                     K2Node_DynamicCast_AsTgf_Gameplay_Effect;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_4;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_5;    // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_6;    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage) == 0x000008, "Wrong alignment on GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage");
static_assert(sizeof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage) == 0x0001C0, "Wrong size on GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, EntryPoint) == 0x000000, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetAttributeSet_ReturnValue) == 0x000010, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000019, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, K2Node_DynamicCast_AsTgf_Trigger_Effect_Attribute_Set) == 0x000020, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::K2Node_DynamicCast_AsTgf_Trigger_Effect_Attribute_Set' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000029, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x00002A, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x00002B, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_ReturnValue_4) == 0x00002C, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000030, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_ReturnValue_5) == 0x000038, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x00003C, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_2) == 0x000048, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000050, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_3) == 0x000058, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2) == 0x000060, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_4) == 0x000068, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3) == 0x000070, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_5) == 0x000078, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_4) == 0x000080, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_6) == 0x000088, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_5) == 0x000090, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_7) == 0x000098, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_ReturnValue_6) == 0x0000A0, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_6) == 0x0000A4, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, K2Node_Event_EventData) == 0x0000B0, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, K2Node_DynamicCast_AsLyra_Character) == 0x000160, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000170, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, K2Node_DynamicCast_AsTgf_Gameplay_Effect) == 0x000178, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::K2Node_DynamicCast_AsTgf_Gameplay_Effect' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000181, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000182, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_BooleanAND_ReturnValue) == 0x000183, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000190, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x000198, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x0001A0, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_A_ImplicitCast_4) == 0x0001A8, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_A_ImplicitCast_5) == 0x0001B0, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_A_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage, CallFunc_Greater_DoubleDouble_A_ImplicitCast_6) == 0x0001B8, "Member 'GA_TGF_AdditionalElementFixedDamage_C_ExecuteUbergraph_GA_TGF_AdditionalElementFixedDamage::CallFunc_Greater_DoubleDouble_A_ImplicitCast_6' has a wrong offset!");

// Function GA_TGF_AdditionalElementFixedDamage.GA_TGF_AdditionalElementFixedDamage_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_AdditionalElementFixedDamage_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_AdditionalElementFixedDamage_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_AdditionalElementFixedDamage_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_AdditionalElementFixedDamage_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_AdditionalElementFixedDamage_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_AdditionalElementFixedDamage_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_AdditionalElementFixedDamage_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

