#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_AddShieldOnCastSkill

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_AddShieldOnCastSkill.GA_TGF_AddShieldOnCastSkill_C
// 0x0020 (0x09C0 - 0x09A0)
class UGA_TGF_AddShieldOnCastSkill_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        LastTakeEffectTime;                                // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfTriggerEffectAttributeSet*          As_Tgf_Trigger_Effect_Attribute_Set;               // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        TakeEffectInv;                                     // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_D46E562C4A1EDF1B62471085464E804D(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_AddShieldOnCastSkill_C">();
	}
	static class UGA_TGF_AddShieldOnCastSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_AddShieldOnCastSkill_C>();
	}
};
static_assert(alignof(UGA_TGF_AddShieldOnCastSkill_C) == 0x000010, "Wrong alignment on UGA_TGF_AddShieldOnCastSkill_C");
static_assert(sizeof(UGA_TGF_AddShieldOnCastSkill_C) == 0x0009C0, "Wrong size on UGA_TGF_AddShieldOnCastSkill_C");
static_assert(offsetof(UGA_TGF_AddShieldOnCastSkill_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_AddShieldOnCastSkill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AddShieldOnCastSkill_C, LastTakeEffectTime) == 0x0009A8, "Member 'UGA_TGF_AddShieldOnCastSkill_C::LastTakeEffectTime' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AddShieldOnCastSkill_C, As_Tgf_Trigger_Effect_Attribute_Set) == 0x0009B0, "Member 'UGA_TGF_AddShieldOnCastSkill_C::As_Tgf_Trigger_Effect_Attribute_Set' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AddShieldOnCastSkill_C, TakeEffectInv) == 0x0009B8, "Member 'UGA_TGF_AddShieldOnCastSkill_C::TakeEffectInv' has a wrong offset!");

}

