#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_WidgetPage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_WidgetPage.GA_TGF_WidgetPage_C.AfterPush_F17B7E6341CD24198DD7D393CF308D1D
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_WidgetPage_C_AfterPush_F17B7E6341CD24198DD7D393CF308D1D final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_WidgetPage_C_AfterPush_F17B7E6341CD24198DD7D393CF308D1D) == 0x000008, "Wrong alignment on GA_TGF_WidgetPage_C_AfterPush_F17B7E6341CD24198DD7D393CF308D1D");
static_assert(sizeof(GA_TGF_WidgetPage_C_AfterPush_F17B7E6341CD24198DD7D393CF308D1D) == 0x000008, "Wrong size on GA_TGF_WidgetPage_C_AfterPush_F17B7E6341CD24198DD7D393CF308D1D");
static_assert(offsetof(GA_TGF_WidgetPage_C_AfterPush_F17B7E6341CD24198DD7D393CF308D1D, UserWidget) == 0x000000, "Member 'GA_TGF_WidgetPage_C_AfterPush_F17B7E6341CD24198DD7D393CF308D1D::UserWidget' has a wrong offset!");

// Function GA_TGF_WidgetPage.GA_TGF_WidgetPage_C.BeforePush_F17B7E6341CD24198DD7D393CF308D1D
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_WidgetPage_C_BeforePush_F17B7E6341CD24198DD7D393CF308D1D final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_WidgetPage_C_BeforePush_F17B7E6341CD24198DD7D393CF308D1D) == 0x000008, "Wrong alignment on GA_TGF_WidgetPage_C_BeforePush_F17B7E6341CD24198DD7D393CF308D1D");
static_assert(sizeof(GA_TGF_WidgetPage_C_BeforePush_F17B7E6341CD24198DD7D393CF308D1D) == 0x000008, "Wrong size on GA_TGF_WidgetPage_C_BeforePush_F17B7E6341CD24198DD7D393CF308D1D");
static_assert(offsetof(GA_TGF_WidgetPage_C_BeforePush_F17B7E6341CD24198DD7D393CF308D1D, UserWidget) == 0x000000, "Member 'GA_TGF_WidgetPage_C_BeforePush_F17B7E6341CD24198DD7D393CF308D1D::UserWidget' has a wrong offset!");

// Function GA_TGF_WidgetPage.GA_TGF_WidgetPage_C.ExecuteUbergraph_GA_TGF_WidgetPage
// 0x02D8 (0x02D8 - 0x0000)
struct GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MapInteractionComponent_C*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfInterableType                             CallFunc_GetInterableType_ReturnValue;             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       K2Node_MakeStruct_LyraVerbMessage;                 // 0x0058(0x0080)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_1; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLyraVerbMessage                       K2Node_MakeStruct_LyraVerbMessage_1;               // 0x00F8(0x0080)()
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraHeroComponent*                     CallFunc_GetComponentByClass_ReturnValue_1;        // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraHeroComponent*                     CallFunc_GetComponentByClass_ReturnValue_2;        // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_2; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_3; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue;  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_4; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_5; // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue_1;    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_6; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_7; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0220(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0240(0x0020)()
	class ALyraPlayerController*                  CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_8; // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputAction*>                   K2Node_MakeArray_Array;                            // 0x0268(0x0010)(ReferenceParm)
	TArray<class UInputAction*>                   K2Node_MakeArray_Array_1;                          // 0x0278(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsLinuxVersion_ReturnValue;               // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x0298(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3; // 0x02B8(0x0020)()
};
static_assert(alignof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage) == 0x000008, "Wrong alignment on GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage");
static_assert(sizeof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage) == 0x0002D8, "Wrong size on GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, EntryPoint) == 0x000000, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, Temp_object_Variable) == 0x000018, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetInterableType_ReturnValue) == 0x000022, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetInterableType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_SwitchEnum_CmpSuccess) == 0x000023, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000040, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_CustomEvent_UserWidget_1) == 0x000050, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_CustomEvent_UserWidget_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_MakeStruct_LyraVerbMessage) == 0x000058, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_MakeStruct_LyraVerbMessage' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_Event_bWasCancelled) == 0x0000D8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_1) == 0x0000E0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsLocalPlayerController_ReturnValue) == 0x0000E8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_CustomEvent_UserWidget) == 0x0000F0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_MakeStruct_LyraVerbMessage_1) == 0x0000F8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_MakeStruct_LyraVerbMessage_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000178, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_CreateDelegate_OutputDelegate_2) == 0x000188, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_K2_CommitAbility_ReturnValue) == 0x000198, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsValid_ReturnValue_3) == 0x000199, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0001A0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0001A8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0001B0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsValid_ReturnValue_4) == 0x0001B8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0001C0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsValid_ReturnValue_5) == 0x0001C8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_2) == 0x0001D0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_3) == 0x0001D8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_PushContentToLayerForPlayer_ReturnValue) == 0x0001E0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_PushContentToLayerForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsValid_ReturnValue_6) == 0x0001E8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_4) == 0x0001F0, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_5) == 0x0001F8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsLocalPlayerController_ReturnValue_1) == 0x000200, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_6) == 0x000208, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_7) == 0x000210, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000218, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000220, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000240, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_8) == 0x000260, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraPlayerControllerFromActorInfo_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_MakeArray_Array) == 0x000268, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, K2Node_MakeArray_Array_1) == 0x000278, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_IsLinuxVersion_ReturnValue) == 0x000288, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_IsLinuxVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000290, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x000298, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3) == 0x0002B8, "Member 'GA_TGF_WidgetPage_C_ExecuteUbergraph_GA_TGF_WidgetPage::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3' has a wrong offset!");

// Function GA_TGF_WidgetPage.GA_TGF_WidgetPage_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_WidgetPage_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_WidgetPage_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_WidgetPage_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_WidgetPage_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_WidgetPage_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_WidgetPage_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_WidgetPage_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_TGF_WidgetPage.GA_TGF_WidgetPage_C.OnWidgetPushSuccess
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_WidgetPage_C_OnWidgetPushSuccess final
{
public:
	class UUserWidget*                            UserWidgetPage;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_WidgetPage_C_OnWidgetPushSuccess) == 0x000008, "Wrong alignment on GA_TGF_WidgetPage_C_OnWidgetPushSuccess");
static_assert(sizeof(GA_TGF_WidgetPage_C_OnWidgetPushSuccess) == 0x000008, "Wrong size on GA_TGF_WidgetPage_C_OnWidgetPushSuccess");
static_assert(offsetof(GA_TGF_WidgetPage_C_OnWidgetPushSuccess, UserWidgetPage) == 0x000000, "Member 'GA_TGF_WidgetPage_C_OnWidgetPushSuccess::UserWidgetPage' has a wrong offset!");

}

