#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Rebirth_To_SpawnPoint

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Rebirth_To_SpawnPoint.GA_TGF_Rebirth_To_SpawnPoint_C.ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint
// 0x0240 (0x0240 - 0x0000)
struct GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0010(0x00B0)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSpawnTransform_ReturnValue;            // 0x00D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPendingDeath_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0180(0x00B0)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0230(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint) == 0x000010, "Wrong alignment on GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint");
static_assert(sizeof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint) == 0x000240, "Wrong size on GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, EntryPoint) == 0x000000, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, K2Node_MakeStruct_GameplayEventData) == 0x000010, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000C0, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0000C8, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_GetSpawnTransform_ReturnValue) == 0x0000D0, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_GetSpawnTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_BreakTransform_Location) == 0x000130, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_BreakTransform_Rotation) == 0x000148, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_BreakTransform_Scale) == 0x000160, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_IsPendingDeath_ReturnValue) == 0x000178, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_IsPendingDeath_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_K2_TeleportTo_ReturnValue) == 0x000179, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, K2Node_Event_EventData) == 0x000180, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000230, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_ExecuteUbergraph_GA_TGF_Rebirth_To_SpawnPoint::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_Rebirth_To_SpawnPoint.GA_TGF_Rebirth_To_SpawnPoint_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_Rebirth_To_SpawnPoint_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_Rebirth_To_SpawnPoint_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_Rebirth_To_SpawnPoint_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_Rebirth_To_SpawnPoint_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_Rebirth_To_SpawnPoint_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_TGF_Rebirth_To_SpawnPoint.GA_TGF_Rebirth_To_SpawnPoint_C.RecoverAmmo
// 0x0020 (0x0020 - 0x0000)
struct GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo final
{
public:
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo) == 0x000008, "Wrong alignment on GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo");
static_assert(sizeof(GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo) == 0x000020, "Wrong size on GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000008, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_TGF_Rebirth_To_SpawnPoint_C_RecoverAmmo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

