#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth.GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C.ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth
// 0x0160 (0x0160 - 0x0000)
struct GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00B0)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfGameplayEffect*                     K2Node_DynamicCast_AsTgf_Gameplay_Effect;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00F0(0x0028)()
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0128(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0150(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth) == 0x000008, "Wrong alignment on GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth");
static_assert(sizeof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth) == 0x000160, "Wrong size on GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, EntryPoint) == 0x000000, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, K2Node_Event_EventData) == 0x000010, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, Temp_bool_Variable) == 0x0000C0, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, K2Node_DynamicCast_AsTgf_Gameplay_Effect) == 0x0000C8, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::K2Node_DynamicCast_AsTgf_Gameplay_Effect' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_Not_PreBool_ReturnValue) == 0x0000D1, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D2, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D3, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000D8, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000F0, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_CompareTeams_TeamIdA) == 0x000118, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_CompareTeams_TeamIdB) == 0x00011C, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_CompareTeams_ReturnValue) == 0x000120, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, K2Node_SwitchEnum_CmpSuccess) == 0x000121, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000128, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000148, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000150, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_ExecuteUbergraph_GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth.GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_Buff_TalentRogue_ApplyPoisonWhenOutOfStealth_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

