#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Hero_Self_Destruct

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_Hero_Self_Destruct.GA_TGF_Hero_Self_Destruct_C
// 0x0010 (0x09B0 - 0x09A0)
class UGA_TGF_Hero_Self_Destruct_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bTriggered;                                        // 0x09A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A9[0x3];                                      // 0x09A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EffectDelay;                                       // 0x09AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearAllEquipAndInventory();
	void ExecuteUbergraph_GA_TGF_Hero_Self_Destruct(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void TriggerSelfDestruct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_Hero_Self_Destruct_C">();
	}
	static class UGA_TGF_Hero_Self_Destruct_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_Hero_Self_Destruct_C>();
	}
};
static_assert(alignof(UGA_TGF_Hero_Self_Destruct_C) == 0x000010, "Wrong alignment on UGA_TGF_Hero_Self_Destruct_C");
static_assert(sizeof(UGA_TGF_Hero_Self_Destruct_C) == 0x0009B0, "Wrong size on UGA_TGF_Hero_Self_Destruct_C");
static_assert(offsetof(UGA_TGF_Hero_Self_Destruct_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_Hero_Self_Destruct_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_Hero_Self_Destruct_C, bTriggered) == 0x0009A8, "Member 'UGA_TGF_Hero_Self_Destruct_C::bTriggered' has a wrong offset!");
static_assert(offsetof(UGA_TGF_Hero_Self_Destruct_C, EffectDelay) == 0x0009AC, "Member 'UGA_TGF_Hero_Self_Destruct_C::EffectDelay' has a wrong offset!");

}

