#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_LowHPEffect

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_LowHPEffect.GA_TGF_LowHPEffect_C.EventReceived_57306CE7471281460861469B30928565
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_LowHPEffect_C_EventReceived_57306CE7471281460861469B30928565 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_LowHPEffect_C_EventReceived_57306CE7471281460861469B30928565) == 0x000008, "Wrong alignment on GA_TGF_LowHPEffect_C_EventReceived_57306CE7471281460861469B30928565");
static_assert(sizeof(GA_TGF_LowHPEffect_C_EventReceived_57306CE7471281460861469B30928565) == 0x0000B0, "Wrong size on GA_TGF_LowHPEffect_C_EventReceived_57306CE7471281460861469B30928565");
static_assert(offsetof(GA_TGF_LowHPEffect_C_EventReceived_57306CE7471281460861469B30928565, Payload) == 0x000000, "Member 'GA_TGF_LowHPEffect_C_EventReceived_57306CE7471281460861469B30928565::Payload' has a wrong offset!");

// Function GA_TGF_LowHPEffect.GA_TGF_LowHPEffect_C.ExecuteUbergraph_GA_TGF_LowHPEffect
// 0x0FE0 (0x0FE0 - 0x0000)
struct GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0010(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x00D8(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0190(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfDefendAttributeSet*                 K2Node_DynamicCast_AsTgf_Defend_Attribute_Set;     // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x01A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealthFinal_ReturnValue;            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULyraCameraComponent*                   CallFunc_FindCameraComponent_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendables                    CallFunc_DeletePostProcessMaterial_ReturnValue;    // 0x01E0(0x0010)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x01F0(0x06E0)()
	struct FWeightedBlendables                    CallFunc_InsertPostProcessMaterial_ReturnValue;    // 0x08D0(0x0010)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings_1;           // 0x08E0(0x06E0)()
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0FC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0FC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0FD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect) == 0x000010, "Wrong alignment on GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect");
static_assert(sizeof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect) == 0x000FE0, "Wrong size on GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, EntryPoint) == 0x000000, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, Temp_struct_Variable) == 0x000010, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0000C0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0000D0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, K2Node_CustomEvent_Payload) == 0x0000D8, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_IsValid_ReturnValue_1) == 0x000188, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_GetAttributeSet_ReturnValue) == 0x000190, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, K2Node_DynamicCast_AsTgf_Defend_Attribute_Set) == 0x000198, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::K2Node_DynamicCast_AsTgf_Defend_Attribute_Set' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, K2Node_CreateDelegate_OutputDelegate) == 0x0001A4, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_GetMaxHealthFinal_ReturnValue) == 0x0001B4, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_GetMaxHealthFinal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001B8, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0001C0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_FindCameraComponent_ReturnValue) == 0x0001D0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0001D8, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_IsValid_ReturnValue_2) == 0x0001D9, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_DeletePostProcessMaterial_ReturnValue) == 0x0001E0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_DeletePostProcessMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, K2Node_MakeStruct_PostProcessSettings) == 0x0001F0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_InsertPostProcessMaterial_ReturnValue) == 0x0008D0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_InsertPostProcessMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, K2Node_MakeStruct_PostProcessSettings_1) == 0x0008E0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::K2Node_MakeStruct_PostProcessSettings_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000FC0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000FC8, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000FD0, "Member 'GA_TGF_LowHPEffect_C_ExecuteUbergraph_GA_TGF_LowHPEffect::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

