#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_TalentFighter_HamstringWhenQ

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_TalentFighter_HamstringWhenQ.GA_TGF_TalentFighter_HamstringWhenQ_C.EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_TalentFighter_HamstringWhenQ_C_EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_TalentFighter_HamstringWhenQ_C_EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF) == 0x000008, "Wrong alignment on GA_TGF_TalentFighter_HamstringWhenQ_C_EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF");
static_assert(sizeof(GA_TGF_TalentFighter_HamstringWhenQ_C_EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF) == 0x0000B0, "Wrong size on GA_TGF_TalentFighter_HamstringWhenQ_C_EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF, Payload) == 0x000000, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_EventReceived_E044F1BE49AB087C8B2C79B307ED8ACF::Payload' has a wrong offset!");

// Function GA_TGF_TalentFighter_HamstringWhenQ.GA_TGF_TalentFighter_HamstringWhenQ_C.ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ
// 0x0218 (0x0218 - 0x0000)
struct GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTalentTag_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0018(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0188(0x0028)()
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01C0(0x0010)(ReferenceParm)
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ) == 0x000008, "Wrong alignment on GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ");
static_assert(sizeof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ) == 0x000218, "Wrong size on GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, EntryPoint) == 0x000000, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_HasTalentTag_ReturnValue) == 0x000004, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_HasTalentTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, K2Node_CustomEvent_Payload) == 0x000018, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, Temp_struct_Variable) == 0x0000C8, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000178, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000188, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, K2Node_DynamicCast_AsLyra_Character) == 0x0001B0, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0001C0, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0001D0, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, K2Node_Event_bWasCancelled) == 0x0001D8, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0001E0, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0001E8, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0001F8, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000200, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_CompareTeams_TeamIdA) == 0x000208, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_CompareTeams_TeamIdB) == 0x00020C, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, CallFunc_CompareTeams_ReturnValue) == 0x000210, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ, K2Node_SwitchEnum_CmpSuccess) == 0x000211, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_ExecuteUbergraph_GA_TGF_TalentFighter_HamstringWhenQ::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function GA_TGF_TalentFighter_HamstringWhenQ.GA_TGF_TalentFighter_HamstringWhenQ_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_TalentFighter_HamstringWhenQ_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_TalentFighter_HamstringWhenQ_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_TalentFighter_HamstringWhenQ_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_TalentFighter_HamstringWhenQ_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_TalentFighter_HamstringWhenQ_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_TalentFighter_HamstringWhenQ_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_TalentFighter_HamstringWhenQ_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

