#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_AboutToStealthAdvance

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_AboutToStealthAdvance.GA_TGF_AboutToStealthAdvance_C
// 0x0240 (0x0BE0 - 0x09A0)
class UGA_TGF_AboutToStealthAdvance_C : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTgfCharacterMovementExtensionComponent* ClientComp;                                        // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfCharacterMovementExtensionComponent* ServerComp;                                        // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          StealthApplied;                                    // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MonitorAddedServer;                                // 0x09B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MonitorAddedClient;                                // 0x09BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BB[0x1];                                      // 0x09BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            AppliedStealthGEHandle;                            // 0x09BC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4[0x4];                                      // 0x09C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    AppliedGEsHandle;                                  // 0x09C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           UITimer;                                           // 0x09D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTgfMovementMonitorConfig              ClientMonitor;                                     // 0x09E0(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTgfMovementMonitorConfig              ServerMonitor;                                     // 0x0AC8(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 EnterStealthGE;                                    // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         GEsToApplyWhenEnterStealthRemoveWhenLeave;         // 0x0BB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   StopGameplayEventTags;                             // 0x0BC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             BuffIcon;                                          // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DeInitServer();
	void EnterStealth();
	void EventReceived_8125D7364B761085852CDA9F0F2C1670(const struct FGameplayEventData& Payload);
	void EventReceived_DB0785F44DB4542CAAB40F8D89116B8C(const struct FGameplayEventData& Payload);
	void EventReceived_EE32CD074EDCCA65DF5578A916D06B19(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_AboutToStealthAdvance(int32 EntryPoint);
	void InitServer();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void LeaveStealth();
	void ResetMonitor();
	void TellClientForceReset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_AboutToStealthAdvance_C">();
	}
	static class UGA_TGF_AboutToStealthAdvance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_AboutToStealthAdvance_C>();
	}
};
static_assert(alignof(UGA_TGF_AboutToStealthAdvance_C) == 0x000010, "Wrong alignment on UGA_TGF_AboutToStealthAdvance_C");
static_assert(sizeof(UGA_TGF_AboutToStealthAdvance_C) == 0x000BE0, "Wrong size on UGA_TGF_AboutToStealthAdvance_C");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_AboutToStealthAdvance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, ClientComp) == 0x0009A8, "Member 'UGA_TGF_AboutToStealthAdvance_C::ClientComp' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, ServerComp) == 0x0009B0, "Member 'UGA_TGF_AboutToStealthAdvance_C::ServerComp' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, StealthApplied) == 0x0009B8, "Member 'UGA_TGF_AboutToStealthAdvance_C::StealthApplied' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, MonitorAddedServer) == 0x0009B9, "Member 'UGA_TGF_AboutToStealthAdvance_C::MonitorAddedServer' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, MonitorAddedClient) == 0x0009BA, "Member 'UGA_TGF_AboutToStealthAdvance_C::MonitorAddedClient' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, AppliedStealthGEHandle) == 0x0009BC, "Member 'UGA_TGF_AboutToStealthAdvance_C::AppliedStealthGEHandle' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, AppliedGEsHandle) == 0x0009C8, "Member 'UGA_TGF_AboutToStealthAdvance_C::AppliedGEsHandle' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, UITimer) == 0x0009D8, "Member 'UGA_TGF_AboutToStealthAdvance_C::UITimer' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, ClientMonitor) == 0x0009E0, "Member 'UGA_TGF_AboutToStealthAdvance_C::ClientMonitor' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, ServerMonitor) == 0x000AC8, "Member 'UGA_TGF_AboutToStealthAdvance_C::ServerMonitor' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, EnterStealthGE) == 0x000BB0, "Member 'UGA_TGF_AboutToStealthAdvance_C::EnterStealthGE' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, GEsToApplyWhenEnterStealthRemoveWhenLeave) == 0x000BB8, "Member 'UGA_TGF_AboutToStealthAdvance_C::GEsToApplyWhenEnterStealthRemoveWhenLeave' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, StopGameplayEventTags) == 0x000BC8, "Member 'UGA_TGF_AboutToStealthAdvance_C::StopGameplayEventTags' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AboutToStealthAdvance_C, BuffIcon) == 0x000BD8, "Member 'UGA_TGF_AboutToStealthAdvance_C::BuffIcon' has a wrong offset!");

}

