#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ.GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C.ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ
// 0x0120 (0x0120 - 0x0000)
struct GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00B0)(ConstParm)
	class UGameplayEffect*                        K2Node_DynamicCast_AsGameplay_Effect;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00D0(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectToTargetWithTags_ReturnValue; // 0x0110(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ) == 0x000008, "Wrong alignment on GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ");
static_assert(sizeof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ) == 0x000120, "Wrong size on GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, EntryPoint) == 0x000000, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, K2Node_Event_EventData) == 0x000010, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, K2Node_DynamicCast_AsGameplay_Effect) == 0x0000C0, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::K2Node_DynamicCast_AsGameplay_Effect' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000D0, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, CallFunc_GetObjectClass_ReturnValue) == 0x000100, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, CallFunc_Array_Contains_ReturnValue) == 0x000108, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000109, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ, CallFunc_ApplyGameplayEffectToTargetWithTags_ReturnValue) == 0x000110, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_ExecuteUbergraph_GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ::CallFunc_ApplyGameplayEffectToTargetWithTags_ReturnValue' has a wrong offset!");

// Function GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ.GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TalentSwordMaster_ReduceMoveSpeedWithSwordMasterQ_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

