#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TalentRogue_ExitStealthWithAction

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TalentRogue_ExitStealthWithAction.GA_TalentRogue_ExitStealthWithAction_C.ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction
// 0x0138 (0x0138 - 0x0000)
struct GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0008(0x0020)()
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0028(0x00B0)(ConstParm)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfGameplayEffect*                     K2Node_DynamicCast_AsTgf_Gameplay_Effect;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0100(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction) == 0x000008, "Wrong alignment on GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction");
static_assert(sizeof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction) == 0x000138, "Wrong size on GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, EntryPoint) == 0x000000, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000008, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, K2Node_Event_EventData) == 0x000028, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0000D8, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, K2Node_DynamicCast_AsTgf_Gameplay_Effect) == 0x0000E8, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::K2Node_DynamicCast_AsTgf_Gameplay_Effect' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000F1, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F2, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_Not_PreBool_ReturnValue) == 0x0000F3, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000F4, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, K2Node_Event_bWasCancelled) == 0x0000F5, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0000F8, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000100, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000120, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x000128, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000130, "Member 'GA_TalentRogue_ExitStealthWithAction_C_ExecuteUbergraph_GA_TalentRogue_ExitStealthWithAction::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_TalentRogue_ExitStealthWithAction.GA_TalentRogue_ExitStealthWithAction_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TalentRogue_ExitStealthWithAction_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TalentRogue_ExitStealthWithAction_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TalentRogue_ExitStealthWithAction_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TalentRogue_ExitStealthWithAction_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TalentRogue_ExitStealthWithAction_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TalentRogue_ExitStealthWithAction_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_TalentRogue_ExitStealthWithAction.GA_TalentRogue_ExitStealthWithAction_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TalentRogue_ExitStealthWithAction_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TalentRogue_ExitStealthWithAction_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TalentRogue_ExitStealthWithAction_C_K2_OnEndAbility");
static_assert(sizeof(GA_TalentRogue_ExitStealthWithAction_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TalentRogue_ExitStealthWithAction_C_K2_OnEndAbility");
static_assert(offsetof(GA_TalentRogue_ExitStealthWithAction_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TalentRogue_ExitStealthWithAction_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

