#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "AGRPRO_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Base.GA_TGF_Base_C.AddWeaponElement
// 0x00C0 (0x00C0 - 0x0000)
struct GA_TGF_Base_C_AddWeaponElement final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCurrentWeaponFirstActor_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfBattleElement                             CallFunc_GetWeaponElement_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_ParseBattleElementTagFromEnum_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0040(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETgfBattleElement                             CallFunc_GetWeaponElement_ReturnValue_1;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue_1;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_ParseBattleElementTagFromEnum_ReturnValue_1; // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x0090(0x0020)()
	class AActor*                                 CallFunc_GetCurrentWeaponFirstActor_ReturnValue_1; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Base_C_AddWeaponElement) == 0x000008, "Wrong alignment on GA_TGF_Base_C_AddWeaponElement");
static_assert(sizeof(GA_TGF_Base_C_AddWeaponElement) == 0x0000C0, "Wrong size on GA_TGF_Base_C_AddWeaponElement");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetCurrentWeaponFirstActor_ReturnValue) == 0x000010, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetCurrentWeaponFirstActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetWeaponElement_ReturnValue) == 0x000018, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetWeaponElement_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_ParseBattleElementTagFromEnum_ReturnValue) == 0x000034, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_ParseBattleElementTagFromEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000040, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000060, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000068, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetWeaponElement_ReturnValue_1) == 0x000070, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetWeaponElement_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_AddLooseGameplayTags_ReturnValue_1) == 0x000071, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_AddLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000078, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_ParseBattleElementTagFromEnum_ReturnValue_1) == 0x000088, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_ParseBattleElementTagFromEnum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x000090, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_GetCurrentWeaponFirstActor_ReturnValue_1) == 0x0000B0, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_GetCurrentWeaponFirstActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000B9, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_AddWeaponElement, CallFunc_BooleanAND_ReturnValue) == 0x0000BA, "Member 'GA_TGF_Base_C_AddWeaponElement::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GA_TGF_Base.GA_TGF_Base_C.Apply Counter
// 0x0050 (0x0050 - 0x0000)
struct GA_TGF_Base_C_Apply_Counter final
{
public:
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorType                                 CallFunc_GetActorType_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMonster_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Base_C_Apply_Counter) == 0x000008, "Wrong alignment on GA_TGF_Base_C_Apply_Counter");
static_assert(sizeof(GA_TGF_Base_C_Apply_Counter) == 0x000050, "Wrong size on GA_TGF_Base_C_Apply_Counter");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_K2_HasAuthority_ReturnValue) == 0x000000, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, K2Node_DynamicCast_AsLyra_Character) == 0x000008, "Member 'GA_TGF_Base_C_Apply_Counter::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GA_TGF_Base_C_Apply_Counter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_GetActorType_ReturnValue) == 0x000011, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_GetActorType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_IsMonster_ReturnValue) == 0x000012, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_IsMonster_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000013, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000018, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000028, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_IsValidClass_ReturnValue) == 0x000030, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_IsValidClass_ReturnValue_1) == 0x000031, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000038, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000040, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_Apply_Counter, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000048, "Member 'GA_TGF_Base_C_Apply_Counter::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_Base.GA_TGF_Base_C.ApplyAbilityHurtType
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_Base_C_ApplyAbilityHurtType final
{
public:
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Base_C_ApplyAbilityHurtType) == 0x000001, "Wrong alignment on GA_TGF_Base_C_ApplyAbilityHurtType");
static_assert(sizeof(GA_TGF_Base_C_ApplyAbilityHurtType) == 0x000001, "Wrong size on GA_TGF_Base_C_ApplyAbilityHurtType");
static_assert(offsetof(GA_TGF_Base_C_ApplyAbilityHurtType, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000000, "Member 'GA_TGF_Base_C_ApplyAbilityHurtType::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_TGF_Base.GA_TGF_Base_C.ApplyGuarded
// 0x0110 (0x0110 - 0x0000)
struct GA_TGF_Base_C_ApplyGuarded final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0010(0x00B0)()
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x00C0(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x00E8(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue_1;       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Base_C_ApplyGuarded) == 0x000008, "Wrong alignment on GA_TGF_Base_C_ApplyGuarded");
static_assert(sizeof(GA_TGF_Base_C_ApplyGuarded) == 0x000110, "Wrong size on GA_TGF_Base_C_ApplyGuarded");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, Result) == 0x000000, "Member 'GA_TGF_Base_C_ApplyGuarded::Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_Base_C_ApplyGuarded::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, K2Node_MakeStruct_GameplayEventData) == 0x000010, "Member 'GA_TGF_Base_C_ApplyGuarded::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0000C0, "Member 'GA_TGF_Base_C_ApplyGuarded::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x0000E0, "Member 'GA_TGF_Base_C_ApplyGuarded::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000E1, "Member 'GA_TGF_Base_C_ApplyGuarded::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x0000E8, "Member 'GA_TGF_Base_C_ApplyGuarded::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, CallFunc_AddLooseGameplayTags_ReturnValue_1) == 0x000108, "Member 'GA_TGF_Base_C_ApplyGuarded::CallFunc_AddLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyGuarded, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000109, "Member 'GA_TGF_Base_C_ApplyGuarded::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_Base.GA_TGF_Base_C.ApplyHitPartTag
// 0x0310 (0x0310 - 0x0000)
struct GA_TGF_Base_C_ApplyHitPartTag final
{
public:
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0008(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue; // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x01D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0208(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0258(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02A8(0x0010)(ReferenceParm)
	class UTgfCharacterAnimationHelperComponent*  CallFunc_GetComponentByClass_ReturnValue;          // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02C0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetTagFromBoneName_ReturnValue;           // 0x02F0(0x0020)(ConstParm)
};
static_assert(alignof(GA_TGF_Base_C_ApplyHitPartTag) == 0x000008, "Wrong alignment on GA_TGF_Base_C_ApplyHitPartTag");
static_assert(sizeof(GA_TGF_Base_C_ApplyHitPartTag) == 0x000310, "Wrong size on GA_TGF_Base_C_ApplyHitPartTag");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000000, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000008, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F0, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F1, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_Time) == 0x0000F4, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_Distance) == 0x0000F8, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_Location) == 0x000100, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_ImpactPoint) == 0x000118, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_Normal) == 0x000130, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_ImpactNormal) == 0x000148, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_BoneName) == 0x000180, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_HitItem) == 0x000188, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_ElementIndex) == 0x00018C, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_FaceIndex) == 0x000190, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_TraceStart) == 0x000198, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_BreakHitResult_TraceEnd) == 0x0001B0, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue) == 0x0001C8, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_Conv_NameToText_ReturnValue) == 0x0001D8, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_Conv_StringToText_ReturnValue) == 0x0001F0, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, K2Node_MakeStruct_FormatArgumentData) == 0x000208, "Member 'GA_TGF_Base_C_ApplyHitPartTag::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, K2Node_MakeStruct_FormatArgumentData_1) == 0x000258, "Member 'GA_TGF_Base_C_ApplyHitPartTag::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, K2Node_MakeArray_Array) == 0x0002A8, "Member 'GA_TGF_Base_C_ApplyHitPartTag::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_GetComponentByClass_ReturnValue) == 0x0002B8, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_Format_ReturnValue) == 0x0002C0, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_IsValid_ReturnValue) == 0x0002D8, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_Conv_TextToString_ReturnValue) == 0x0002E0, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyHitPartTag, CallFunc_GetTagFromBoneName_ReturnValue) == 0x0002F0, "Member 'GA_TGF_Base_C_ApplyHitPartTag::CallFunc_GetTagFromBoneName_ReturnValue' has a wrong offset!");

// Function GA_TGF_Base.GA_TGF_Base_C.ApplyMeleeWeaponEffect
// 0x0710 (0x0710 - 0x0000)
struct GA_TGF_Base_C_ApplyMeleeWeaponEffect final
{
public:
	struct FGameplayEventData                     MeleeWeaponEffectInputData;                        // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_EffectContextHasExtraParam_ReturnValue;   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_DecideGEsToUse_ResultGEs;                 // 0x00D0(0x0010)(ReferenceParm)
	TArray<class UClass*>                         CallFunc_DecideGEsToUse_ResultGEs_1;               // 0x00E0(0x0010)(ReferenceParm)
	TArray<class UClass*>                         CallFunc_DecideGEsToUse_ResultGEs_2;               // 0x00F0(0x0010)(ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWhichHandWeapon_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWhichHandWeapon_ReturnValue_1;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGuarded_Result;                      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHitIneractorEnviorment_Result;       // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHitInteractorBattle_Result;          // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0138(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_1;          // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue_2;          // 0x0208(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0220(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTgfGameplayEffectExtraParam           K2Node_MakeStruct_TgfGameplayEffectExtraParam;     // 0x02A8(0x0018)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x02D8(0x0020)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_4;  // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput_1;    // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer_1;      // 0x0310(0x0020)()
	struct FGameplayTagContainer                  CallFunc_GetSourceTags_Tags;                       // 0x0330(0x0020)()
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0350(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue; // 0x0438(0x00E0)(ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0520(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0538(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0540(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0548(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0568(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayEffect*                        CallFunc_BreakGameplayCueParameters_GameplayEffect; // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F2[0x6];                                      // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x05F8(0x00E0)(ContainsInstancedReference)
	bool                                          CallFunc_CheckGuarded_Result;                      // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F2[0x2];                                      // 0x06F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyGE_WeaponAttack_ImplicitCast;        // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyGE_WeaponAttack_ImplicitCast_1;      // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyGE_WeaponAttack_ImplicitCast_2;      // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EffectContextSetDirectionWeight_InTangentWeight_ImplicitCast; // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EffectContextSetDirectionWeight_InNormalWeight_ImplicitCast; // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_TangentWeight_ImplicitCast;      // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_NormalWeight_ImplicitCast;       // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Base_C_ApplyMeleeWeaponEffect) == 0x000008, "Wrong alignment on GA_TGF_Base_C_ApplyMeleeWeaponEffect");
static_assert(sizeof(GA_TGF_Base_C_ApplyMeleeWeaponEffect) == 0x000710, "Wrong size on GA_TGF_Base_C_ApplyMeleeWeaponEffect");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, MeleeWeaponEffectInputData) == 0x000000, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::MeleeWeaponEffectInputData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_EffectContextHasExtraParam_ReturnValue) == 0x0000B0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_EffectContextHasExtraParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0000B8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, K2Node_DynamicCast_AsActor) == 0x0000C0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, Temp_int_Array_Index_Variable) == 0x0000CC, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_DecideGEsToUse_ResultGEs) == 0x0000D0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_DecideGEsToUse_ResultGEs' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_DecideGEsToUse_ResultGEs_1) == 0x0000E0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_DecideGEsToUse_ResultGEs_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_DecideGEsToUse_ResultGEs_2) == 0x0000F0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_DecideGEsToUse_ResultGEs_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000100, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000108, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000110, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_IsWhichHandWeapon_ReturnValue) == 0x000118, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_IsWhichHandWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_IsWhichHandWeapon_ReturnValue_1) == 0x000119, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_IsWhichHandWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_IsValid_ReturnValue) == 0x00011A, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, Temp_int_Loop_Counter_Variable) == 0x00011C, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_ApplyGuarded_Result) == 0x000124, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_ApplyGuarded_Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Array_Get_Item) == 0x000128, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_CheckHitIneractorEnviorment_Result) == 0x000134, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_CheckHitIneractorEnviorment_Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000135, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_CheckHitInteractorBattle_Result) == 0x000136, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_CheckHitInteractorBattle_Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000138, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Conv_ObjectToText_ReturnValue_1) == 0x0001A0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Conv_ObjectToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001B8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Conv_ObjectToText_ReturnValue_2) == 0x000208, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Conv_ObjectToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, K2Node_MakeStruct_FormatArgumentData_2) == 0x000220, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, K2Node_MakeArray_Array) == 0x000270, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Format_ReturnValue) == 0x000280, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_Conv_TextToString_ReturnValue) == 0x000298, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, K2Node_MakeStruct_TgfGameplayEffectExtraParam) == 0x0002A8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::K2Node_MakeStruct_TgfGameplayEffectExtraParam' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x0002C0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x0002C8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x0002D8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_4) == 0x0002F8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetOwnedGameplayTags_self_CastInput_1) == 0x000300, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetOwnedGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetOwnedGameplayTags_TagContainer_1) == 0x000310, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetOwnedGameplayTags_TagContainer_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_GetSourceTags_Tags) == 0x000330, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_GetSourceTags_Tags' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000350, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue) == 0x000438, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_MakeGameplayCueParametersFromHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000518, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00051C, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000520, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000538, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000540, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000548, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000568, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_Location) == 0x000588, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_Normal) == 0x0005A0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0005B8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0005C0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0005C8, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GA_TGF_Base_C_ApplyMeleeWeaponEffect, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0005D0, "Member 'GA_TGF_Base_C_ApplyMeleeWeaponEffect::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
