#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_PassiveMove_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GA_TGF_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_PassiveMove_Base.GA_TGF_PassiveMove_Base_C
// 0x0090 (0x0D80 - 0x0CF0)
class UGA_TGF_PassiveMove_Base_C : public UGA_TGF_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CF0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Root_Motion_Priority;                              // 0x0CF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFC[0x4];                                      // 0x0CFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTgfGameplayAbilityTargetingPassiveMoveInfo PassiveMoveInfo;                                   // 0x0D00(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay)
	struct FVector                                TargetLocation;                                    // 0x0D40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x0D58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	class AActor*                                 SourceActor;                                       // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         Ignore_ZLimit;                                     // 0x0D78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestinationReachedButNotTimeOut_969887F24745E20880655BB5F443C75A();
	void ExecuteUbergraph_GA_TGF_PassiveMove_Base(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnTimedOut_969887F24745E20880655BB5F443C75A();
	void OnTimedOutAndDestinationReached_969887F24745E20880655BB5F443C75A();
	void PreMove(const struct FGameplayEventData& EventData);
	void UpdateTargetLocation();
	void UpdateTargetRotation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_PassiveMove_Base_C">();
	}
	static class UGA_TGF_PassiveMove_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_PassiveMove_Base_C>();
	}
};
static_assert(alignof(UGA_TGF_PassiveMove_Base_C) == 0x000010, "Wrong alignment on UGA_TGF_PassiveMove_Base_C");
static_assert(sizeof(UGA_TGF_PassiveMove_Base_C) == 0x000D80, "Wrong size on UGA_TGF_PassiveMove_Base_C");
static_assert(offsetof(UGA_TGF_PassiveMove_Base_C, UberGraphFrame) == 0x000CF0, "Member 'UGA_TGF_PassiveMove_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_PassiveMove_Base_C, Root_Motion_Priority) == 0x000CF8, "Member 'UGA_TGF_PassiveMove_Base_C::Root_Motion_Priority' has a wrong offset!");
static_assert(offsetof(UGA_TGF_PassiveMove_Base_C, PassiveMoveInfo) == 0x000D00, "Member 'UGA_TGF_PassiveMove_Base_C::PassiveMoveInfo' has a wrong offset!");
static_assert(offsetof(UGA_TGF_PassiveMove_Base_C, TargetLocation) == 0x000D40, "Member 'UGA_TGF_PassiveMove_Base_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UGA_TGF_PassiveMove_Base_C, TargetRotation) == 0x000D58, "Member 'UGA_TGF_PassiveMove_Base_C::TargetRotation' has a wrong offset!");
static_assert(offsetof(UGA_TGF_PassiveMove_Base_C, SourceActor) == 0x000D70, "Member 'UGA_TGF_PassiveMove_Base_C::SourceActor' has a wrong offset!");
static_assert(offsetof(UGA_TGF_PassiveMove_Base_C, Ignore_ZLimit) == 0x000D78, "Member 'UGA_TGF_PassiveMove_Base_C::Ignore_ZLimit' has a wrong offset!");

}

