#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_InspectWeapon

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.EventReceived_B71D637E40E7221B88AD73A05C97EDA4
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_InspectWeapon_C_EventReceived_B71D637E40E7221B88AD73A05C97EDA4 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_EventReceived_B71D637E40E7221B88AD73A05C97EDA4) == 0x000008, "Wrong alignment on GA_TGF_InspectWeapon_C_EventReceived_B71D637E40E7221B88AD73A05C97EDA4");
static_assert(sizeof(GA_TGF_InspectWeapon_C_EventReceived_B71D637E40E7221B88AD73A05C97EDA4) == 0x0000B0, "Wrong size on GA_TGF_InspectWeapon_C_EventReceived_B71D637E40E7221B88AD73A05C97EDA4");
static_assert(offsetof(GA_TGF_InspectWeapon_C_EventReceived_B71D637E40E7221B88AD73A05C97EDA4, Payload) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_EventReceived_B71D637E40E7221B88AD73A05C97EDA4::Payload' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.ExecuteUbergraph_GA_TGF_InspectWeapon
// 0x0330 (0x0330 - 0x0000)
struct GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x00A0(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0150(0x00B0)()
	TDelegate<void(class AActor* OwningActor)>    K2Node_CreateDelegate_OutputDelegate_6;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x0234(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0248(0x00B0)(ConstParm)
	class UAnimMontage*                           CallFunc_GetWeaponInspectMontage_ReturnValue;      // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayEvent*        CallFunc_WaitGameplayEventToActor_ReturnValue;     // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OwningActor;                    // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon) == 0x000008, "Wrong alignment on GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon");
static_assert(sizeof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon) == 0x000330, "Wrong size on GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, EntryPoint) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_NotifyName_5) == 0x000004, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_NotifyName_4) == 0x00000C, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_NotifyName_3) == 0x000024, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_NotifyName_2) == 0x00003C, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_NotifyName_1) == 0x000054, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_NotifyName) == 0x00006C, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, Temp_name_Variable) == 0x000084, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate_5) == 0x00008C, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_Payload) == 0x0000A0, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, Temp_struct_Variable) == 0x000150, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate_6) == 0x000200, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_K2_CommitAbility_ReturnValue) == 0x000210, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000218, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_IsValid_ReturnValue) == 0x000220, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_GetComponentByClass_ReturnValue) == 0x000228, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_IsValid_ReturnValue_1) == 0x000230, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CreateDelegate_OutputDelegate_7) == 0x000234, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_Event_EventData) == 0x000248, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_GetWeaponInspectMontage_ReturnValue) == 0x0002F8, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_GetWeaponInspectMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000300, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_IsValid_ReturnValue_2) == 0x000308, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_IsValid_ReturnValue_3) == 0x000309, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000310, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_WaitGameplayEventToActor_ReturnValue) == 0x000318, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_WaitGameplayEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, CallFunc_IsValid_ReturnValue_4) == 0x000320, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon, K2Node_CustomEvent_OwningActor) == 0x000328, "Member 'GA_TGF_InspectWeapon_C_ExecuteUbergraph_GA_TGF_InspectWeapon::K2Node_CustomEvent_OwningActor' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_InspectWeapon_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_InspectWeapon_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_InspectWeapon_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_InspectWeapon_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_InspectWeapon_C_OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000004, "Wrong alignment on GA_TGF_InspectWeapon_C_OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(sizeof(GA_TGF_InspectWeapon_C_OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000008, "Wrong size on GA_TGF_InspectWeapon_C_OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(offsetof(GA_TGF_InspectWeapon_C_OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C, NotifyName) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_OnBlendOut_40E77A824EEDFCDBAAC8C6B705F7ED6C::NotifyName' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_InspectWeapon_C_OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000004, "Wrong alignment on GA_TGF_InspectWeapon_C_OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(sizeof(GA_TGF_InspectWeapon_C_OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000008, "Wrong size on GA_TGF_InspectWeapon_C_OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(offsetof(GA_TGF_InspectWeapon_C_OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C, NotifyName) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_OnCancelled_40E77A824EEDFCDBAAC8C6B705F7ED6C::NotifyName' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_InspectWeapon_C_OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000004, "Wrong alignment on GA_TGF_InspectWeapon_C_OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(sizeof(GA_TGF_InspectWeapon_C_OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000008, "Wrong size on GA_TGF_InspectWeapon_C_OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(offsetof(GA_TGF_InspectWeapon_C_OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C, NotifyName) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_OnCompleted_40E77A824EEDFCDBAAC8C6B705F7ED6C::NotifyName' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.OnDeathStart
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_InspectWeapon_C_OnDeathStart final
{
public:
	class AActor*                                 OwningActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_OnDeathStart) == 0x000008, "Wrong alignment on GA_TGF_InspectWeapon_C_OnDeathStart");
static_assert(sizeof(GA_TGF_InspectWeapon_C_OnDeathStart) == 0x000008, "Wrong size on GA_TGF_InspectWeapon_C_OnDeathStart");
static_assert(offsetof(GA_TGF_InspectWeapon_C_OnDeathStart, OwningActor) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_OnDeathStart::OwningActor' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_InspectWeapon_C_OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000004, "Wrong alignment on GA_TGF_InspectWeapon_C_OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(sizeof(GA_TGF_InspectWeapon_C_OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000008, "Wrong size on GA_TGF_InspectWeapon_C_OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(offsetof(GA_TGF_InspectWeapon_C_OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C, NotifyName) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_OnInterrupted_40E77A824EEDFCDBAAC8C6B705F7ED6C::NotifyName' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_InspectWeapon_C_OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000004, "Wrong alignment on GA_TGF_InspectWeapon_C_OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(sizeof(GA_TGF_InspectWeapon_C_OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000008, "Wrong size on GA_TGF_InspectWeapon_C_OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(offsetof(GA_TGF_InspectWeapon_C_OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C, NotifyName) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_OnNotifyBegin_40E77A824EEDFCDBAAC8C6B705F7ED6C::NotifyName' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C
// 0x0008 (0x0008 - 0x0000)
struct GA_TGF_InspectWeapon_C_OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000004, "Wrong alignment on GA_TGF_InspectWeapon_C_OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(sizeof(GA_TGF_InspectWeapon_C_OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C) == 0x000008, "Wrong size on GA_TGF_InspectWeapon_C_OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C");
static_assert(offsetof(GA_TGF_InspectWeapon_C_OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C, NotifyName) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_OnNotifyEnd_40E77A824EEDFCDBAAC8C6B705F7ED6C::NotifyName' has a wrong offset!");

// Function GA_TGF_InspectWeapon.GA_TGF_InspectWeapon_C.K2_CanActivateAbility
// 0x00A8 (0x00A8 - 0x0000)
struct GA_TGF_InspectWeapon_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_CheckCharacterStateValid_RelevantTags;    // 0x0080(0x0020)()
	bool                                          CallFunc_CheckCharacterStateValid_Result;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_TGF_InspectWeapon_C_K2_CanActivateAbility");
static_assert(sizeof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility) == 0x0000A8, "Wrong size on GA_TGF_InspectWeapon_C_K2_CanActivateAbility");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, CallFunc_CheckCharacterStateValid_RelevantTags) == 0x000080, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::CallFunc_CheckCharacterStateValid_RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, CallFunc_CheckCharacterStateValid_Result) == 0x0000A0, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::CallFunc_CheckCharacterStateValid_Result' has a wrong offset!");
static_assert(offsetof(GA_TGF_InspectWeapon_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'GA_TGF_InspectWeapon_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

