#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TalentRogue_EnterStealthWithKill

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TalentRogue_EnterStealthWithKill.GA_TalentRogue_EnterStealthWithKill_C.ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill
// 0x0160 (0x0160 - 0x0000)
struct GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00B0)(ConstParm)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_DynamicCast_AsBP_Tgf_Character_Default;     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x012C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2; // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill) == 0x000008, "Wrong alignment on GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill");
static_assert(sizeof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill) == 0x000160, "Wrong size on GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, EntryPoint) == 0x000000, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, K2Node_Event_EventData) == 0x000010, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, K2Node_DynamicCast_AsBP_Tgf_Character_Default) == 0x0000C8, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::K2Node_DynamicCast_AsBP_Tgf_Character_Default' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0000D8, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x0000E0, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0000E8, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000F8, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000100, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000110, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000118, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_CompareTeams_TeamIdA) == 0x000120, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_CompareTeams_TeamIdB) == 0x000124, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_CompareTeams_ReturnValue) == 0x000128, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x00012C, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, K2Node_SwitchEnum_CmpSuccess) == 0x000134, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3) == 0x000138, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2) == 0x000140, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000148, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000158, "Member 'GA_TalentRogue_EnterStealthWithKill_C_ExecuteUbergraph_GA_TalentRogue_EnterStealthWithKill::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");

// Function GA_TalentRogue_EnterStealthWithKill.GA_TalentRogue_EnterStealthWithKill_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TalentRogue_EnterStealthWithKill_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TalentRogue_EnterStealthWithKill_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TalentRogue_EnterStealthWithKill_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TalentRogue_EnterStealthWithKill_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TalentRogue_EnterStealthWithKill_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TalentRogue_EnterStealthWithKill_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TalentRogue_EnterStealthWithKill_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

