#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_PassiveMove_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_PassiveMove_Base.GA_TGF_PassiveMove_Base_C.ExecuteUbergraph_GA_TGF_PassiveMove_Base
// 0x0238 (0x0238 - 0x0000)
struct GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0028(0x00B0)(ConstParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTgfGameplayAbilityTargetData_PassiveMove CallFunc_GetTargetDataPassiveMoveInfo_ReturnValue; // 0x00E0(0x0048)(ConstParm)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0148(0x00B0)()
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyTgfMoveToForce*       CallFunc_ApplyTgfMoveToForce_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base) == 0x000008, "Wrong alignment on GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base");
static_assert(sizeof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base) == 0x000238, "Wrong size on GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, EntryPoint) == 0x000000, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, K2Node_Event_EventData) == 0x000028, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000D8, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_GetTargetDataPassiveMoveInfo_ReturnValue) == 0x0000E0, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_GetTargetDataPassiveMoveInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, K2Node_DynamicCast_AsLyra_Character) == 0x000128, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000138, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000140, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000141, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, K2Node_CustomEvent_EventData) == 0x000148, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_K2_HasAuthority_ReturnValue) == 0x0001F8, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001FC, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_ApplyTgfMoveToForce_ReturnValue) == 0x000210, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_ApplyTgfMoveToForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_IsValid_ReturnValue_1) == 0x000218, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000220, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000228, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base, CallFunc_Delay_Duration_ImplicitCast) == 0x000230, "Member 'GA_TGF_PassiveMove_Base_C_ExecuteUbergraph_GA_TGF_PassiveMove_Base::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function GA_TGF_PassiveMove_Base.GA_TGF_PassiveMove_Base_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_PassiveMove_Base_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_PassiveMove_Base_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_PassiveMove_Base_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_PassiveMove_Base_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_PassiveMove_Base_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_PassiveMove_Base_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_TGF_PassiveMove_Base.GA_TGF_PassiveMove_Base_C.PreMove
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_PassiveMove_Base_C_PreMove final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_PassiveMove_Base_C_PreMove) == 0x000008, "Wrong alignment on GA_TGF_PassiveMove_Base_C_PreMove");
static_assert(sizeof(GA_TGF_PassiveMove_Base_C_PreMove) == 0x0000B0, "Wrong size on GA_TGF_PassiveMove_Base_C_PreMove");
static_assert(offsetof(GA_TGF_PassiveMove_Base_C_PreMove, EventData) == 0x000000, "Member 'GA_TGF_PassiveMove_Base_C_PreMove::EventData' has a wrong offset!");

}

