#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_BrightTorch_Base

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_BrightTorch_Base.GA_TGF_BrightTorch_Base_C.ExecuteUbergraph_GA_TGF_BrightTorch_Base
// 0x03C8 (0x03C8 - 0x0000)
struct GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_9;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0144(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x018C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x01A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x01BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorType                                 CallFunc_GetActorType_ReturnValue;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEliteMonster_ReturnValue;               // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMontageRate_ReturnValue;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x020C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayMontageDelayInfo_DelayTime;        // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfActorType                                 CallFunc_GetActorType_ReturnValue_1;               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMontageRate_ReturnValue_1;             // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEliteMonster_ReturnValue_1;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue_1;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayMontageDelayInfo_DelayTime_1;      // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickBestCastSkillMontage_FindMontage;     // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickBestCastSkillMontage_SectionName;     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickBestCastSkillMontage_ReturnValue;     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickBestCastSkillMontage_FindMontage_1;   // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickBestCastSkillMontage_SectionName_1;   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickBestCastSkillMontage_ReturnValue_1;   // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3; // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCurrentWeaponFirstActor_ReturnValue;   // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfActorType                                 CallFunc_GetActorType_ReturnValue_2;               // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEliteMonster_ReturnValue_2;             // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue_2;                   // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Torch_001_C*                         K2Node_DynamicCast_AsB_Torch_001;                  // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB[0x1];                                      // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayMontageDelayInfo_DelayTime_2;      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_2;            // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMontageRate_ReturnValue_2;             // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x02CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InGameReportClientTaskProgressValueWithCharacterParam_ReturnValue; // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0300(0x0020)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0330(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x0360(0x0020)()
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue_1;    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickBestCastSkillMontage_FindMontage_2;   // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickBestCastSkillMontage_SectionName_2;   // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickBestCastSkillMontage_ReturnValue_2;   // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base) == 0x000008, "Wrong alignment on GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base");
static_assert(sizeof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base) == 0x0003C8, "Wrong size on GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, EntryPoint) == 0x000000, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_15) == 0x000004, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_15' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_14) == 0x00000C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_13) == 0x000024, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_12) == 0x00003C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, Temp_name_Variable) == 0x000054, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_MakeLiteralByte_ReturnValue) == 0x00005C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_11) == 0x000060, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_10) == 0x000078, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x000080, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_9) == 0x000090, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_5) == 0x000098, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_8) == 0x0000A8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_7) == 0x0000C0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_6) == 0x0000D8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000E0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, Temp_name_Variable_1) == 0x0000F0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000F8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_TimeHeld) == 0x0000FC, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_9) == 0x000100, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, Temp_real_Variable) == 0x000110, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_WaitInputRelease_ReturnValue) == 0x000118, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_10) == 0x000124, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_5) == 0x000134, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_4) == 0x00013C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_11) == 0x000144, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_3) == 0x000154, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_12) == 0x00015C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_2) == 0x00016C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_13) == 0x000174, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_1) == 0x000184, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_14) == 0x00018C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName) == 0x00019C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_15) == 0x0001A4, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, Temp_name_Variable_2) == 0x0001B4, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_16) == 0x0001BC, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_17) == 0x0001CC, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_18) == 0x0001DC, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0001F0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_17) == 0x0001F8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_17' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetActorType_ReturnValue) == 0x000200, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetActorType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsEliteMonster_ReturnValue) == 0x000201, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsEliteMonster_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsPlayer_ReturnValue) == 0x000202, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetMontageRate_ReturnValue) == 0x000204, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetMontageRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_BooleanOR_ReturnValue) == 0x000208, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000209, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CreateDelegate_OutputDelegate_19) == 0x00020C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetPlayMontageDelayInfo_DelayTime) == 0x00021C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetPlayMontageDelayInfo_DelayTime' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000220, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetActorType_ReturnValue_1) == 0x000228, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetActorType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetMontageRate_ReturnValue_1) == 0x00022C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetMontageRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsEliteMonster_ReturnValue_1) == 0x000230, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsEliteMonster_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsPlayer_ReturnValue_1) == 0x000231, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_BooleanOR_ReturnValue_1) == 0x000232, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_Not_PreBool_ReturnValue_1) == 0x000233, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_Event_bWasCancelled) == 0x000234, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetPlayMontageDelayInfo_DelayTime_1) == 0x000238, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetPlayMontageDelayInfo_DelayTime_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_K2_CommitAbility_ReturnValue) == 0x00023C, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_FindMontage) == 0x000240, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_FindMontage' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_SectionName) == 0x000248, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_SectionName' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_ReturnValue) == 0x000250, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_FindMontage_1) == 0x000258, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_FindMontage_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_SectionName_1) == 0x000260, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_SectionName_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_ReturnValue_1) == 0x000268, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000270, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue_1) == 0x000278, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_K2_HasAuthority_ReturnValue) == 0x000279, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x00027A, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x000280, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3) == 0x000288, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetCurrentWeaponFirstActor_ReturnValue) == 0x000290, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetCurrentWeaponFirstActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetActorType_ReturnValue_2) == 0x000298, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetActorType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue_2) == 0x000299, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsEliteMonster_ReturnValue_2) == 0x00029A, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsEliteMonster_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsPlayer_ReturnValue_2) == 0x00029B, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_DynamicCast_AsB_Torch_001) == 0x0002A0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_DynamicCast_AsB_Torch_001' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_DynamicCast_bSuccess) == 0x0002A8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_BooleanOR_ReturnValue_2) == 0x0002A9, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002AA, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetPlayMontageDelayInfo_DelayTime_2) == 0x0002AC, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetPlayMontageDelayInfo_DelayTime_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue_3) == 0x0002B0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue_4) == 0x0002B1, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_K2_HasAuthority_ReturnValue_2) == 0x0002B2, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_K2_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue_5) == 0x0002B3, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002B4, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetMontageRate_ReturnValue_2) == 0x0002B8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetMontageRate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x0002C0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue_6) == 0x0002C8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, K2Node_CustomEvent_NotifyName_16) == 0x0002CC, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::K2Node_CustomEvent_NotifyName_16' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0002D4, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4) == 0x0002D8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0002E0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_InGameReportClientTaskProgressValueWithCharacterParam_ReturnValue) == 0x0002E8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_InGameReportClientTaskProgressValueWithCharacterParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002F0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5) == 0x0002F8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000300, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6) == 0x000320, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000328, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000330, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000350, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000351, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7) == 0x000358, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x000360, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_RemoveLooseGameplayTags_ReturnValue_1) == 0x000380, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_RemoveLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_FindMontage_2) == 0x000388, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_FindMontage_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_SectionName_2) == 0x000390, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_SectionName_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_PickBestCastSkillMontage_ReturnValue_2) == 0x000398, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_PickBestCastSkillMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2) == 0x0003A0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_IsValid_ReturnValue_7) == 0x0003A8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0003B0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0003B8, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0003C0, "Member 'GA_TGF_BrightTorch_Base_C_ExecuteUbergraph_GA_TGF_BrightTorch_Base::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function GA_TGF_BrightTorch_Base.GA_TGF_BrightTorch_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
