#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_LowHPEffect

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_LowHPEffect.GA_TGF_LowHPEffect_C
// 0x0020 (0x09C0 - 0x09A0)
class UGA_TGF_LowHPEffect_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        LowHPPercent;                                      // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      LowHPMat;                                          // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEffectPlay;                                       // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckLowHPEffect();
	void EventReceived_57306CE7471281460861469B30928565(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_LowHPEffect(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_LowHPEffect_C">();
	}
	static class UGA_TGF_LowHPEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_LowHPEffect_C>();
	}
};
static_assert(alignof(UGA_TGF_LowHPEffect_C) == 0x000010, "Wrong alignment on UGA_TGF_LowHPEffect_C");
static_assert(sizeof(UGA_TGF_LowHPEffect_C) == 0x0009C0, "Wrong size on UGA_TGF_LowHPEffect_C");
static_assert(offsetof(UGA_TGF_LowHPEffect_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_LowHPEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_LowHPEffect_C, LowHPPercent) == 0x0009A8, "Member 'UGA_TGF_LowHPEffect_C::LowHPPercent' has a wrong offset!");
static_assert(offsetof(UGA_TGF_LowHPEffect_C, LowHPMat) == 0x0009B0, "Member 'UGA_TGF_LowHPEffect_C::LowHPMat' has a wrong offset!");
static_assert(offsetof(UGA_TGF_LowHPEffect_C, bEffectPlay) == 0x0009B8, "Member 'UGA_TGF_LowHPEffect_C::bEffectPlay' has a wrong offset!");

}

