#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_DisengageEffect

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_DisengageEffect.GA_TGF_DisengageEffect_C.EventReceived_5F531DCD440A6F031EE75AB0B60B9A12
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_DisengageEffect_C_EventReceived_5F531DCD440A6F031EE75AB0B60B9A12 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_DisengageEffect_C_EventReceived_5F531DCD440A6F031EE75AB0B60B9A12) == 0x000008, "Wrong alignment on GA_TGF_DisengageEffect_C_EventReceived_5F531DCD440A6F031EE75AB0B60B9A12");
static_assert(sizeof(GA_TGF_DisengageEffect_C_EventReceived_5F531DCD440A6F031EE75AB0B60B9A12) == 0x0000B0, "Wrong size on GA_TGF_DisengageEffect_C_EventReceived_5F531DCD440A6F031EE75AB0B60B9A12");
static_assert(offsetof(GA_TGF_DisengageEffect_C_EventReceived_5F531DCD440A6F031EE75AB0B60B9A12, Payload) == 0x000000, "Member 'GA_TGF_DisengageEffect_C_EventReceived_5F531DCD440A6F031EE75AB0B60B9A12::Payload' has a wrong offset!");

// Function GA_TGF_DisengageEffect.GA_TGF_DisengageEffect_C.EventReceived_E0FEE7EA44163EC31084908A4D1A81D0
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_DisengageEffect_C_EventReceived_E0FEE7EA44163EC31084908A4D1A81D0 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_DisengageEffect_C_EventReceived_E0FEE7EA44163EC31084908A4D1A81D0) == 0x000008, "Wrong alignment on GA_TGF_DisengageEffect_C_EventReceived_E0FEE7EA44163EC31084908A4D1A81D0");
static_assert(sizeof(GA_TGF_DisengageEffect_C_EventReceived_E0FEE7EA44163EC31084908A4D1A81D0) == 0x0000B0, "Wrong size on GA_TGF_DisengageEffect_C_EventReceived_E0FEE7EA44163EC31084908A4D1A81D0");
static_assert(offsetof(GA_TGF_DisengageEffect_C_EventReceived_E0FEE7EA44163EC31084908A4D1A81D0, Payload) == 0x000000, "Member 'GA_TGF_DisengageEffect_C_EventReceived_E0FEE7EA44163EC31084908A4D1A81D0::Payload' has a wrong offset!");

// Function GA_TGF_DisengageEffect.GA_TGF_DisengageEffect_C.ExecuteUbergraph_GA_TGF_DisengageEffect
// 0x0588 (0x0588 - 0x0000)
struct GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0008(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x00D8(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0188(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0288(0x00B0)()
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0350(0x0020)()
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0390(0x0020)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x03B8(0x0020)()
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x03FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Immediately;                    // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3; // 0x0410(0x0020)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3; // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_4; // 0x0438(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue_1;       // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4; // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_5; // 0x0468(0x0020)()
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue_1;    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5; // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_6; // 0x0498(0x0020)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6; // 0x04B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_7; // 0x04C0(0x0020)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7; // 0x04E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x04E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_8; // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_9; // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CompareTeams_TeamIdA_1;                   // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB_1;                   // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue_1;               // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0525(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_526[0x2];                                      // 0x0526(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0528(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0538(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0548(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item_2;                         // 0x055C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item_3;                         // 0x056C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect) == 0x000008, "Wrong alignment on GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect");
static_assert(sizeof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect) == 0x000588, "Wrong size on GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, EntryPoint) == 0x000000, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_struct_Variable) == 0x000008, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0000B8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_CustomEvent_Payload) == 0x0000D8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_struct_Variable_1) == 0x000188, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000238, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_IsValid_ReturnValue_1) == 0x000240, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000248, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000250, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000260, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Array_Index_Variable) == 0x000268, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Loop_Counter_Variable) == 0x00026C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000270, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Loop_Counter_Variable_1) == 0x000274, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Loop_Counter_Variable_2) == 0x000278, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Add_IntInt_ReturnValue_1) == 0x00027C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Add_IntInt_ReturnValue_2) == 0x000280, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Array_Index_Variable_1) == 0x000284, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_CustomEvent_Payload_1) == 0x000288, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Array_Index_Variable_2) == 0x000338, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Loop_Counter_Variable_3) == 0x00033C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Add_IntInt_ReturnValue_3) == 0x000340, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, Temp_int_Array_Index_Variable_3) == 0x000344, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_Event_bWasCancelled) == 0x000348, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000350, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000370, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000378, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000380, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x000388, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000390, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0003B0, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x0003B8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x0003D8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x0003E0, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_K2_CommitAbility_ReturnValue) == 0x0003E8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Get_Item) == 0x0003F0, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Length_ReturnValue) == 0x0003F8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0003FC, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000404, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Add_ReturnValue) == 0x000408, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_CustomEvent_Immediately) == 0x00040C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_CustomEvent_Immediately' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3) == 0x000410, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3) == 0x000430, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_4) == 0x000438, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_AddLooseGameplayTags_ReturnValue_1) == 0x000458, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_AddLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4) == 0x000460, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_5) == 0x000468, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_RemoveLooseGameplayTags_ReturnValue_1) == 0x000488, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_RemoveLooseGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5) == 0x000490, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_6) == 0x000498, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6) == 0x0004B8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_7) == 0x0004C0, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7) == 0x0004E0, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_CreateDelegate_OutputDelegate_2) == 0x0004E8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_8) == 0x0004F8, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_CompareTeams_TeamIdA) == 0x000500, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_CompareTeams_TeamIdB) == 0x000504, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_CompareTeams_ReturnValue) == 0x000508, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_9) == 0x000510, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_SwitchEnum_CmpSuccess) == 0x000518, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_CompareTeams_TeamIdA_1) == 0x00051C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_CompareTeams_TeamIdA_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_CompareTeams_TeamIdB_1) == 0x000520, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_CompareTeams_TeamIdB_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_CompareTeams_ReturnValue_1) == 0x000524, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_CompareTeams_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_SwitchEnum_CmpSuccess_1) == 0x000525, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, K2Node_CreateDelegate_OutputDelegate_3) == 0x000528, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000538, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Get_Item_1) == 0x000540, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000548, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Length_ReturnValue_1) == 0x000550, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Less_IntInt_ReturnValue_1) == 0x000554, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Add_ReturnValue_1) == 0x000558, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Get_Item_2) == 0x00055C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Length_ReturnValue_2) == 0x000564, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Less_IntInt_ReturnValue_2) == 0x000568, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Get_Item_3) == 0x00056C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Array_Length_ReturnValue_3) == 0x000574, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_Less_IntInt_ReturnValue_3) == 0x000578, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00057C, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000580, "Member 'GA_TGF_DisengageEffect_C_ExecuteUbergraph_GA_TGF_DisengageEffect::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function GA_TGF_DisengageEffect.GA_TGF_DisengageEffect_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_DisengageEffect_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_DisengageEffect_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_DisengageEffect_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_DisengageEffect_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_DisengageEffect_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_DisengageEffect_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_DisengageEffect_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_TGF_DisengageEffect.GA_TGF_DisengageEffect_C.RemoveDisengageGE
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_DisengageEffect_C_RemoveDisengageGE final
{
public:
	bool                                          Immediately;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_DisengageEffect_C_RemoveDisengageGE) == 0x000001, "Wrong alignment on GA_TGF_DisengageEffect_C_RemoveDisengageGE");
static_assert(sizeof(GA_TGF_DisengageEffect_C_RemoveDisengageGE) == 0x000001, "Wrong size on GA_TGF_DisengageEffect_C_RemoveDisengageGE");
static_assert(offsetof(GA_TGF_DisengageEffect_C_RemoveDisengageGE, Immediately) == 0x000000, "Member 'GA_TGF_DisengageEffect_C_RemoveDisengageGE::Immediately' has a wrong offset!");

}

