#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_InteractWithMap

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_InteractWithMap.GA_TGF_InteractWithMap_C.AddWeaponTags
// 0x0010 (0x0010 - 0x0000)
struct GA_TGF_InteractWithMap_C_AddWeaponTags final
{
public:
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCurrentWeaponSlotType_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InteractWithMap_C_AddWeaponTags) == 0x000008, "Wrong alignment on GA_TGF_InteractWithMap_C_AddWeaponTags");
static_assert(sizeof(GA_TGF_InteractWithMap_C_AddWeaponTags) == 0x000010, "Wrong size on GA_TGF_InteractWithMap_C_AddWeaponTags");
static_assert(offsetof(GA_TGF_InteractWithMap_C_AddWeaponTags, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_TGF_InteractWithMap_C_AddWeaponTags::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_AddWeaponTags, CallFunc_CheckCurrentWeaponSlotType_ReturnValue) == 0x000008, "Member 'GA_TGF_InteractWithMap_C_AddWeaponTags::CallFunc_CheckCurrentWeaponSlotType_ReturnValue' has a wrong offset!");

// Function GA_TGF_InteractWithMap.GA_TGF_InteractWithMap_C.EventReceived_F6B4200B400FD5A548B047AC89BCCBAF
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_InteractWithMap_C_EventReceived_F6B4200B400FD5A548B047AC89BCCBAF final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_InteractWithMap_C_EventReceived_F6B4200B400FD5A548B047AC89BCCBAF) == 0x000008, "Wrong alignment on GA_TGF_InteractWithMap_C_EventReceived_F6B4200B400FD5A548B047AC89BCCBAF");
static_assert(sizeof(GA_TGF_InteractWithMap_C_EventReceived_F6B4200B400FD5A548B047AC89BCCBAF) == 0x0000B0, "Wrong size on GA_TGF_InteractWithMap_C_EventReceived_F6B4200B400FD5A548B047AC89BCCBAF");
static_assert(offsetof(GA_TGF_InteractWithMap_C_EventReceived_F6B4200B400FD5A548B047AC89BCCBAF, Payload) == 0x000000, "Member 'GA_TGF_InteractWithMap_C_EventReceived_F6B4200B400FD5A548B047AC89BCCBAF::Payload' has a wrong offset!");

// Function GA_TGF_InteractWithMap.GA_TGF_InteractWithMap_C.ExecuteUbergraph_GA_TGF_InteractWithMap
// 0x0530 (0x0530 - 0x0000)
struct GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_11;           // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0154(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0168(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0218(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default;          // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentManagerComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckWeaponAnim_ReturnValue;              // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_303[0x1];                                      // 0x0303(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0304(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickBestCastSkillMontage_FindMontage;     // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickBestCastSkillMontage_SectionName;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickBestCastSkillMontage_ReturnValue;     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0350(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3; // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_1;        // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue_1;             // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated_2;        // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue_2;             // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExecuteActionImp_ReturnValue;             // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_MapInteractionComponent_C*          CallFunc_GetMapInteractionComponent_Component;     // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ExecuteActionImp_ReturnValue_1;           // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PickBestCastSkillMontage_FindMontage_1;   // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickBestCastSkillMontage_SectionName_1;   // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PickBestCastSkillMontage_ReturnValue_1;   // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5; // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1;        // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6; // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default_2;        // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCurrentWeaponSlotType_ReturnValue;   // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B[0x1];                                      // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x041C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0436(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_437[0x1];                                      // 0x0437(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0448(0x0020)()
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0468(0x0020)()
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0488(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7; // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Hero_Default_C*                 K2Node_DynamicCast_AsBP_Tgf_Hero_Default_3;        // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_2;            // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AA[0x6];                                      // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_8; // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x04B8(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1; // 0x04E0(0x0020)()
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_9; // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayerInteract_bCanInteract;           // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0514(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_10; // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap) == 0x000008, "Wrong alignment on GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap");
static_assert(sizeof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap) == 0x000530, "Wrong size on GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, EntryPoint) == 0x000000, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_10) == 0x000004, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_9) == 0x00000C, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_8) == 0x000024, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_7) == 0x00003C, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_6) == 0x000054, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, Temp_name_Variable) == 0x00006C, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, Temp_delegate_Variable) == 0x000074, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_4) == 0x000084, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_5) == 0x000094, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue) == 0x0000A4, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A5, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_5) == 0x0000A8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_4) == 0x0000B0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_3) == 0x0000C8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000D0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_2) == 0x0000E0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000E8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_1) == 0x0000F8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_9) == 0x000100, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName) == 0x000110, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_10) == 0x000118, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, Temp_name_Variable_1) == 0x000128, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_11) == 0x000130, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_TimeHeld) == 0x000140, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, Temp_real_Variable) == 0x000144, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_WaitInputRelease_ReturnValue) == 0x000148, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_12) == 0x000154, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_Payload) == 0x000168, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, Temp_struct_Variable) == 0x000218, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_2) == 0x0002C8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, Temp_int_Loop_Counter_Variable) == 0x0002CC, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_Add_IntInt_ReturnValue) == 0x0002D0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, Temp_int_Array_Index_Variable) == 0x0002D4, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CustomEvent_NotifyName_11) == 0x0002D8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0002E0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_AsBP_Tgf_Hero_Default) == 0x0002E8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_AsBP_Tgf_Hero_Default' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetComponentByClass_ReturnValue) == 0x0002F8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_3) == 0x000300, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_CheckWeaponAnim_ReturnValue) == 0x000301, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_CheckWeaponAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_Event_bWasCancelled) == 0x000302, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_CreateDelegate_OutputDelegate_13) == 0x000304, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_PickBestCastSkillMontage_FindMontage) == 0x000318, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_PickBestCastSkillMontage_FindMontage' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_PickBestCastSkillMontage_SectionName) == 0x000320, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_PickBestCastSkillMontage_SectionName' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_PickBestCastSkillMontage_ReturnValue) == 0x000328, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_PickBestCastSkillMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000330, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_4) == 0x000338, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_5) == 0x000339, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x000340, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x000348, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000350, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3) == 0x000358, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetAkComponent_ComponentCreated) == 0x000360, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetAkComponent_ReturnValue) == 0x000368, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000370, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4) == 0x000378, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetAkComponent_ComponentCreated_1) == 0x000380, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetAkComponent_ComponentCreated_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetAkComponent_ReturnValue_1) == 0x000388, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetAkComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_6) == 0x000390, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000398, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetAkComponent_ComponentCreated_2) == 0x0003A0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetAkComponent_ComponentCreated_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetAkComponent_ReturnValue_2) == 0x0003A8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetAkComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_PostAkEvent_ReturnValue) == 0x0003B0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_ExecuteActionImp_ReturnValue) == 0x0003B4, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_ExecuteActionImp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetMapInteractionComponent_Component) == 0x0003B8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetMapInteractionComponent_Component' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_ExecuteActionImp_ReturnValue_1) == 0x0003C0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_ExecuteActionImp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_7) == 0x0003C4, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_PickBestCastSkillMontage_FindMontage_1) == 0x0003C8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_PickBestCastSkillMontage_FindMontage_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_PickBestCastSkillMontage_SectionName_1) == 0x0003D0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_PickBestCastSkillMontage_SectionName_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_PickBestCastSkillMontage_ReturnValue_1) == 0x0003D8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_PickBestCastSkillMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_8) == 0x0003D9, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x0003E0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_9) == 0x0003E8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_10) == 0x0003E9, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5) == 0x0003F0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1) == 0x0003F8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_AsBP_Tgf_Hero_Default_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_bSuccess_1) == 0x000400, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_Not_PreBool_ReturnValue) == 0x000401, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6) == 0x000408, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_AsBP_Tgf_Hero_Default_2) == 0x000410, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_AsBP_Tgf_Hero_Default_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_bSuccess_2) == 0x000418, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_CheckCurrentWeaponSlotType_ReturnValue) == 0x000419, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_CheckCurrentWeaponSlotType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsDedicatedServer_ReturnValue) == 0x00041A, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_Array_Get_Item) == 0x00041C, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000428, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_Array_Length_ReturnValue) == 0x000430, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_Less_IntInt_ReturnValue) == 0x000434, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_11) == 0x000435, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_K2_HasAuthority_ReturnValue) == 0x000436, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000438, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000440, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000448, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000468, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000488, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x000490, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7) == 0x000498, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_AsBP_Tgf_Hero_Default_3) == 0x0004A0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_AsBP_Tgf_Hero_Default_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, K2Node_DynamicCast_bSuccess_3) == 0x0004A8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_K2_HasAuthority_ReturnValue_2) == 0x0004A9, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_K2_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_8) == 0x0004B0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x0004B8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_IsValid_ReturnValue_12) == 0x0004D8, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x0004D9, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1) == 0x0004E0, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000500, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_9) == 0x000508, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap, CallFunc_CanPlayerInteract_bCanInteract) == 0x000510, "Member 'GA_TGF_InteractWithMap_C_ExecuteUbergraph_GA_TGF_InteractWithMap::CallFunc_CanPlayerInteract_bCanInteract' has a wrong offset!");
