#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_MarkPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_TGF_Active_Base_classes.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_MarkPoint.GA_TGF_MarkPoint_C
// 0x0020 (0x0E20 - 0x0E00)
class UGA_TGF_MarkPoint_C : public UGA_TGF_Active_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_TGF_MarkPoint_C;                 // 0x0E00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TraceDist;                                         // 0x0E08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDangerType;                                      // 0x0E0C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlwaysDanger;                                      // 0x0E0D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E0E[0x2];                                      // 0x0E0E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TriggerDelay;                                      // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_TGF_MarkPoint(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void TrySpawnMarkPoint(const struct FHitResult& InHitResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_MarkPoint_C">();
	}
	static class UGA_TGF_MarkPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_MarkPoint_C>();
	}
};
static_assert(alignof(UGA_TGF_MarkPoint_C) == 0x000010, "Wrong alignment on UGA_TGF_MarkPoint_C");
static_assert(sizeof(UGA_TGF_MarkPoint_C) == 0x000E20, "Wrong size on UGA_TGF_MarkPoint_C");
static_assert(offsetof(UGA_TGF_MarkPoint_C, UberGraphFrame_GA_TGF_MarkPoint_C) == 0x000E00, "Member 'UGA_TGF_MarkPoint_C::UberGraphFrame_GA_TGF_MarkPoint_C' has a wrong offset!");
static_assert(offsetof(UGA_TGF_MarkPoint_C, TraceDist) == 0x000E08, "Member 'UGA_TGF_MarkPoint_C::TraceDist' has a wrong offset!");
static_assert(offsetof(UGA_TGF_MarkPoint_C, IsDangerType) == 0x000E0C, "Member 'UGA_TGF_MarkPoint_C::IsDangerType' has a wrong offset!");
static_assert(offsetof(UGA_TGF_MarkPoint_C, AlwaysDanger) == 0x000E0D, "Member 'UGA_TGF_MarkPoint_C::AlwaysDanger' has a wrong offset!");
static_assert(offsetof(UGA_TGF_MarkPoint_C, TriggerDelay) == 0x000E10, "Member 'UGA_TGF_MarkPoint_C::TriggerDelay' has a wrong offset!");

}

