#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_TalentFighter_RefreshEAfterKill

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_TalentFighter_RefreshEAfterKill.GA_TGF_TalentFighter_RefreshEAfterKill_C.ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill
// 0x00D8 (0x00D8 - 0x0000)
struct GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	class ULyraTeamSubsystem*                     CallFunc_GetWorldSubsystem_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELyraTeamComparison                           CallFunc_CompareTeams_ReturnValue;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill) == 0x000008, "Wrong alignment on GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill");
static_assert(sizeof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill) == 0x0000D8, "Wrong size on GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, EntryPoint) == 0x000000, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, K2Node_Event_EventData) == 0x000008, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0000B8, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, K2Node_DynamicCast_AsLyra_Character) == 0x0000C0, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, CallFunc_CompareTeams_TeamIdA) == 0x0000CC, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, CallFunc_CompareTeams_TeamIdB) == 0x0000D0, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, CallFunc_CompareTeams_ReturnValue) == 0x0000D4, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, K2Node_SwitchEnum_CmpSuccess) == 0x0000D5, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill, CallFunc_IsPlayer_ReturnValue) == 0x0000D6, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_ExecuteUbergraph_GA_TGF_TalentFighter_RefreshEAfterKill::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");

// Function GA_TGF_TalentFighter_RefreshEAfterKill.GA_TGF_TalentFighter_RefreshEAfterKill_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_TalentFighter_RefreshEAfterKill_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_TalentFighter_RefreshEAfterKill_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_TalentFighter_RefreshEAfterKill_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_TalentFighter_RefreshEAfterKill_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_TalentFighter_RefreshEAfterKill_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_TalentFighter_RefreshEAfterKill_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_TalentFighter_RefreshEAfterKill_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

