#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_VoiceChat

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_VoiceChat.GA_TGF_VoiceChat_C.ExecuteUbergraph_GA_TGF_VoiceChat
// 0x0070 (0x0070 - 0x0000)
struct GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0008(0x0048)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         K2Node_Event_ActivationInfo;                       // 0x0050(0x0020)(ConstParm, NoDestructor)
};
static_assert(alignof(GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat) == 0x000008, "Wrong alignment on GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat");
static_assert(sizeof(GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat) == 0x000070, "Wrong size on GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat");
static_assert(offsetof(GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat, EntryPoint) == 0x000000, "Member 'GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat, K2Node_Event_bWasCancelled) == 0x000004, "Member 'GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat, K2Node_Event_ActorInfo) == 0x000008, "Member 'GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat, K2Node_Event_ActivationInfo) == 0x000050, "Member 'GA_TGF_VoiceChat_C_ExecuteUbergraph_GA_TGF_VoiceChat::K2Node_Event_ActivationInfo' has a wrong offset!");

// Function GA_TGF_VoiceChat.GA_TGF_VoiceChat_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_TGF_VoiceChat_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_VoiceChat_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_TGF_VoiceChat_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_VoiceChat_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_TGF_VoiceChat_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_VoiceChat_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_VoiceChat_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_TGF_VoiceChat.GA_TGF_VoiceChat_C.ReceiveInputReleased
// 0x0068 (0x0068 - 0x0000)
struct GA_TGF_VoiceChat_C_ReceiveInputReleased final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0048(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(GA_TGF_VoiceChat_C_ReceiveInputReleased) == 0x000008, "Wrong alignment on GA_TGF_VoiceChat_C_ReceiveInputReleased");
static_assert(sizeof(GA_TGF_VoiceChat_C_ReceiveInputReleased) == 0x000068, "Wrong size on GA_TGF_VoiceChat_C_ReceiveInputReleased");
static_assert(offsetof(GA_TGF_VoiceChat_C_ReceiveInputReleased, ActorInfo) == 0x000000, "Member 'GA_TGF_VoiceChat_C_ReceiveInputReleased::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_TGF_VoiceChat_C_ReceiveInputReleased, ActivationInfo) == 0x000048, "Member 'GA_TGF_VoiceChat_C_ReceiveInputReleased::ActivationInfo' has a wrong offset!");

}

