#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_Death

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_Death.GA_TGF_Death_C.CosmeticAndCamera
// 0x0018 (0x0018 - 0x0000)
struct GA_TGF_Death_C_CosmeticAndCamera final
{
public:
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraPawnComponent_CharacterParts*      CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Death_C_CosmeticAndCamera) == 0x000008, "Wrong alignment on GA_TGF_Death_C_CosmeticAndCamera");
static_assert(sizeof(GA_TGF_Death_C_CosmeticAndCamera) == 0x000018, "Wrong size on GA_TGF_Death_C_CosmeticAndCamera");
static_assert(offsetof(GA_TGF_Death_C_CosmeticAndCamera, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000000, "Member 'GA_TGF_Death_C_CosmeticAndCamera::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_CosmeticAndCamera, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'GA_TGF_Death_C_CosmeticAndCamera::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_CosmeticAndCamera, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_TGF_Death_C_CosmeticAndCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_CosmeticAndCamera, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'GA_TGF_Death_C_CosmeticAndCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_Death.GA_TGF_Death_C.EventReceived_6634C4894C2BEAE03BFF84B477B8313D
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_Death_C_EventReceived_6634C4894C2BEAE03BFF84B477B8313D final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_Death_C_EventReceived_6634C4894C2BEAE03BFF84B477B8313D) == 0x000008, "Wrong alignment on GA_TGF_Death_C_EventReceived_6634C4894C2BEAE03BFF84B477B8313D");
static_assert(sizeof(GA_TGF_Death_C_EventReceived_6634C4894C2BEAE03BFF84B477B8313D) == 0x0000B0, "Wrong size on GA_TGF_Death_C_EventReceived_6634C4894C2BEAE03BFF84B477B8313D");
static_assert(offsetof(GA_TGF_Death_C_EventReceived_6634C4894C2BEAE03BFF84B477B8313D, Payload) == 0x000000, "Member 'GA_TGF_Death_C_EventReceived_6634C4894C2BEAE03BFF84B477B8313D::Payload' has a wrong offset!");

// Function GA_TGF_Death.GA_TGF_Death_C.ExecuteUbergraph_GA_TGF_Death
// 0x03C8 (0x03C8 - 0x0000)
struct GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMovementMode Mode, uint8 CustomMode)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_Mode_1;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_CustomMode_1;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfWaitAbilityTask_TargetMovementMode* CallFunc_CreateWaitTargetMovementMode_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMovementMode Mode, uint8 CustomMode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_Mode;                           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_CustomMode;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_2;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable_3;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfWaitAbilityTask_TargetMovementMode* CallFunc_CreateWaitTargetMovementMode_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0050(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0108(0x00B0)(ConstParm)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x01D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x01F8(0x00B0)()
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2; // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3; // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAnimInstance*                      K2Node_DynamicCast_AsLyra_Anim_Instance;           // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentDeathAnimationLength_ReturnValue; // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalLightComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ATgfProjectileBase*                     K2Node_DynamicCast_AsTgf_Projectile_Base;          // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0320(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0338(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0388(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0398(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue_1;            // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death) == 0x000008, "Wrong alignment on GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death");
static_assert(sizeof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death) == 0x0003C8, "Wrong size on GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, EntryPoint) == 0x000000, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000008, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CustomEvent_Mode_1) == 0x000021, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CustomEvent_Mode_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CustomEvent_CustomMode_1) == 0x000022, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CustomEvent_CustomMode_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, Temp_byte_Variable) == 0x000023, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, Temp_byte_Variable_1) == 0x000024, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_CreateWaitTargetMovementMode_ReturnValue) == 0x000028, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_CreateWaitTargetMovementMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CustomEvent_Mode) == 0x000041, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CustomEvent_Mode' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CustomEvent_CustomMode) == 0x000042, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CustomEvent_CustomMode' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, Temp_byte_Variable_2) == 0x000043, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, Temp_byte_Variable_3) == 0x000044, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_CreateWaitTargetMovementMode_ReturnValue_1) == 0x000048, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_CreateWaitTargetMovementMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CustomEvent_Payload) == 0x000050, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_IsValid_ReturnValue_2) == 0x000100, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_Event_EventData) == 0x000108, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x0001B8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetAnimInstance_ReturnValue) == 0x0001C0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1) == 0x0001C8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, Temp_int_Loop_Counter_Variable) == 0x0001D0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetAttachedActors_OutActors) == 0x0001D8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_Add_IntInt_ReturnValue) == 0x0001E8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_Array_Length_ReturnValue) == 0x0001EC, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_Less_IntInt_ReturnValue) == 0x0001F0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, Temp_struct_Variable) == 0x0001F8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2) == 0x0002A8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002B0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_BooleanAND_ReturnValue) == 0x0002C0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3) == 0x0002C8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4) == 0x0002D0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_IsValid_ReturnValue_3) == 0x0002D8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0002E0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_DynamicCast_AsLyra_Anim_Instance) == 0x0002E8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_DynamicCast_AsLyra_Anim_Instance' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_IsValid_ReturnValue_4) == 0x0002F1, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetCurrentDeathAnimationLength_ReturnValue) == 0x0002F4, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetCurrentDeathAnimationLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_K2_HasAuthority_ReturnValue) == 0x0002F8, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, Temp_int_Array_Index_Variable) == 0x0002FC, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_Array_Get_Item) == 0x000300, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_GetComponentByClass_ReturnValue) == 0x000308, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_DynamicCast_AsTgf_Projectile_Base) == 0x000310, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_DynamicCast_AsTgf_Projectile_Base' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_DynamicCast_bSuccess_1) == 0x000318, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_IsValid_ReturnValue_5) == 0x000319, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_Conv_ObjectToText_ReturnValue) == 0x000320, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_Conv_ObjectToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_MakeStruct_FormatArgumentData) == 0x000338, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, K2Node_MakeArray_Array) == 0x000388, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_Format_ReturnValue) == 0x000398, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_Conv_TextToString_ReturnValue) == 0x0003B0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death, CallFunc_K2_HasAuthority_ReturnValue_1) == 0x0003C0, "Member 'GA_TGF_Death_C_ExecuteUbergraph_GA_TGF_Death::CallFunc_K2_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function GA_TGF_Death.GA_TGF_Death_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_Death_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_TGF_Death_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_TGF_Death_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_TGF_Death_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_TGF_Death_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_TGF_Death_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_TGF_Death_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_TGF_Death.GA_TGF_Death_C.K2_OnEndAbility
// 0x0010 (0x0010 - 0x0000)
struct GA_TGF_Death_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetLyraCharacterFromActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Death_C_K2_OnEndAbility) == 0x000008, "Wrong alignment on GA_TGF_Death_C_K2_OnEndAbility");
static_assert(sizeof(GA_TGF_Death_C_K2_OnEndAbility) == 0x000010, "Wrong size on GA_TGF_Death_C_K2_OnEndAbility");
static_assert(offsetof(GA_TGF_Death_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_TGF_Death_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_K2_OnEndAbility, CallFunc_GetLyraCharacterFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_TGF_Death_C_K2_OnEndAbility::CallFunc_GetLyraCharacterFromActorInfo_ReturnValue' has a wrong offset!");

// Function GA_TGF_Death.GA_TGF_Death_C.OnMode_0F67DFD44DDA97E3A419F6A465492D8B
// 0x0002 (0x0002 - 0x0000)
struct GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B final
{
public:
	EMovementMode                                 Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CustomMode;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B) == 0x000001, "Wrong alignment on GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B");
static_assert(sizeof(GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B) == 0x000002, "Wrong size on GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B");
static_assert(offsetof(GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B, Mode) == 0x000000, "Member 'GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B::Mode' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B, CustomMode) == 0x000001, "Member 'GA_TGF_Death_C_OnMode_0F67DFD44DDA97E3A419F6A465492D8B::CustomMode' has a wrong offset!");

// Function GA_TGF_Death.GA_TGF_Death_C.OnMode_F06DDDF9446D07E005BB6BBBF3D9C047
// 0x0002 (0x0002 - 0x0000)
struct GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047 final
{
public:
	EMovementMode                                 Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CustomMode;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047) == 0x000001, "Wrong alignment on GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047");
static_assert(sizeof(GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047) == 0x000002, "Wrong size on GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047");
static_assert(offsetof(GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047, Mode) == 0x000000, "Member 'GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047::Mode' has a wrong offset!");
static_assert(offsetof(GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047, CustomMode) == 0x000001, "Member 'GA_TGF_Death_C_OnMode_F06DDDF9446D07E005BB6BBBF3D9C047::CustomMode' has a wrong offset!");

}

