#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_FullHPEffect

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_FullHPEffect.GA_TGF_FullHPEffect_C
// 0x0020 (0x09C0 - 0x09A0)
class UGA_TGF_FullHPEffect_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            GEToApplied;                                       // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          GEApplied;                                         // 0x09B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B1[0x3];                                      // 0x09B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            GEHandle;                                          // 0x09B4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckFullHpEffect();
	void EventReceived_98D1D30F4074C2A7B504139FE7424650(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_FullHPEffect(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_FullHPEffect_C">();
	}
	static class UGA_TGF_FullHPEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_FullHPEffect_C>();
	}
};
static_assert(alignof(UGA_TGF_FullHPEffect_C) == 0x000010, "Wrong alignment on UGA_TGF_FullHPEffect_C");
static_assert(sizeof(UGA_TGF_FullHPEffect_C) == 0x0009C0, "Wrong size on UGA_TGF_FullHPEffect_C");
static_assert(offsetof(UGA_TGF_FullHPEffect_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_FullHPEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_FullHPEffect_C, GEToApplied) == 0x0009A8, "Member 'UGA_TGF_FullHPEffect_C::GEToApplied' has a wrong offset!");
static_assert(offsetof(UGA_TGF_FullHPEffect_C, GEApplied) == 0x0009B0, "Member 'UGA_TGF_FullHPEffect_C::GEApplied' has a wrong offset!");
static_assert(offsetof(UGA_TGF_FullHPEffect_C, GEHandle) == 0x0009B4, "Member 'UGA_TGF_FullHPEffect_C::GEHandle' has a wrong offset!");

}

