#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_AttributeChangeHandle_CurShield

#include "Basic.hpp"

#include "GA_TGF_AttributeChangeHandleBase_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_AttributeChangeHandle_CurShield.GA_TGF_AttributeChangeHandle_CurShield_C
// 0x0020 (0x09E0 - 0x09C0)
class UGA_TGF_AttributeChangeHandle_CurShield_C final : public UGA_TGF_AttributeChangeHandleBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_TGF_AttributeChangeHandle_CurShield_C; // 0x09C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 ShieldGE;                                          // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ShieldGEHandle;                                    // 0x09D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShieldGEAdded;                                    // 0x09D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttrChangeHandle(class UTgfAttributeComponent* AttrComp, const struct FGameplayAttribute& Attr);
	void ExecuteUbergraph_GA_TGF_AttributeChangeHandle_CurShield(int32 EntryPoint);
	void K2_ActivateAbility();
	void ResetGE();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_AttributeChangeHandle_CurShield_C">();
	}
	static class UGA_TGF_AttributeChangeHandle_CurShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_AttributeChangeHandle_CurShield_C>();
	}
};
static_assert(alignof(UGA_TGF_AttributeChangeHandle_CurShield_C) == 0x000010, "Wrong alignment on UGA_TGF_AttributeChangeHandle_CurShield_C");
static_assert(sizeof(UGA_TGF_AttributeChangeHandle_CurShield_C) == 0x0009E0, "Wrong size on UGA_TGF_AttributeChangeHandle_CurShield_C");
static_assert(offsetof(UGA_TGF_AttributeChangeHandle_CurShield_C, UberGraphFrame_GA_TGF_AttributeChangeHandle_CurShield_C) == 0x0009C0, "Member 'UGA_TGF_AttributeChangeHandle_CurShield_C::UberGraphFrame_GA_TGF_AttributeChangeHandle_CurShield_C' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AttributeChangeHandle_CurShield_C, ShieldGE) == 0x0009C8, "Member 'UGA_TGF_AttributeChangeHandle_CurShield_C::ShieldGE' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AttributeChangeHandle_CurShield_C, ShieldGEHandle) == 0x0009D0, "Member 'UGA_TGF_AttributeChangeHandle_CurShield_C::ShieldGEHandle' has a wrong offset!");
static_assert(offsetof(UGA_TGF_AttributeChangeHandle_CurShield_C, bShieldGEAdded) == 0x0009D8, "Member 'UGA_TGF_AttributeChangeHandle_CurShield_C::bShieldGEAdded' has a wrong offset!");

}

