#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_AddShieldOnCastSkill

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_TGF_AddShieldOnCastSkill.GA_TGF_AddShieldOnCastSkill_C.EventReceived_D46E562C4A1EDF1B62471085464E804D
// 0x00B0 (0x00B0 - 0x0000)
struct GA_TGF_AddShieldOnCastSkill_C_EventReceived_D46E562C4A1EDF1B62471085464E804D final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_TGF_AddShieldOnCastSkill_C_EventReceived_D46E562C4A1EDF1B62471085464E804D) == 0x000008, "Wrong alignment on GA_TGF_AddShieldOnCastSkill_C_EventReceived_D46E562C4A1EDF1B62471085464E804D");
static_assert(sizeof(GA_TGF_AddShieldOnCastSkill_C_EventReceived_D46E562C4A1EDF1B62471085464E804D) == 0x0000B0, "Wrong size on GA_TGF_AddShieldOnCastSkill_C_EventReceived_D46E562C4A1EDF1B62471085464E804D");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_EventReceived_D46E562C4A1EDF1B62471085464E804D, Payload) == 0x000000, "Member 'GA_TGF_AddShieldOnCastSkill_C_EventReceived_D46E562C4A1EDF1B62471085464E804D::Payload' has a wrong offset!");

// Function GA_TGF_AddShieldOnCastSkill.GA_TGF_AddShieldOnCastSkill_C.ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill
// 0x01F8 (0x01F8 - 0x0000)
struct GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0010(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C0(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfGameplayAbility*                    K2Node_DynamicCast_AsTgf_Gameplay_Ability;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UAttributeSet*                    CallFunc_GetAttributeSet_ReturnValue;              // 0x0198(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfTriggerEffectAttributeSet*          K2Node_DynamicCast_AsTgf_Trigger_Effect_Attribute_Set; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x01D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x01E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill) == 0x000008, "Wrong alignment on GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill");
static_assert(sizeof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill) == 0x0001F8, "Wrong size on GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, EntryPoint) == 0x000000, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, K2Node_CustomEvent_Payload) == 0x000010, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, Temp_struct_Variable) == 0x0000C0, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000170, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, K2Node_DynamicCast_AsTgf_Gameplay_Ability) == 0x000180, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::K2Node_DynamicCast_AsTgf_Gameplay_Ability' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_HasTag_ReturnValue) == 0x000189, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue) == 0x000190, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_GetLyraAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_GetAttributeSet_ReturnValue) == 0x000198, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_GetAttributeSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_IsValid_ReturnValue_1) == 0x0001A0, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, K2Node_DynamicCast_AsTgf_Trigger_Effect_Attribute_Set) == 0x0001A8, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::K2Node_DynamicCast_AsTgf_Trigger_Effect_Attribute_Set' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001B1, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_GetTimeSeconds_ReturnValue) == 0x0001B8, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x0001C0, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, K2Node_CreateDelegate_OutputDelegate) == 0x0001D0, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0001E0, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0001E4, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001F0, "Member 'GA_TGF_AddShieldOnCastSkill_C_ExecuteUbergraph_GA_TGF_AddShieldOnCastSkill::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

