#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_DisengageEffect

#include "Basic.hpp"

#include "GA_TGF_Passive_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_DisengageEffect.GA_TGF_DisengageEffect_C
// 0x0070 (0x0A10 - 0x09A0)
class UGA_TGF_DisengageEffect_C final : public UGA_TGF_Passive_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSubclassOf<class UGameplayEffect>>    GEToApply;                                         // 0x09A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        EngageWaitTime;                                    // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CurTimer;                                          // 0x09C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    GEAppliedHandles;                                  // 0x09C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           RemoveTimer;                                       // 0x09D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSubclassOf<class UGameplayEffect>>    GEToApplyDelayRemove;                              // 0x09E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        GEDelayRemoveTime;                                 // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    DelayGEAppliedHandles;                             // 0x09F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ApplyDisengageGE();
	void Disengage();
	void DoRemoveDisengageGE();
	void DoRemoveDisengageGEDelay();
	void EventReceived_5F531DCD440A6F031EE75AB0B60B9A12(const struct FGameplayEventData& Payload);
	void EventReceived_E0FEE7EA44163EC31084908A4D1A81D0(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_DisengageEffect(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void RemoveDisengageGE(bool Immediately);
	void RestartCountDown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_DisengageEffect_C">();
	}
	static class UGA_TGF_DisengageEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_DisengageEffect_C>();
	}
};
static_assert(alignof(UGA_TGF_DisengageEffect_C) == 0x000010, "Wrong alignment on UGA_TGF_DisengageEffect_C");
static_assert(sizeof(UGA_TGF_DisengageEffect_C) == 0x000A10, "Wrong size on UGA_TGF_DisengageEffect_C");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, UberGraphFrame) == 0x0009A0, "Member 'UGA_TGF_DisengageEffect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, GEToApply) == 0x0009A8, "Member 'UGA_TGF_DisengageEffect_C::GEToApply' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, EngageWaitTime) == 0x0009B8, "Member 'UGA_TGF_DisengageEffect_C::EngageWaitTime' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, CurTimer) == 0x0009C0, "Member 'UGA_TGF_DisengageEffect_C::CurTimer' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, GEAppliedHandles) == 0x0009C8, "Member 'UGA_TGF_DisengageEffect_C::GEAppliedHandles' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, RemoveTimer) == 0x0009D8, "Member 'UGA_TGF_DisengageEffect_C::RemoveTimer' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, GEToApplyDelayRemove) == 0x0009E0, "Member 'UGA_TGF_DisengageEffect_C::GEToApplyDelayRemove' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, GEDelayRemoveTime) == 0x0009F0, "Member 'UGA_TGF_DisengageEffect_C::GEDelayRemoveTime' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DisengageEffect_C, DelayGEAppliedHandles) == 0x0009F8, "Member 'UGA_TGF_DisengageEffect_C::DelayGEAppliedHandles' has a wrong offset!");

}

