#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TGF_DruidPanther_Talent_HuntersSense_Timer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TGF_DruidPanther_Talent_HuntersSense_Timer.GA_TGF_DruidPanther_Talent_HuntersSense_Timer_C
// 0x0020 (0x09A0 - 0x0980)
class UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C final : public UTgfGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0980(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        CooldownTime;                                      // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayEvent*        StartEffectEvent;                                  // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        EffectedTime;                                      // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_695F4AF04E7D61D09B72C7958C45E778(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_TGF_DruidPanther_Talent_HuntersSense_Timer(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_TGF_DruidPanther_Talent_HuntersSense_Timer_C">();
	}
	static class UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C>();
	}
};
static_assert(alignof(UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C) == 0x000010, "Wrong alignment on UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C");
static_assert(sizeof(UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C) == 0x0009A0, "Wrong size on UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C");
static_assert(offsetof(UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C, UberGraphFrame) == 0x000980, "Member 'UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C, CooldownTime) == 0x000988, "Member 'UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C::CooldownTime' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C, StartEffectEvent) == 0x000990, "Member 'UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C::StartEffectEvent' has a wrong offset!");
static_assert(offsetof(UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C, EffectedTime) == 0x000998, "Member 'UGA_TGF_DruidPanther_Talent_HuntersSense_Timer_C::EffectedTime' has a wrong offset!");

}

