#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayMessageRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayMessageRuntime_structs.hpp"


namespace SDK
{

// Class GameplayMessageRuntime.AsyncAction_ListenForGameplayMessage
// 0x0058 (0x0088 - 0x0030)
class UAsyncAction_ListenForGameplayMessage final : public UCancellableAsyncAction
{
public:
	FMulticastInlineDelegateProperty_             OnMessageReceived;                                 // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x48];                                      // 0x0040(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForGameplayMessage* ListenForGameplayMessages(class UObject* WorldContextObject, const struct FGameplayTag& Channel, class UScriptStruct* PayloadType, EGameplayMessageMatch MatchType);

	bool GetPayload(int32& OutPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ListenForGameplayMessage">();
	}
	static class UAsyncAction_ListenForGameplayMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForGameplayMessage>();
	}
};
static_assert(alignof(UAsyncAction_ListenForGameplayMessage) == 0x000008, "Wrong alignment on UAsyncAction_ListenForGameplayMessage");
static_assert(sizeof(UAsyncAction_ListenForGameplayMessage) == 0x000088, "Wrong size on UAsyncAction_ListenForGameplayMessage");
static_assert(offsetof(UAsyncAction_ListenForGameplayMessage, OnMessageReceived) == 0x000030, "Member 'UAsyncAction_ListenForGameplayMessage::OnMessageReceived' has a wrong offset!");

// Class GameplayMessageRuntime.GameplayMessageSubsystem
// 0x0050 (0x0080 - 0x0030)
class UGameplayMessageSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_BroadcastMessage(const struct FGameplayTag& Channel, const int32& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayMessageSubsystem">();
	}
	static class UGameplayMessageSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayMessageSubsystem>();
	}
};
static_assert(alignof(UGameplayMessageSubsystem) == 0x000008, "Wrong alignment on UGameplayMessageSubsystem");
static_assert(sizeof(UGameplayMessageSubsystem) == 0x000080, "Wrong size on UGameplayMessageSubsystem");

}

