#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayMessageRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum GameplayMessageRuntime.EGameplayMessageMatch
// NumValues: 0x0003
enum class EGameplayMessageMatch : uint8
{
	ExactMatch                               = 0,
	PartialMatch                             = 1,
	EGameplayMessageMatch_MAX                = 2,
};

// ScriptStruct GameplayMessageRuntime.GameplayMessageListenerHandle
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FGameplayMessageListenerHandle final
{
public:
	TWeakObjectPtr<class UGameplayMessageSubsystem> Subsystem;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           Channel;                                           // 0x0008(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ID;                                                // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayMessageListenerHandle) == 0x000008, "Wrong alignment on FGameplayMessageListenerHandle");
static_assert(sizeof(FGameplayMessageListenerHandle) == 0x000020, "Wrong size on FGameplayMessageListenerHandle");
static_assert(offsetof(FGameplayMessageListenerHandle, Subsystem) == 0x000000, "Member 'FGameplayMessageListenerHandle::Subsystem' has a wrong offset!");
static_assert(offsetof(FGameplayMessageListenerHandle, Channel) == 0x000008, "Member 'FGameplayMessageListenerHandle::Channel' has a wrong offset!");
static_assert(offsetof(FGameplayMessageListenerHandle, ID) == 0x000010, "Member 'FGameplayMessageListenerHandle::ID' has a wrong offset!");

// ScriptStruct GameplayMessageRuntime.GameplayMessageListenerData
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x10) FGameplayMessageListenerData final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayMessageListenerData) == 0x000010, "Wrong alignment on FGameplayMessageListenerData");
static_assert(sizeof(FGameplayMessageListenerData) == 0x000060, "Wrong size on FGameplayMessageListenerData");

}

