#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HitPendingData

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct HitPendingData.HitPendingData
// 0x00F8 (0x00F8 - 0x0000)
struct FHitPendingData final
{
public:
	struct FHitResult                             HitResultData_2_1991577E4DCF1D51C3A58FA392D84554;  // 0x0000(0x00E8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    Mesh_5_3437B1974A941147AF28C7B4582E3DDE;           // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CriticalRandomValue_8_68A41A2E480DF3EAA52734B4EA352A3F; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FHitPendingData) == 0x000008, "Wrong alignment on FHitPendingData");
static_assert(sizeof(FHitPendingData) == 0x0000F8, "Wrong size on FHitPendingData");
static_assert(offsetof(FHitPendingData, HitResultData_2_1991577E4DCF1D51C3A58FA392D84554) == 0x000000, "Member 'FHitPendingData::HitResultData_2_1991577E4DCF1D51C3A58FA392D84554' has a wrong offset!");
static_assert(offsetof(FHitPendingData, Mesh_5_3437B1974A941147AF28C7B4582E3DDE) == 0x0000E8, "Member 'FHitPendingData::Mesh_5_3437B1974A941147AF28C7B4582E3DDE' has a wrong offset!");
static_assert(offsetof(FHitPendingData, CriticalRandomValue_8_68A41A2E480DF3EAA52734B4EA352A3F) == 0x0000F0, "Member 'FHitPendingData::CriticalRandomValue_8_68A41A2E480DF3EAA52734B4EA352A3F' has a wrong offset!");

}

