#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTL_LI_Header

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass INTL_LI_Header.INTL_LI_Header_C
// 0x0030 (0x02A8 - 0x0278)
class UINTL_LI_Header_C final : public UUserWidget
{
public:
	class ULIButton*                              Button_Back;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULIButton*                              Button_Close;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_LITestEntry;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Logo;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTL_LI_Header_C">();
	}
	static class UINTL_LI_Header_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTL_LI_Header_C>();
	}
};
static_assert(alignof(UINTL_LI_Header_C) == 0x000008, "Wrong alignment on UINTL_LI_Header_C");
static_assert(sizeof(UINTL_LI_Header_C) == 0x0002A8, "Wrong size on UINTL_LI_Header_C");
static_assert(offsetof(UINTL_LI_Header_C, Button_Back) == 0x000278, "Member 'UINTL_LI_Header_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UINTL_LI_Header_C, Button_Close) == 0x000280, "Member 'UINTL_LI_Header_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UINTL_LI_Header_C, Button_LITestEntry) == 0x000288, "Member 'UINTL_LI_Header_C::Button_LITestEntry' has a wrong offset!");
static_assert(offsetof(UINTL_LI_Header_C, Image_0) == 0x000290, "Member 'UINTL_LI_Header_C::Image_0' has a wrong offset!");
static_assert(offsetof(UINTL_LI_Header_C, Image_1) == 0x000298, "Member 'UINTL_LI_Header_C::Image_1' has a wrong offset!");
static_assert(offsetof(UINTL_LI_Header_C, Image_Logo) == 0x0002A0, "Member 'UINTL_LI_Header_C::Image_Logo' has a wrong offset!");

}

