#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTL_LI_BP_LoadingWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass INTL_LI_BP_LoadingWidget.INTL_LI_BP_LoadingWidget_C
// 0x0030 (0x02A8 - 0x0278)
class UINTL_LI_BP_LoadingWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Spin;                                              // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class ULIButton*                              Button_0;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_INTL_LI_BP_LoadingWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTL_LI_BP_LoadingWidget_C">();
	}
	static class UINTL_LI_BP_LoadingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTL_LI_BP_LoadingWidget_C>();
	}
};
static_assert(alignof(UINTL_LI_BP_LoadingWidget_C) == 0x000008, "Wrong alignment on UINTL_LI_BP_LoadingWidget_C");
static_assert(sizeof(UINTL_LI_BP_LoadingWidget_C) == 0x0002A8, "Wrong size on UINTL_LI_BP_LoadingWidget_C");
static_assert(offsetof(UINTL_LI_BP_LoadingWidget_C, UberGraphFrame) == 0x000278, "Member 'UINTL_LI_BP_LoadingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_LoadingWidget_C, Spin) == 0x000280, "Member 'UINTL_LI_BP_LoadingWidget_C::Spin' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_LoadingWidget_C, Button_0) == 0x000288, "Member 'UINTL_LI_BP_LoadingWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_LoadingWidget_C, Image_1) == 0x000290, "Member 'UINTL_LI_BP_LoadingWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_LoadingWidget_C, Image_2) == 0x000298, "Member 'UINTL_LI_BP_LoadingWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_LoadingWidget_C, Image_3) == 0x0002A0, "Member 'UINTL_LI_BP_LoadingWidget_C::Image_3' has a wrong offset!");

}

