#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTL_LI_BP_RegionTerms_TermItem

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass INTL_LI_BP_RegionTerms_TermItem.INTL_LI_BP_RegionTerms_TermItem_C
// 0x0018 (0x0290 - 0x0278)
class UINTL_LI_BP_RegionTerms_TermItem_C final : public UUserWidget
{
public:
	class UCheckBox*                              CheckBox_Term;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Term;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_C*              Owner;                                             // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void NavigationDown();
	void NavigationUp();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTL_LI_BP_RegionTerms_TermItem_C">();
	}
	static class UINTL_LI_BP_RegionTerms_TermItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTL_LI_BP_RegionTerms_TermItem_C>();
	}
};
static_assert(alignof(UINTL_LI_BP_RegionTerms_TermItem_C) == 0x000008, "Wrong alignment on UINTL_LI_BP_RegionTerms_TermItem_C");
static_assert(sizeof(UINTL_LI_BP_RegionTerms_TermItem_C) == 0x000290, "Wrong size on UINTL_LI_BP_RegionTerms_TermItem_C");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_TermItem_C, CheckBox_Term) == 0x000278, "Member 'UINTL_LI_BP_RegionTerms_TermItem_C::CheckBox_Term' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_TermItem_C, RichTextBlock_Term) == 0x000280, "Member 'UINTL_LI_BP_RegionTerms_TermItem_C::RichTextBlock_Term' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_TermItem_C, Owner) == 0x000288, "Member 'UINTL_LI_BP_RegionTerms_TermItem_C::Owner' has a wrong offset!");

}

