#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTL_LI_BP_RegionTerms

#include "Basic.hpp"

#include "LevelInfinite_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass INTL_LI_BP_RegionTerms.INTL_LI_BP_RegionTerms_C
// 0x0110 (0x03F8 - 0x02E8)
class UINTL_LI_BP_RegionTerms_C final : public ULIPanelBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULIButton*                              Button_Continue;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxString_Age;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxString_Day;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxString_Month;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxString_Region;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        ComboBoxString_Year;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Figure;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Age_E;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Day_E;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Month_E;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Year_E;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_Backgroup_C*                INTL_LI_BP_Backgroup;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_Header_C*                      INTL_LI_Header;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_AgeRank;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_0;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_1;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_2;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_3;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_4;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_5;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_6;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_7;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UINTL_LI_BP_RegionTerms_TermItem_C*     TermItem_8;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_AgeRank;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_BirthRoot;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Region;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_AgeSelector;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    TermItems;                                         // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BirthComboxNavigationDown();
	void ContinueBtnNavigationUp();
	void EventTermItemNavigationDown(class UUserWidget* TermIterm);
	void EventTermItemNavigationUp(class UUserWidget* TermItem);
	void ExecuteUbergraph_INTL_LI_BP_RegionTerms(int32 EntryPoint);
	void GetNextTermItem(bool IsDown, int32 StartFromIndex, class UINTL_LI_BP_RegionTerms_TermItem_C** NextTermIterm);
	void InitTermItems();
	class UWidget* OnComboBoxGenerateWidget(const class FString& Item);
	void PreConstruct(bool IsDesignTime);
	void RegionComboxNavigationDown();
	void TermItemNavigationDown(class UUserWidget* TermIterm);
	void TermItemNavigationUp(class UUserWidget* TermIterm);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"INTL_LI_BP_RegionTerms_C">();
	}
	static class UINTL_LI_BP_RegionTerms_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTL_LI_BP_RegionTerms_C>();
	}
};
static_assert(alignof(UINTL_LI_BP_RegionTerms_C) == 0x000008, "Wrong alignment on UINTL_LI_BP_RegionTerms_C");
static_assert(sizeof(UINTL_LI_BP_RegionTerms_C) == 0x0003F8, "Wrong size on UINTL_LI_BP_RegionTerms_C");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, UberGraphFrame) == 0x0002E8, "Member 'UINTL_LI_BP_RegionTerms_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Button_Continue) == 0x0002F0, "Member 'UINTL_LI_BP_RegionTerms_C::Button_Continue' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, ComboBoxString_Age) == 0x0002F8, "Member 'UINTL_LI_BP_RegionTerms_C::ComboBoxString_Age' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, ComboBoxString_Day) == 0x000300, "Member 'UINTL_LI_BP_RegionTerms_C::ComboBoxString_Day' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, ComboBoxString_Month) == 0x000308, "Member 'UINTL_LI_BP_RegionTerms_C::ComboBoxString_Month' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, ComboBoxString_Region) == 0x000310, "Member 'UINTL_LI_BP_RegionTerms_C::ComboBoxString_Region' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, ComboBoxString_Year) == 0x000318, "Member 'UINTL_LI_BP_RegionTerms_C::ComboBoxString_Year' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Figure) == 0x000320, "Member 'UINTL_LI_BP_RegionTerms_C::Figure' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_2) == 0x000328, "Member 'UINTL_LI_BP_RegionTerms_C::Image_2' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_3) == 0x000330, "Member 'UINTL_LI_BP_RegionTerms_C::Image_3' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_4) == 0x000338, "Member 'UINTL_LI_BP_RegionTerms_C::Image_4' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_5) == 0x000340, "Member 'UINTL_LI_BP_RegionTerms_C::Image_5' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_Age_E) == 0x000348, "Member 'UINTL_LI_BP_RegionTerms_C::Image_Age_E' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_Day_E) == 0x000350, "Member 'UINTL_LI_BP_RegionTerms_C::Image_Day_E' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_Month_E) == 0x000358, "Member 'UINTL_LI_BP_RegionTerms_C::Image_Month_E' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, Image_Year_E) == 0x000360, "Member 'UINTL_LI_BP_RegionTerms_C::Image_Year_E' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, INTL_LI_BP_Backgroup) == 0x000368, "Member 'UINTL_LI_BP_RegionTerms_C::INTL_LI_BP_Backgroup' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, INTL_LI_Header) == 0x000370, "Member 'UINTL_LI_BP_RegionTerms_C::INTL_LI_Header' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, SizeBox_AgeRank) == 0x000378, "Member 'UINTL_LI_BP_RegionTerms_C::SizeBox_AgeRank' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_0) == 0x000380, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_0' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_1) == 0x000388, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_1' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_2) == 0x000390, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_2' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_3) == 0x000398, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_3' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_4) == 0x0003A0, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_4' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_5) == 0x0003A8, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_5' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_6) == 0x0003B0, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_6' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_7) == 0x0003B8, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_7' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItem_8) == 0x0003C0, "Member 'UINTL_LI_BP_RegionTerms_C::TermItem_8' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, VerticalBox_AgeRank) == 0x0003C8, "Member 'UINTL_LI_BP_RegionTerms_C::VerticalBox_AgeRank' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, VerticalBox_BirthRoot) == 0x0003D0, "Member 'UINTL_LI_BP_RegionTerms_C::VerticalBox_BirthRoot' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, VerticalBox_Region) == 0x0003D8, "Member 'UINTL_LI_BP_RegionTerms_C::VerticalBox_Region' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, WidgetSwitcher_AgeSelector) == 0x0003E0, "Member 'UINTL_LI_BP_RegionTerms_C::WidgetSwitcher_AgeSelector' has a wrong offset!");
static_assert(offsetof(UINTL_LI_BP_RegionTerms_C, TermItems) == 0x0003E8, "Member 'UINTL_LI_BP_RegionTerms_C::TermItems' has a wrong offset!");

}

