#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: INTLCore

#include "Basic.hpp"

#include "INTLCore_structs.hpp"


namespace SDK::Params
{

// Function INTLCore.INTLOutputUtility.FormatAuthRet
// 0x0190 (0x0190 - 0x0000)
struct INTLOutputUtility_FormatAuthRet final
{
public:
	struct FINTLAuthResult                        Ret;                                               // 0x0000(0x0170)(ConstParm, Parm, NativeAccessSpecifierPublic)
	bool                                          IsSuccess;                                         // 0x0170(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorMsg;                                          // 0x0178(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLOutputUtility_FormatAuthRet) == 0x000008, "Wrong alignment on INTLOutputUtility_FormatAuthRet");
static_assert(sizeof(INTLOutputUtility_FormatAuthRet) == 0x000190, "Wrong size on INTLOutputUtility_FormatAuthRet");
static_assert(offsetof(INTLOutputUtility_FormatAuthRet, Ret) == 0x000000, "Member 'INTLOutputUtility_FormatAuthRet::Ret' has a wrong offset!");
static_assert(offsetof(INTLOutputUtility_FormatAuthRet, IsSuccess) == 0x000170, "Member 'INTLOutputUtility_FormatAuthRet::IsSuccess' has a wrong offset!");
static_assert(offsetof(INTLOutputUtility_FormatAuthRet, ErrorMsg) == 0x000178, "Member 'INTLOutputUtility_FormatAuthRet::ErrorMsg' has a wrong offset!");

// Function INTLCore.INTLOutputUtility.FormatBaseRet
// 0x0060 (0x0060 - 0x0000)
struct INTLOutputUtility_FormatBaseRet final
{
public:
	struct FINTLBaseResult                        Ret;                                               // 0x0000(0x0040)(ConstParm, Parm, NativeAccessSpecifierPublic)
	bool                                          IsSuccess;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorMsg;                                          // 0x0048(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLOutputUtility_FormatBaseRet) == 0x000008, "Wrong alignment on INTLOutputUtility_FormatBaseRet");
static_assert(sizeof(INTLOutputUtility_FormatBaseRet) == 0x000060, "Wrong size on INTLOutputUtility_FormatBaseRet");
static_assert(offsetof(INTLOutputUtility_FormatBaseRet, Ret) == 0x000000, "Member 'INTLOutputUtility_FormatBaseRet::Ret' has a wrong offset!");
static_assert(offsetof(INTLOutputUtility_FormatBaseRet, IsSuccess) == 0x000040, "Member 'INTLOutputUtility_FormatBaseRet::IsSuccess' has a wrong offset!");
static_assert(offsetof(INTLOutputUtility_FormatBaseRet, ErrorMsg) == 0x000048, "Member 'INTLOutputUtility_FormatBaseRet::ErrorMsg' has a wrong offset!");

// Function INTLCore.INTLOutputUtility.FormatNoticeRet
// 0x0080 (0x0080 - 0x0000)
struct INTLOutputUtility_FormatNoticeRet final
{
public:
	struct FINTLNoticeResult                      Ret;                                               // 0x0000(0x0060)(ConstParm, Parm, NativeAccessSpecifierPublic)
	bool                                          IsSuccess;                                         // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorMsg;                                          // 0x0068(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLOutputUtility_FormatNoticeRet) == 0x000008, "Wrong alignment on INTLOutputUtility_FormatNoticeRet");
static_assert(sizeof(INTLOutputUtility_FormatNoticeRet) == 0x000080, "Wrong size on INTLOutputUtility_FormatNoticeRet");
static_assert(offsetof(INTLOutputUtility_FormatNoticeRet, Ret) == 0x000000, "Member 'INTLOutputUtility_FormatNoticeRet::Ret' has a wrong offset!");
static_assert(offsetof(INTLOutputUtility_FormatNoticeRet, IsSuccess) == 0x000060, "Member 'INTLOutputUtility_FormatNoticeRet::IsSuccess' has a wrong offset!");
static_assert(offsetof(INTLOutputUtility_FormatNoticeRet, ErrorMsg) == 0x000068, "Member 'INTLOutputUtility_FormatNoticeRet::ErrorMsg' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnAccountResult
// 0x0278 (0x0278 - 0x0000)
struct INTLPluginObserver_OnAccountResult final
{
public:
	struct FINTLAccountResult                     Ret;                                               // 0x0000(0x0278)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnAccountResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnAccountResult");
static_assert(sizeof(INTLPluginObserver_OnAccountResult) == 0x000278, "Wrong size on INTLPluginObserver_OnAccountResult");
static_assert(offsetof(INTLPluginObserver_OnAccountResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnAccountResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnAdjustAttrsChangedResult
// 0x0050 (0x0050 - 0x0000)
struct INTLPluginObserver_OnAdjustAttrsChangedResult final
{
public:
	struct FINTLAdjustAttrsChangedResult          Ret;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnAdjustAttrsChangedResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnAdjustAttrsChangedResult");
static_assert(sizeof(INTLPluginObserver_OnAdjustAttrsChangedResult) == 0x000050, "Wrong size on INTLPluginObserver_OnAdjustAttrsChangedResult");
static_assert(offsetof(INTLPluginObserver_OnAdjustAttrsChangedResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnAdjustAttrsChangedResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnAuthBaseResult
// 0x0040 (0x0040 - 0x0000)
struct INTLPluginObserver_OnAuthBaseResult final
{
public:
	struct FINTLBaseResult                        Ret;                                               // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnAuthBaseResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnAuthBaseResult");
static_assert(sizeof(INTLPluginObserver_OnAuthBaseResult) == 0x000040, "Wrong size on INTLPluginObserver_OnAuthBaseResult");
static_assert(offsetof(INTLPluginObserver_OnAuthBaseResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnAuthBaseResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnAuthResult
// 0x0170 (0x0170 - 0x0000)
struct INTLPluginObserver_OnAuthResult final
{
public:
	struct FINTLAuthResult                        Ret;                                               // 0x0000(0x0170)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnAuthResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnAuthResult");
static_assert(sizeof(INTLPluginObserver_OnAuthResult) == 0x000170, "Wrong size on INTLPluginObserver_OnAuthResult");
static_assert(offsetof(INTLPluginObserver_OnAuthResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnAuthResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnComplianceResult
// 0x00F8 (0x00F8 - 0x0000)
struct INTLPluginObserver_OnComplianceResult final
{
public:
	struct FINTLComplianceResult                  Ret;                                               // 0x0000(0x00F8)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnComplianceResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnComplianceResult");
static_assert(sizeof(INTLPluginObserver_OnComplianceResult) == 0x0000F8, "Wrong size on INTLPluginObserver_OnComplianceResult");
static_assert(offsetof(INTLPluginObserver_OnComplianceResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnComplianceResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnCustomerResult
// 0x0048 (0x0048 - 0x0000)
struct INTLPluginObserver_OnCustomerResult final
{
public:
	struct FINTLCustomerResult                    Ret;                                               // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnCustomerResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnCustomerResult");
static_assert(sizeof(INTLPluginObserver_OnCustomerResult) == 0x000048, "Wrong size on INTLPluginObserver_OnCustomerResult");
static_assert(offsetof(INTLPluginObserver_OnCustomerResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnCustomerResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnCutoutResult
// 0x0070 (0x0070 - 0x0000)
struct INTLPluginObserver_OnCutoutResult final
{
public:
	struct FCutoutInfoResult                      Ret;                                               // 0x0000(0x0070)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnCutoutResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnCutoutResult");
static_assert(sizeof(INTLPluginObserver_OnCutoutResult) == 0x000070, "Wrong size on INTLPluginObserver_OnCutoutResult");
static_assert(offsetof(INTLPluginObserver_OnCutoutResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnCutoutResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnDeepLinkResult
// 0x0040 (0x0040 - 0x0000)
struct INTLPluginObserver_OnDeepLinkResult final
{
public:
	struct FINTLBaseResult                        Ret;                                               // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnDeepLinkResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnDeepLinkResult");
static_assert(sizeof(INTLPluginObserver_OnDeepLinkResult) == 0x000040, "Wrong size on INTLPluginObserver_OnDeepLinkResult");
static_assert(offsetof(INTLPluginObserver_OnDeepLinkResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnDeepLinkResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnDetectNetworkResult
// 0x0050 (0x0050 - 0x0000)
struct INTLPluginObserver_OnDetectNetworkResult final
{
public:
	struct FINTLDetectNetworkResult               Ret;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnDetectNetworkResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnDetectNetworkResult");
static_assert(sizeof(INTLPluginObserver_OnDetectNetworkResult) == 0x000050, "Wrong size on INTLPluginObserver_OnDetectNetworkResult");
static_assert(offsetof(INTLPluginObserver_OnDetectNetworkResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnDetectNetworkResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnDeviceLevelResult
// 0x0048 (0x0048 - 0x0000)
struct INTLPluginObserver_OnDeviceLevelResult final
{
public:
	struct FINTLDeviceLevelResult                 Ret;                                               // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnDeviceLevelResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnDeviceLevelResult");
static_assert(sizeof(INTLPluginObserver_OnDeviceLevelResult) == 0x000048, "Wrong size on INTLPluginObserver_OnDeviceLevelResult");
static_assert(offsetof(INTLPluginObserver_OnDeviceLevelResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnDeviceLevelResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnDirTreeResult
// 0x0070 (0x0070 - 0x0000)
struct INTLPluginObserver_OnDirTreeResult final
{
public:
	struct FINTLDirTreeResult                     Ret;                                               // 0x0000(0x0070)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnDirTreeResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnDirTreeResult");
static_assert(sizeof(INTLPluginObserver_OnDirTreeResult) == 0x000070, "Wrong size on INTLPluginObserver_OnDirTreeResult");
static_assert(offsetof(INTLPluginObserver_OnDirTreeResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnDirTreeResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnDismissLoginUI
// 0x0001 (0x0001 - 0x0000)
struct INTLPluginObserver_OnDismissLoginUI final
{
public:
	bool                                          Canceled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnDismissLoginUI) == 0x000001, "Wrong alignment on INTLPluginObserver_OnDismissLoginUI");
static_assert(sizeof(INTLPluginObserver_OnDismissLoginUI) == 0x000001, "Wrong size on INTLPluginObserver_OnDismissLoginUI");
static_assert(offsetof(INTLPluginObserver_OnDismissLoginUI, Canceled) == 0x000000, "Member 'INTLPluginObserver_OnDismissLoginUI::Canceled' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnDNSResult
// 0x0070 (0x0070 - 0x0000)
struct INTLPluginObserver_OnDNSResult final
{
public:
	struct FINTLDNSResult                         Ret;                                               // 0x0000(0x0070)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnDNSResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnDNSResult");
static_assert(sizeof(INTLPluginObserver_OnDNSResult) == 0x000070, "Wrong size on INTLPluginObserver_OnDNSResult");
static_assert(offsetof(INTLPluginObserver_OnDNSResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnDNSResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnExtendResult
// 0x0058 (0x0058 - 0x0000)
struct INTLPluginObserver_OnExtendResult final
{
public:
	struct FINTLExtendResult                      Ret;                                               // 0x0000(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnExtendResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnExtendResult");
static_assert(sizeof(INTLPluginObserver_OnExtendResult) == 0x000058, "Wrong size on INTLPluginObserver_OnExtendResult");
static_assert(offsetof(INTLPluginObserver_OnExtendResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnExtendResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnFriendBaseResult
// 0x0040 (0x0040 - 0x0000)
struct INTLPluginObserver_OnFriendBaseResult final
{
public:
	struct FINTLBaseResult                        Ret;                                               // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnFriendBaseResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnFriendBaseResult");
static_assert(sizeof(INTLPluginObserver_OnFriendBaseResult) == 0x000040, "Wrong size on INTLPluginObserver_OnFriendBaseResult");
static_assert(offsetof(INTLPluginObserver_OnFriendBaseResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnFriendBaseResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnFriendResult
// 0x0050 (0x0050 - 0x0000)
struct INTLPluginObserver_OnFriendResult final
{
public:
	struct FINTLFriendResult                      Ret;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnFriendResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnFriendResult");
static_assert(sizeof(INTLPluginObserver_OnFriendResult) == 0x000050, "Wrong size on INTLPluginObserver_OnFriendResult");
static_assert(offsetof(INTLPluginObserver_OnFriendResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnFriendResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnGroupReqInfoResult
// 0x0040 (0x0040 - 0x0000)
struct INTLPluginObserver_OnGroupReqInfoResult final
{
public:
	struct FINTLBaseResult                        Ret;                                               // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnGroupReqInfoResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnGroupReqInfoResult");
static_assert(sizeof(INTLPluginObserver_OnGroupReqInfoResult) == 0x000040, "Wrong size on INTLPluginObserver_OnGroupReqInfoResult");
static_assert(offsetof(INTLPluginObserver_OnGroupReqInfoResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnGroupReqInfoResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnIDTokenResult
// 0x0050 (0x0050 - 0x0000)
struct INTLPluginObserver_OnIDTokenResult final
{
public:
	struct FINTLIDTokenResult                     Ret;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnIDTokenResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnIDTokenResult");
static_assert(sizeof(INTLPluginObserver_OnIDTokenResult) == 0x000050, "Wrong size on INTLPluginObserver_OnIDTokenResult");
static_assert(offsetof(INTLPluginObserver_OnIDTokenResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnIDTokenResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnIPInfoResult
// 0x0068 (0x0068 - 0x0000)
struct INTLPluginObserver_OnIPInfoResult final
{
public:
	struct FINTLLBSIPInfoResult                   Ret;                                               // 0x0000(0x0068)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnIPInfoResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnIPInfoResult");
static_assert(sizeof(INTLPluginObserver_OnIPInfoResult) == 0x000068, "Wrong size on INTLPluginObserver_OnIPInfoResult");
static_assert(offsetof(INTLPluginObserver_OnIPInfoResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnIPInfoResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnLIBindRewardReult
// 0x0080 (0x0080 - 0x0000)
struct INTLPluginObserver_OnLIBindRewardReult final
{
public:
	struct FINTLLIBindRewardResult                Ret;                                               // 0x0000(0x0080)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnLIBindRewardReult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnLIBindRewardReult");
static_assert(sizeof(INTLPluginObserver_OnLIBindRewardReult) == 0x000080, "Wrong size on INTLPluginObserver_OnLIBindRewardReult");
static_assert(offsetof(INTLPluginObserver_OnLIBindRewardReult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnLIBindRewardReult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnNoticeRequestData
// 0x0060 (0x0060 - 0x0000)
struct INTLPluginObserver_OnNoticeRequestData final
{
public:
	struct FINTLNoticeResult                      Ret;                                               // 0x0000(0x0060)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnNoticeRequestData) == 0x000008, "Wrong alignment on INTLPluginObserver_OnNoticeRequestData");
static_assert(sizeof(INTLPluginObserver_OnNoticeRequestData) == 0x000060, "Wrong size on INTLPluginObserver_OnNoticeRequestData");
static_assert(offsetof(INTLPluginObserver_OnNoticeRequestData, Ret) == 0x000000, "Member 'INTLPluginObserver_OnNoticeRequestData::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnPermissionResult
// 0x0050 (0x0050 - 0x0000)
struct INTLPluginObserver_OnPermissionResult final
{
public:
	struct FINTLPermissionResult                  Ret;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnPermissionResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnPermissionResult");
static_assert(sizeof(INTLPluginObserver_OnPermissionResult) == 0x000050, "Wrong size on INTLPluginObserver_OnPermissionResult");
static_assert(offsetof(INTLPluginObserver_OnPermissionResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnPermissionResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnPushBaseResult
// 0x0040 (0x0040 - 0x0000)
struct INTLPluginObserver_OnPushBaseResult final
{
public:
	struct FINTLBaseResult                        Ret;                                               // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnPushBaseResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnPushBaseResult");
static_assert(sizeof(INTLPluginObserver_OnPushBaseResult) == 0x000040, "Wrong size on INTLPluginObserver_OnPushBaseResult");
static_assert(offsetof(INTLPluginObserver_OnPushBaseResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnPushBaseResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnPushResult
// 0x0058 (0x0058 - 0x0000)
struct INTLPluginObserver_OnPushResult final
{
public:
	struct FINTLPushResult                        Ret;                                               // 0x0000(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnPushResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnPushResult");
static_assert(sizeof(INTLPluginObserver_OnPushResult) == 0x000058, "Wrong size on INTLPluginObserver_OnPushResult");
static_assert(offsetof(INTLPluginObserver_OnPushResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnPushResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnStartUdpSocketResult
// 0x0058 (0x0058 - 0x0000)
struct INTLPluginObserver_OnStartUdpSocketResult final
{
public:
	struct FINTLStartUdpSocketResult              Ret;                                               // 0x0000(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnStartUdpSocketResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnStartUdpSocketResult");
static_assert(sizeof(INTLPluginObserver_OnStartUdpSocketResult) == 0x000058, "Wrong size on INTLPluginObserver_OnStartUdpSocketResult");
static_assert(offsetof(INTLPluginObserver_OnStartUdpSocketResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnStartUdpSocketResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnUpdateOptionalRepoInitResult
// 0x0048 (0x0048 - 0x0000)
struct INTLPluginObserver_OnUpdateOptionalRepoInitResult final
{
public:
	struct FINTLUpdateOptionalRepoInitResult      Ret;                                               // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnUpdateOptionalRepoInitResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnUpdateOptionalRepoInitResult");
static_assert(sizeof(INTLPluginObserver_OnUpdateOptionalRepoInitResult) == 0x000048, "Wrong size on INTLPluginObserver_OnUpdateOptionalRepoInitResult");
static_assert(offsetof(INTLPluginObserver_OnUpdateOptionalRepoInitResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnUpdateOptionalRepoInitResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnUpdateProgressResult
// 0x0068 (0x0068 - 0x0000)
struct INTLPluginObserver_OnUpdateProgressResult final
{
public:
	struct FINTLUpdateProgress                    Ret;                                               // 0x0000(0x0068)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnUpdateProgressResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnUpdateProgressResult");
static_assert(sizeof(INTLPluginObserver_OnUpdateProgressResult) == 0x000068, "Wrong size on INTLPluginObserver_OnUpdateProgressResult");
static_assert(offsetof(INTLPluginObserver_OnUpdateProgressResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnUpdateProgressResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnUpdateResult
// 0x0050 (0x0050 - 0x0000)
struct INTLPluginObserver_OnUpdateResult final
{
public:
	struct FINTLUpdateResult                      Ret;                                               // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnUpdateResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnUpdateResult");
static_assert(sizeof(INTLPluginObserver_OnUpdateResult) == 0x000050, "Wrong size on INTLPluginObserver_OnUpdateResult");
static_assert(offsetof(INTLPluginObserver_OnUpdateResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnUpdateResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnUpdateStartRepoNewVersionInfoResult
// 0x0040 (0x0040 - 0x0000)
struct INTLPluginObserver_OnUpdateStartRepoNewVersionInfoResult final
{
public:
	struct FINTLUpdateStartRepoNewVersionInfo     Ret;                                               // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnUpdateStartRepoNewVersionInfoResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnUpdateStartRepoNewVersionInfoResult");
static_assert(sizeof(INTLPluginObserver_OnUpdateStartRepoNewVersionInfoResult) == 0x000040, "Wrong size on INTLPluginObserver_OnUpdateStartRepoNewVersionInfoResult");
static_assert(offsetof(INTLPluginObserver_OnUpdateStartRepoNewVersionInfoResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnUpdateStartRepoNewVersionInfoResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnWebSocketResult
// 0x0080 (0x0080 - 0x0000)
struct INTLPluginObserver_OnWebSocketResult final
{
public:
	struct FINTLWebSocketResult                   Ret;                                               // 0x0000(0x0080)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnWebSocketResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnWebSocketResult");
static_assert(sizeof(INTLPluginObserver_OnWebSocketResult) == 0x000080, "Wrong size on INTLPluginObserver_OnWebSocketResult");
static_assert(offsetof(INTLPluginObserver_OnWebSocketResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnWebSocketResult::Ret' has a wrong offset!");

// Function INTLCore.INTLPluginObserver.OnWebViewResult
// 0x0058 (0x0058 - 0x0000)
struct INTLPluginObserver_OnWebViewResult final
{
public:
	struct FINTLWebViewResult                     Ret;                                               // 0x0000(0x0058)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLPluginObserver_OnWebViewResult) == 0x000008, "Wrong alignment on INTLPluginObserver_OnWebViewResult");
static_assert(sizeof(INTLPluginObserver_OnWebViewResult) == 0x000058, "Wrong size on INTLPluginObserver_OnWebViewResult");
static_assert(offsetof(INTLPluginObserver_OnWebViewResult, Ret) == 0x000000, "Member 'INTLPluginObserver_OnWebViewResult::Ret' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.AccountLoginWithLIPASS
// 0x0028 (0x0028 - 0x0000)
struct INTLSDKAPI_AccountLoginWithLIPASS final
{
public:
	EINTLLoginChannel                             Channel;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Permissions;                                       // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExtraJson;                                         // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_AccountLoginWithLIPASS) == 0x000008, "Wrong alignment on INTLSDKAPI_AccountLoginWithLIPASS");
static_assert(sizeof(INTLSDKAPI_AccountLoginWithLIPASS) == 0x000028, "Wrong size on INTLSDKAPI_AccountLoginWithLIPASS");
static_assert(offsetof(INTLSDKAPI_AccountLoginWithLIPASS, Channel) == 0x000000, "Member 'INTLSDKAPI_AccountLoginWithLIPASS::Channel' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_AccountLoginWithLIPASS, Permissions) == 0x000008, "Member 'INTLSDKAPI_AccountLoginWithLIPASS::Permissions' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_AccountLoginWithLIPASS, ExtraJson) == 0x000018, "Member 'INTLSDKAPI_AccountLoginWithLIPASS::ExtraJson' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.AddLocalNotification
// 0x0088 (0x0088 - 0x0000)
struct INTLSDKAPI_AddLocalNotification final
{
public:
	class FString                                 Channel;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FINTLLocalNotification                 LocalNotification;                                 // 0x0010(0x0078)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_AddLocalNotification) == 0x000008, "Wrong alignment on INTLSDKAPI_AddLocalNotification");
static_assert(sizeof(INTLSDKAPI_AddLocalNotification) == 0x000088, "Wrong size on INTLSDKAPI_AddLocalNotification");
static_assert(offsetof(INTLSDKAPI_AddLocalNotification, Channel) == 0x000000, "Member 'INTLSDKAPI_AddLocalNotification::Channel' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_AddLocalNotification, LocalNotification) == 0x000010, "Member 'INTLSDKAPI_AddLocalNotification::LocalNotification' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.AddLocalNotificationIOS
// 0x00B0 (0x00B0 - 0x0000)
struct INTLSDKAPI_AddLocalNotificationIOS final
{
public:
	class FString                                 Channel;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FINTLLocalNotificationIOS              LocalNotification;                                 // 0x0010(0x00A0)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_AddLocalNotificationIOS) == 0x000008, "Wrong alignment on INTLSDKAPI_AddLocalNotificationIOS");
static_assert(sizeof(INTLSDKAPI_AddLocalNotificationIOS) == 0x0000B0, "Wrong size on INTLSDKAPI_AddLocalNotificationIOS");
static_assert(offsetof(INTLSDKAPI_AddLocalNotificationIOS, Channel) == 0x000000, "Member 'INTLSDKAPI_AddLocalNotificationIOS::Channel' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_AddLocalNotificationIOS, LocalNotification) == 0x000010, "Member 'INTLSDKAPI_AddLocalNotificationIOS::LocalNotification' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.AddObserver
// 0x0010 (0x0010 - 0x0000)
struct INTLSDKAPI_AddObserver final
{
public:
	TScriptInterface<class IINTLPluginObserver>   Observer;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_AddObserver) == 0x000008, "Wrong alignment on INTLSDKAPI_AddObserver");
static_assert(sizeof(INTLSDKAPI_AddObserver) == 0x000010, "Wrong size on INTLSDKAPI_AddObserver");
static_assert(offsetof(INTLSDKAPI_AddObserver, Observer) == 0x000000, "Member 'INTLSDKAPI_AddObserver::Observer' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.AutoLogin
// 0x0001 (0x0001 - 0x0000)
struct INTLSDKAPI_AutoLogin final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_AutoLogin) == 0x000001, "Wrong alignment on INTLSDKAPI_AutoLogin");
static_assert(sizeof(INTLSDKAPI_AutoLogin) == 0x000001, "Wrong size on INTLSDKAPI_AutoLogin");
static_assert(offsetof(INTLSDKAPI_AutoLogin, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_AutoLogin::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.AutoLoginForLI
// 0x0001 (0x0001 - 0x0000)
struct INTLSDKAPI_AutoLoginForLI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_AutoLoginForLI) == 0x000001, "Wrong alignment on INTLSDKAPI_AutoLoginForLI");
static_assert(sizeof(INTLSDKAPI_AutoLoginForLI) == 0x000001, "Wrong size on INTLSDKAPI_AutoLoginForLI");
static_assert(offsetof(INTLSDKAPI_AutoLoginForLI, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_AutoLoginForLI::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.Bind
// 0x0030 (0x0030 - 0x0000)
struct INTLSDKAPI_Bind final
{
public:
	EINTLLoginChannel                             Channel;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Permissions;                                       // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExtraJson;                                         // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(INTLSDKAPI_Bind) == 0x000008, "Wrong alignment on INTLSDKAPI_Bind");
static_assert(sizeof(INTLSDKAPI_Bind) == 0x000030, "Wrong size on INTLSDKAPI_Bind");
static_assert(offsetof(INTLSDKAPI_Bind, Channel) == 0x000000, "Member 'INTLSDKAPI_Bind::Channel' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_Bind, Permissions) == 0x000008, "Member 'INTLSDKAPI_Bind::Permissions' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_Bind, ExtraJson) == 0x000018, "Member 'INTLSDKAPI_Bind::ExtraJson' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_Bind, ReturnValue) == 0x000028, "Member 'INTLSDKAPI_Bind::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.BindWithLoggedinChannel
// 0x0001 (0x0001 - 0x0000)
struct INTLSDKAPI_BindWithLoggedinChannel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_BindWithLoggedinChannel) == 0x000001, "Wrong alignment on INTLSDKAPI_BindWithLoggedinChannel");
static_assert(sizeof(INTLSDKAPI_BindWithLoggedinChannel) == 0x000001, "Wrong size on INTLSDKAPI_BindWithLoggedinChannel");
static_assert(offsetof(INTLSDKAPI_BindWithLoggedinChannel, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_BindWithLoggedinChannel::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.BuildMapWithLoggedinChannel
// 0x0001 (0x0001 - 0x0000)
struct INTLSDKAPI_BuildMapWithLoggedinChannel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_BuildMapWithLoggedinChannel) == 0x000001, "Wrong alignment on INTLSDKAPI_BuildMapWithLoggedinChannel");
static_assert(sizeof(INTLSDKAPI_BuildMapWithLoggedinChannel) == 0x000001, "Wrong size on INTLSDKAPI_BuildMapWithLoggedinChannel");
static_assert(offsetof(INTLSDKAPI_BuildMapWithLoggedinChannel, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_BuildMapWithLoggedinChannel::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.CallJS
// 0x0010 (0x0010 - 0x0000)
struct INTLSDKAPI_CallJS final
{
public:
	class FString                                 JsonJsParam;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_CallJS) == 0x000008, "Wrong alignment on INTLSDKAPI_CallJS");
static_assert(sizeof(INTLSDKAPI_CallJS) == 0x000010, "Wrong size on INTLSDKAPI_CallJS");
static_assert(offsetof(INTLSDKAPI_CallJS, JsonJsParam) == 0x000000, "Member 'INTLSDKAPI_CallJS::JsonJsParam' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.CancelLogin
// 0x0020 (0x0020 - 0x0000)
struct INTLSDKAPI_CancelLogin final
{
public:
	class FString                                 Channel;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Extra_json;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_CancelLogin) == 0x000008, "Wrong alignment on INTLSDKAPI_CancelLogin");
static_assert(sizeof(INTLSDKAPI_CancelLogin) == 0x000020, "Wrong size on INTLSDKAPI_CancelLogin");
static_assert(offsetof(INTLSDKAPI_CancelLogin, Channel) == 0x000000, "Member 'INTLSDKAPI_CancelLogin::Channel' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_CancelLogin, Extra_json) == 0x000010, "Member 'INTLSDKAPI_CancelLogin::Extra_json' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ChangeIsReceiveEmail
// 0x0008 (0x0008 - 0x0000)
struct INTLSDKAPI_ChangeIsReceiveEmail final
{
public:
	int32                                         Recv_email;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(INTLSDKAPI_ChangeIsReceiveEmail) == 0x000004, "Wrong alignment on INTLSDKAPI_ChangeIsReceiveEmail");
static_assert(sizeof(INTLSDKAPI_ChangeIsReceiveEmail) == 0x000008, "Wrong size on INTLSDKAPI_ChangeIsReceiveEmail");
static_assert(offsetof(INTLSDKAPI_ChangeIsReceiveEmail, Recv_email) == 0x000000, "Member 'INTLSDKAPI_ChangeIsReceiveEmail::Recv_email' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ChangeIsReceiveEmail, ReturnValue) == 0x000004, "Member 'INTLSDKAPI_ChangeIsReceiveEmail::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.CheckActiveUser
// 0x0001 (0x0001 - 0x0000)
struct INTLSDKAPI_CheckActiveUser final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_CheckActiveUser) == 0x000001, "Wrong alignment on INTLSDKAPI_CheckActiveUser");
static_assert(sizeof(INTLSDKAPI_CheckActiveUser) == 0x000001, "Wrong size on INTLSDKAPI_CheckActiveUser");
static_assert(offsetof(INTLSDKAPI_CheckActiveUser, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_CheckActiveUser::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.CheckOptionalRepoFiles
// 0x0028 (0x0028 - 0x0000)
struct INTLSDKAPI_CheckOptionalRepoFiles final
{
public:
	int32                                         RepoID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         FilesPath;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FINTLUpdateOptionalRepoFilesStatus> ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_CheckOptionalRepoFiles) == 0x000008, "Wrong alignment on INTLSDKAPI_CheckOptionalRepoFiles");
static_assert(sizeof(INTLSDKAPI_CheckOptionalRepoFiles) == 0x000028, "Wrong size on INTLSDKAPI_CheckOptionalRepoFiles");
static_assert(offsetof(INTLSDKAPI_CheckOptionalRepoFiles, RepoID) == 0x000000, "Member 'INTLSDKAPI_CheckOptionalRepoFiles::RepoID' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_CheckOptionalRepoFiles, FilesPath) == 0x000008, "Member 'INTLSDKAPI_CheckOptionalRepoFiles::FilesPath' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_CheckOptionalRepoFiles, ReturnValue) == 0x000018, "Member 'INTLSDKAPI_CheckOptionalRepoFiles::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.CheckPermissionStatus
// 0x0010 (0x0010 - 0x0000)
struct INTLSDKAPI_CheckPermissionStatus final
{
public:
	TArray<EPermissionType>                       PermissionTypeArray;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_CheckPermissionStatus) == 0x000008, "Wrong alignment on INTLSDKAPI_CheckPermissionStatus");
static_assert(sizeof(INTLSDKAPI_CheckPermissionStatus) == 0x000010, "Wrong size on INTLSDKAPI_CheckPermissionStatus");
static_assert(offsetof(INTLSDKAPI_CheckPermissionStatus, PermissionTypeArray) == 0x000000, "Member 'INTLSDKAPI_CheckPermissionStatus::PermissionTypeArray' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.CheckTwoFALoginForLI
// 0x0030 (0x0030 - 0x0000)
struct INTLSDKAPI_CheckTwoFALoginForLI final
{
public:
	class FString                                 Two_fa_confirm_code;                               // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Two_fa_verify_code;                                // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Two_fa_li_email;                                   // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_CheckTwoFALoginForLI) == 0x000008, "Wrong alignment on INTLSDKAPI_CheckTwoFALoginForLI");
static_assert(sizeof(INTLSDKAPI_CheckTwoFALoginForLI) == 0x000030, "Wrong size on INTLSDKAPI_CheckTwoFALoginForLI");
static_assert(offsetof(INTLSDKAPI_CheckTwoFALoginForLI, Two_fa_confirm_code) == 0x000000, "Member 'INTLSDKAPI_CheckTwoFALoginForLI::Two_fa_confirm_code' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_CheckTwoFALoginForLI, Two_fa_verify_code) == 0x000010, "Member 'INTLSDKAPI_CheckTwoFALoginForLI::Two_fa_verify_code' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_CheckTwoFALoginForLI, Two_fa_li_email) == 0x000020, "Member 'INTLSDKAPI_CheckTwoFALoginForLI::Two_fa_li_email' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ClearLocalNotifications
// 0x0010 (0x0010 - 0x0000)
struct INTLSDKAPI_ClearLocalNotifications final
{
public:
	class FString                                 Channel;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_ClearLocalNotifications) == 0x000008, "Wrong alignment on INTLSDKAPI_ClearLocalNotifications");
static_assert(sizeof(INTLSDKAPI_ClearLocalNotifications) == 0x000010, "Wrong size on INTLSDKAPI_ClearLocalNotifications");
static_assert(offsetof(INTLSDKAPI_ClearLocalNotifications, Channel) == 0x000000, "Member 'INTLSDKAPI_ClearLocalNotifications::Channel' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ClearUserStorage
// 0x0018 (0x0018 - 0x0000)
struct INTLSDKAPI_ClearUserStorage final
{
public:
	class FString                                 Sub_dir;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(INTLSDKAPI_ClearUserStorage) == 0x000008, "Wrong alignment on INTLSDKAPI_ClearUserStorage");
static_assert(sizeof(INTLSDKAPI_ClearUserStorage) == 0x000018, "Wrong size on INTLSDKAPI_ClearUserStorage");
static_assert(offsetof(INTLSDKAPI_ClearUserStorage, Sub_dir) == 0x000000, "Member 'INTLSDKAPI_ClearUserStorage::Sub_dir' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ClearUserStorage, ReturnValue) == 0x000010, "Member 'INTLSDKAPI_ClearUserStorage::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ClosePlayStationErrorDialog
// 0x0004 (0x0004 - 0x0000)
struct INTLSDKAPI_ClosePlayStationErrorDialog final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_ClosePlayStationErrorDialog) == 0x000004, "Wrong alignment on INTLSDKAPI_ClosePlayStationErrorDialog");
static_assert(sizeof(INTLSDKAPI_ClosePlayStationErrorDialog) == 0x000004, "Wrong size on INTLSDKAPI_ClosePlayStationErrorDialog");
static_assert(offsetof(INTLSDKAPI_ClosePlayStationErrorDialog, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_ClosePlayStationErrorDialog::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.CloseWebSocket
// 0x0010 (0x0010 - 0x0000)
struct INTLSDKAPI_CloseWebSocket final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_CloseWebSocket) == 0x000008, "Wrong alignment on INTLSDKAPI_CloseWebSocket");
static_assert(sizeof(INTLSDKAPI_CloseWebSocket) == 0x000010, "Wrong size on INTLSDKAPI_CloseWebSocket");
static_assert(offsetof(INTLSDKAPI_CloseWebSocket, URL) == 0x000000, "Member 'INTLSDKAPI_CloseWebSocket::URL' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ComplianceCommitBirthday
// 0x000C (0x000C - 0x0000)
struct INTLSDKAPI_ComplianceCommitBirthday final
{
public:
	int32                                         BirthdayYear;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BirthdayMonth;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BirthdayDay;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_ComplianceCommitBirthday) == 0x000004, "Wrong alignment on INTLSDKAPI_ComplianceCommitBirthday");
static_assert(sizeof(INTLSDKAPI_ComplianceCommitBirthday) == 0x00000C, "Wrong size on INTLSDKAPI_ComplianceCommitBirthday");
static_assert(offsetof(INTLSDKAPI_ComplianceCommitBirthday, BirthdayYear) == 0x000000, "Member 'INTLSDKAPI_ComplianceCommitBirthday::BirthdayYear' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceCommitBirthday, BirthdayMonth) == 0x000004, "Member 'INTLSDKAPI_ComplianceCommitBirthday::BirthdayMonth' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceCommitBirthday, BirthdayDay) == 0x000008, "Member 'INTLSDKAPI_ComplianceCommitBirthday::BirthdayDay' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ComplianceGetConsoleCreditCardVerifyUrl
// 0x0010 (0x0010 - 0x0000)
struct INTLSDKAPI_ComplianceGetConsoleCreditCardVerifyUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_ComplianceGetConsoleCreditCardVerifyUrl) == 0x000008, "Wrong alignment on INTLSDKAPI_ComplianceGetConsoleCreditCardVerifyUrl");
static_assert(sizeof(INTLSDKAPI_ComplianceGetConsoleCreditCardVerifyUrl) == 0x000010, "Wrong size on INTLSDKAPI_ComplianceGetConsoleCreditCardVerifyUrl");
static_assert(offsetof(INTLSDKAPI_ComplianceGetConsoleCreditCardVerifyUrl, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_ComplianceGetConsoleCreditCardVerifyUrl::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ComplianceGetConsoleRealNameVerifyUrl
// 0x0020 (0x0020 - 0x0000)
struct INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl final
{
public:
	class FString                                 Region;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl) == 0x000008, "Wrong alignment on INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl");
static_assert(sizeof(INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl) == 0x000020, "Wrong size on INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl");
static_assert(offsetof(INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl, Region) == 0x000000, "Member 'INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl::Region' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl, ReturnValue) == 0x000010, "Member 'INTLSDKAPI_ComplianceGetConsoleRealNameVerifyUrl::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ComplianceInit
// 0x0001 (0x0001 - 0x0000)
struct INTLSDKAPI_ComplianceInit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(INTLSDKAPI_ComplianceInit) == 0x000001, "Wrong alignment on INTLSDKAPI_ComplianceInit");
static_assert(sizeof(INTLSDKAPI_ComplianceInit) == 0x000001, "Wrong size on INTLSDKAPI_ComplianceInit");
static_assert(offsetof(INTLSDKAPI_ComplianceInit, ReturnValue) == 0x000000, "Member 'INTLSDKAPI_ComplianceInit::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ComplianceInitWithParams
// 0x0038 (0x0038 - 0x0000)
struct INTLSDKAPI_ComplianceInitWithParams final
{
public:
	class FString                                 GameId;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenID;                                            // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelID;                                         // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(INTLSDKAPI_ComplianceInitWithParams) == 0x000008, "Wrong alignment on INTLSDKAPI_ComplianceInitWithParams");
static_assert(sizeof(INTLSDKAPI_ComplianceInitWithParams) == 0x000038, "Wrong size on INTLSDKAPI_ComplianceInitWithParams");
static_assert(offsetof(INTLSDKAPI_ComplianceInitWithParams, GameId) == 0x000000, "Member 'INTLSDKAPI_ComplianceInitWithParams::GameId' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceInitWithParams, OpenID) == 0x000010, "Member 'INTLSDKAPI_ComplianceInitWithParams::OpenID' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceInitWithParams, Token) == 0x000020, "Member 'INTLSDKAPI_ComplianceInitWithParams::Token' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceInitWithParams, ChannelID) == 0x000030, "Member 'INTLSDKAPI_ComplianceInitWithParams::ChannelID' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceInitWithParams, ReturnValue) == 0x000034, "Member 'INTLSDKAPI_ComplianceInitWithParams::ReturnValue' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ComplianceMultiSetStatusWithAdultCheckStatus
// 0x0058 (0x0058 - 0x0000)
struct INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus final
{
public:
	class FString                                 OpenID;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Otoken;                                            // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Region;                                            // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AdultCheckStatus;                                  // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompareAge;                                        // 0x0034(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CertificateType;                                   // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExtraJson;                                         // 0x0040(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelID;                                         // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus) == 0x000008, "Wrong alignment on INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus");
static_assert(sizeof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus) == 0x000058, "Wrong size on INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, OpenID) == 0x000000, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::OpenID' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, Otoken) == 0x000010, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::Otoken' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, Region) == 0x000020, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::Region' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, AdultCheckStatus) == 0x000030, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::AdultCheckStatus' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, CompareAge) == 0x000034, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::CompareAge' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, CertificateType) == 0x000038, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::CertificateType' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, ExtraJson) == 0x000040, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::ExtraJson' has a wrong offset!");
static_assert(offsetof(INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus, ChannelID) == 0x000050, "Member 'INTLSDKAPI_ComplianceMultiSetStatusWithAdultCheckStatus::ChannelID' has a wrong offset!");

// Function INTLCore.INTLSDKAPI.ComplianceMultiSetStatusWithAge
// 0x0050 (0x0050 - 0x0000)
struct INTLSDKAPI_ComplianceMultiSetStatusWithAge final
{
public:
	class FString                                 OpenID;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Otoken;                                            // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Region;                                            // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
