#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KantanChartsSlate

#include "Basic.hpp"

#include "KantanChartsSlate_structs.hpp"
#include "SlateCore_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class KantanChartsSlate.KantanBarChartWidgetStyle
// 0x0180 (0x01B0 - 0x0030)
class UKantanBarChartWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FKantanBarChartStyle                   ChartStyle;                                        // 0x0030(0x0180)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KantanBarChartWidgetStyle">();
	}
	static class UKantanBarChartWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanBarChartWidgetStyle>();
	}
};
static_assert(alignof(UKantanBarChartWidgetStyle) == 0x000010, "Wrong alignment on UKantanBarChartWidgetStyle");
static_assert(sizeof(UKantanBarChartWidgetStyle) == 0x0001B0, "Wrong size on UKantanBarChartWidgetStyle");
static_assert(offsetof(UKantanBarChartWidgetStyle, ChartStyle) == 0x000030, "Member 'UKantanBarChartWidgetStyle::ChartStyle' has a wrong offset!");

// Class KantanChartsSlate.KantanCartesianChartWidgetStyle
// 0x0180 (0x01B0 - 0x0030)
class UKantanCartesianChartWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FKantanCartesianChartStyle             ChartStyle;                                        // 0x0030(0x0180)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KantanCartesianChartWidgetStyle">();
	}
	static class UKantanCartesianChartWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanCartesianChartWidgetStyle>();
	}
};
static_assert(alignof(UKantanCartesianChartWidgetStyle) == 0x000010, "Wrong alignment on UKantanCartesianChartWidgetStyle");
static_assert(sizeof(UKantanCartesianChartWidgetStyle) == 0x0001B0, "Wrong size on UKantanCartesianChartWidgetStyle");
static_assert(offsetof(UKantanCartesianChartWidgetStyle, ChartStyle) == 0x000030, "Member 'UKantanCartesianChartWidgetStyle::ChartStyle' has a wrong offset!");

// Class KantanChartsSlate.KantanCategoryStyleSet
// 0x0010 (0x0040 - 0x0030)
class UKantanCategoryStyleSet final : public UDataAsset
{
public:
	TArray<struct FKantanCategoryStyle>           Styles;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KantanCategoryStyleSet">();
	}
	static class UKantanCategoryStyleSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanCategoryStyleSet>();
	}
};
static_assert(alignof(UKantanCategoryStyleSet) == 0x000008, "Wrong alignment on UKantanCategoryStyleSet");
static_assert(sizeof(UKantanCategoryStyleSet) == 0x000040, "Wrong size on UKantanCategoryStyleSet");
static_assert(offsetof(UKantanCategoryStyleSet, Styles) == 0x000030, "Member 'UKantanCategoryStyleSet::Styles' has a wrong offset!");

// Class KantanChartsSlate.KantanPointStyle
// 0x0020 (0x0050 - 0x0030)
class UKantanPointStyle final : public UDataAsset
{
public:
	class UTexture2D*                             DataPointTexture;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              PointSizeTextureOffsets[0x3];                      // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KantanPointStyle">();
	}
	static class UKantanPointStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanPointStyle>();
	}
};
static_assert(alignof(UKantanPointStyle) == 0x000008, "Wrong alignment on UKantanPointStyle");
static_assert(sizeof(UKantanPointStyle) == 0x000050, "Wrong size on UKantanPointStyle");
static_assert(offsetof(UKantanPointStyle, DataPointTexture) == 0x000030, "Member 'UKantanPointStyle::DataPointTexture' has a wrong offset!");
static_assert(offsetof(UKantanPointStyle, PointSizeTextureOffsets) == 0x000038, "Member 'UKantanPointStyle::PointSizeTextureOffsets' has a wrong offset!");

// Class KantanChartsSlate.KantanSeriesStyleSet
// 0x0010 (0x0040 - 0x0030)
class UKantanSeriesStyleSet final : public UDataAsset
{
public:
	TArray<struct FKantanSeriesStyle>             Styles;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KantanSeriesStyleSet">();
	}
	static class UKantanSeriesStyleSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanSeriesStyleSet>();
	}
};
static_assert(alignof(UKantanSeriesStyleSet) == 0x000008, "Wrong alignment on UKantanSeriesStyleSet");
static_assert(sizeof(UKantanSeriesStyleSet) == 0x000040, "Wrong size on UKantanSeriesStyleSet");
static_assert(offsetof(UKantanSeriesStyleSet, Styles) == 0x000030, "Member 'UKantanSeriesStyleSet::Styles' has a wrong offset!");

}

