#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KantanChartsUMG

#include "Basic.hpp"

#include "KantanChartsSlate_structs.hpp"


namespace SDK
{

// ScriptStruct KantanChartsUMG.SeriesStyleManualMapping
// 0x0028 (0x0028 - 0x0000)
struct FSeriesStyleManualMapping final
{
public:
	class FName                                   SeriesId;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKantanSeriesStyle                     Style;                                             // 0x0008(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSeriesStyleManualMapping) == 0x000008, "Wrong alignment on FSeriesStyleManualMapping");
static_assert(sizeof(FSeriesStyleManualMapping) == 0x000028, "Wrong size on FSeriesStyleManualMapping");
static_assert(offsetof(FSeriesStyleManualMapping, SeriesId) == 0x000000, "Member 'FSeriesStyleManualMapping::SeriesId' has a wrong offset!");
static_assert(offsetof(FSeriesStyleManualMapping, Style) == 0x000008, "Member 'FSeriesStyleManualMapping::Style' has a wrong offset!");

// ScriptStruct KantanChartsUMG.CategoryStyleManualMapping
// 0x0020 (0x0020 - 0x0000)
struct FCategoryStyleManualMapping final
{
public:
	class FName                                   CategoryId;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKantanCategoryStyle                   Style;                                             // 0x0008(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCategoryStyleManualMapping) == 0x000004, "Wrong alignment on FCategoryStyleManualMapping");
static_assert(sizeof(FCategoryStyleManualMapping) == 0x000020, "Wrong size on FCategoryStyleManualMapping");
static_assert(offsetof(FCategoryStyleManualMapping, CategoryId) == 0x000000, "Member 'FCategoryStyleManualMapping::CategoryId' has a wrong offset!");
static_assert(offsetof(FCategoryStyleManualMapping, Style) == 0x000008, "Member 'FCategoryStyleManualMapping::Style' has a wrong offset!");

}

