#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LyraGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "LyraGame_structs.hpp"
#include "AudioMixer_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CommonUser_structs.hpp"


namespace SDK::Params
{

// Function LyraGame.TgfAbilityCheats.AddAbilitySet
// 0x0004 (0x0004 - 0x0000)
struct TgfAbilityCheats_AddAbilitySet final
{
public:
	int32                                         AbilitySetId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_AddAbilitySet) == 0x000004, "Wrong alignment on TgfAbilityCheats_AddAbilitySet");
static_assert(sizeof(TgfAbilityCheats_AddAbilitySet) == 0x000004, "Wrong size on TgfAbilityCheats_AddAbilitySet");
static_assert(offsetof(TgfAbilityCheats_AddAbilitySet, AbilitySetId) == 0x000000, "Member 'TgfAbilityCheats_AddAbilitySet::AbilitySetId' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.AddAttrValue
// 0x0018 (0x0018 - 0x0000)
struct TgfAbilityCheats_AddAttrValue final
{
public:
	class FString                                 AttrStr;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfAbilityCheats_AddAttrValue) == 0x000008, "Wrong alignment on TgfAbilityCheats_AddAttrValue");
static_assert(sizeof(TgfAbilityCheats_AddAttrValue) == 0x000018, "Wrong size on TgfAbilityCheats_AddAttrValue");
static_assert(offsetof(TgfAbilityCheats_AddAttrValue, AttrStr) == 0x000000, "Member 'TgfAbilityCheats_AddAttrValue::AttrStr' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_AddAttrValue, Value) == 0x000010, "Member 'TgfAbilityCheats_AddAttrValue::Value' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.AddLooseGameplayTag
// 0x0018 (0x0018 - 0x0000)
struct TgfAbilityCheats_AddLooseGameplayTag final
{
public:
	class FString                                 TagName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Nums;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeedReplicated;                                    // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FoundTagInServer;                                  // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfAbilityCheats_AddLooseGameplayTag) == 0x000008, "Wrong alignment on TgfAbilityCheats_AddLooseGameplayTag");
static_assert(sizeof(TgfAbilityCheats_AddLooseGameplayTag) == 0x000018, "Wrong size on TgfAbilityCheats_AddLooseGameplayTag");
static_assert(offsetof(TgfAbilityCheats_AddLooseGameplayTag, TagName) == 0x000000, "Member 'TgfAbilityCheats_AddLooseGameplayTag::TagName' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_AddLooseGameplayTag, Nums) == 0x000010, "Member 'TgfAbilityCheats_AddLooseGameplayTag::Nums' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_AddLooseGameplayTag, NeedReplicated) == 0x000014, "Member 'TgfAbilityCheats_AddLooseGameplayTag::NeedReplicated' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_AddLooseGameplayTag, FoundTagInServer) == 0x000015, "Member 'TgfAbilityCheats_AddLooseGameplayTag::FoundTagInServer' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.GiveAbilitySet
// 0x0010 (0x0010 - 0x0000)
struct TgfAbilityCheats_GiveAbilitySet final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_GiveAbilitySet) == 0x000008, "Wrong alignment on TgfAbilityCheats_GiveAbilitySet");
static_assert(sizeof(TgfAbilityCheats_GiveAbilitySet) == 0x000010, "Wrong size on TgfAbilityCheats_GiveAbilitySet");
static_assert(offsetof(TgfAbilityCheats_GiveAbilitySet, AssetName) == 0x000000, "Member 'TgfAbilityCheats_GiveAbilitySet::AssetName' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.InjectInput
// 0x0010 (0x0010 - 0x0000)
struct TgfAbilityCheats_InjectInput final
{
public:
	class FString                                 InputStr;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_InjectInput) == 0x000008, "Wrong alignment on TgfAbilityCheats_InjectInput");
static_assert(sizeof(TgfAbilityCheats_InjectInput) == 0x000010, "Wrong size on TgfAbilityCheats_InjectInput");
static_assert(offsetof(TgfAbilityCheats_InjectInput, InputStr) == 0x000000, "Member 'TgfAbilityCheats_InjectInput::InputStr' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.MulAttrValue
// 0x0018 (0x0018 - 0x0000)
struct TgfAbilityCheats_MulAttrValue final
{
public:
	class FString                                 AttrStr;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfAbilityCheats_MulAttrValue) == 0x000008, "Wrong alignment on TgfAbilityCheats_MulAttrValue");
static_assert(sizeof(TgfAbilityCheats_MulAttrValue) == 0x000018, "Wrong size on TgfAbilityCheats_MulAttrValue");
static_assert(offsetof(TgfAbilityCheats_MulAttrValue, AttrStr) == 0x000000, "Member 'TgfAbilityCheats_MulAttrValue::AttrStr' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_MulAttrValue, Value) == 0x000010, "Member 'TgfAbilityCheats_MulAttrValue::Value' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.RebirthLocation
// 0x000C (0x000C - 0x0000)
struct TgfAbilityCheats_RebirthLocation final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_RebirthLocation) == 0x000004, "Wrong alignment on TgfAbilityCheats_RebirthLocation");
static_assert(sizeof(TgfAbilityCheats_RebirthLocation) == 0x00000C, "Wrong size on TgfAbilityCheats_RebirthLocation");
static_assert(offsetof(TgfAbilityCheats_RebirthLocation, X) == 0x000000, "Member 'TgfAbilityCheats_RebirthLocation::X' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_RebirthLocation, Y) == 0x000004, "Member 'TgfAbilityCheats_RebirthLocation::Y' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_RebirthLocation, Z) == 0x000008, "Member 'TgfAbilityCheats_RebirthLocation::Z' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.RemoveLooseGameplayTag
// 0x0018 (0x0018 - 0x0000)
struct TgfAbilityCheats_RemoveLooseGameplayTag final
{
public:
	class FString                                 TagName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Nums;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeedReplicated;                                    // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FoundTagInServer;                                  // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfAbilityCheats_RemoveLooseGameplayTag) == 0x000008, "Wrong alignment on TgfAbilityCheats_RemoveLooseGameplayTag");
static_assert(sizeof(TgfAbilityCheats_RemoveLooseGameplayTag) == 0x000018, "Wrong size on TgfAbilityCheats_RemoveLooseGameplayTag");
static_assert(offsetof(TgfAbilityCheats_RemoveLooseGameplayTag, TagName) == 0x000000, "Member 'TgfAbilityCheats_RemoveLooseGameplayTag::TagName' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_RemoveLooseGameplayTag, Nums) == 0x000010, "Member 'TgfAbilityCheats_RemoveLooseGameplayTag::Nums' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_RemoveLooseGameplayTag, NeedReplicated) == 0x000014, "Member 'TgfAbilityCheats_RemoveLooseGameplayTag::NeedReplicated' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_RemoveLooseGameplayTag, FoundTagInServer) == 0x000015, "Member 'TgfAbilityCheats_RemoveLooseGameplayTag::FoundTagInServer' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.SetAttrValue
// 0x0018 (0x0018 - 0x0000)
struct TgfAbilityCheats_SetAttrValue final
{
public:
	class FString                                 AttrStr;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfAbilityCheats_SetAttrValue) == 0x000008, "Wrong alignment on TgfAbilityCheats_SetAttrValue");
static_assert(sizeof(TgfAbilityCheats_SetAttrValue) == 0x000018, "Wrong size on TgfAbilityCheats_SetAttrValue");
static_assert(offsetof(TgfAbilityCheats_SetAttrValue, AttrStr) == 0x000000, "Member 'TgfAbilityCheats_SetAttrValue::AttrStr' has a wrong offset!");
static_assert(offsetof(TgfAbilityCheats_SetAttrValue, Value) == 0x000010, "Member 'TgfAbilityCheats_SetAttrValue::Value' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.SetFirstLevel
// 0x0004 (0x0004 - 0x0000)
struct TgfAbilityCheats_SetFirstLevel final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_SetFirstLevel) == 0x000004, "Wrong alignment on TgfAbilityCheats_SetFirstLevel");
static_assert(sizeof(TgfAbilityCheats_SetFirstLevel) == 0x000004, "Wrong size on TgfAbilityCheats_SetFirstLevel");
static_assert(offsetof(TgfAbilityCheats_SetFirstLevel, Value) == 0x000000, "Member 'TgfAbilityCheats_SetFirstLevel::Value' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.ToggleAuthIgnoreAbilitySystemCooldowns
// 0x0001 (0x0001 - 0x0000)
struct TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCooldowns final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCooldowns) == 0x000001, "Wrong alignment on TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCooldowns");
static_assert(sizeof(TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCooldowns) == 0x000001, "Wrong size on TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCooldowns");
static_assert(offsetof(TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCooldowns, Enabled) == 0x000000, "Member 'TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCooldowns::Enabled' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.ToggleAuthIgnoreAbilitySystemCosts
// 0x0001 (0x0001 - 0x0000)
struct TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCosts final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCosts) == 0x000001, "Wrong alignment on TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCosts");
static_assert(sizeof(TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCosts) == 0x000001, "Wrong size on TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCosts");
static_assert(offsetof(TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCosts, Enabled) == 0x000000, "Member 'TgfAbilityCheats_ToggleAuthIgnoreAbilitySystemCosts::Enabled' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.TriggerInput
// 0x0010 (0x0010 - 0x0000)
struct TgfAbilityCheats_TriggerInput final
{
public:
	class FString                                 InputStr;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_TriggerInput) == 0x000008, "Wrong alignment on TgfAbilityCheats_TriggerInput");
static_assert(sizeof(TgfAbilityCheats_TriggerInput) == 0x000010, "Wrong size on TgfAbilityCheats_TriggerInput");
static_assert(offsetof(TgfAbilityCheats_TriggerInput, InputStr) == 0x000000, "Member 'TgfAbilityCheats_TriggerInput::InputStr' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.TriggerInputContinous
// 0x0010 (0x0010 - 0x0000)
struct TgfAbilityCheats_TriggerInputContinous final
{
public:
	class FString                                 InputStr;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_TriggerInputContinous) == 0x000008, "Wrong alignment on TgfAbilityCheats_TriggerInputContinous");
static_assert(sizeof(TgfAbilityCheats_TriggerInputContinous) == 0x000010, "Wrong size on TgfAbilityCheats_TriggerInputContinous");
static_assert(offsetof(TgfAbilityCheats_TriggerInputContinous, InputStr) == 0x000000, "Member 'TgfAbilityCheats_TriggerInputContinous::InputStr' has a wrong offset!");

// Function LyraGame.TgfAbilityCheats.UseOldHit
// 0x0001 (0x0001 - 0x0000)
struct TgfAbilityCheats_UseOldHit final
{
public:
	bool                                          UseOld;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfAbilityCheats_UseOldHit) == 0x000001, "Wrong alignment on TgfAbilityCheats_UseOldHit");
static_assert(sizeof(TgfAbilityCheats_UseOldHit) == 0x000001, "Wrong size on TgfAbilityCheats_UseOldHit");
static_assert(offsetof(TgfAbilityCheats_UseOldHit, UseOld) == 0x000000, "Member 'TgfAbilityCheats_UseOldHit::UseOld' has a wrong offset!");

// Function LyraGame.AbilityTask_WaitGameplayTagCountChanged.WaitGameplayTagCountChanged
// 0x0028 (0x0028 - 0x0000)
struct AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InOptionalExternalTarget;                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyTriggerOnce;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagCountChanged* ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged) == 0x000008, "Wrong alignment on AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged");
static_assert(sizeof(AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged) == 0x000028, "Wrong size on AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged");
static_assert(offsetof(AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged, OwningAbility) == 0x000000, "Member 'AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged::OwningAbility' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged, Tag) == 0x000008, "Member 'AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged::Tag' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged, InOptionalExternalTarget) == 0x000010, "Member 'AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged::InOptionalExternalTarget' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged, OnlyTriggerOnce) == 0x000018, "Member 'AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged::OnlyTriggerOnce' has a wrong offset!");
static_assert(offsetof(AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged, ReturnValue) == 0x000020, "Member 'AbilityTask_WaitGameplayTagCountChanged_WaitGameplayTagCountChanged::ReturnValue' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.MulticastDamageEvent
// 0x0030 (0x0030 - 0x0000)
struct TgfInteractorBattleComponent_MulticastDamageEvent final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DamageInstigatorTags;                              // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	float                                         DamageValue;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfInteractorBattleComponent_MulticastDamageEvent) == 0x000008, "Wrong alignment on TgfInteractorBattleComponent_MulticastDamageEvent");
static_assert(sizeof(TgfInteractorBattleComponent_MulticastDamageEvent) == 0x000030, "Wrong size on TgfInteractorBattleComponent_MulticastDamageEvent");
static_assert(offsetof(TgfInteractorBattleComponent_MulticastDamageEvent, DamageInstigator) == 0x000000, "Member 'TgfInteractorBattleComponent_MulticastDamageEvent::DamageInstigator' has a wrong offset!");
static_assert(offsetof(TgfInteractorBattleComponent_MulticastDamageEvent, DamageInstigatorTags) == 0x000008, "Member 'TgfInteractorBattleComponent_MulticastDamageEvent::DamageInstigatorTags' has a wrong offset!");
static_assert(offsetof(TgfInteractorBattleComponent_MulticastDamageEvent, DamageValue) == 0x000028, "Member 'TgfInteractorBattleComponent_MulticastDamageEvent::DamageValue' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.MulticastDeathEvent
// 0x0010 (0x0010 - 0x0000)
struct TgfInteractorBattleComponent_MulticastDeathEvent final
{
public:
	class AActor*                                 DamageInstigator;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageTarget;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfInteractorBattleComponent_MulticastDeathEvent) == 0x000008, "Wrong alignment on TgfInteractorBattleComponent_MulticastDeathEvent");
static_assert(sizeof(TgfInteractorBattleComponent_MulticastDeathEvent) == 0x000010, "Wrong size on TgfInteractorBattleComponent_MulticastDeathEvent");
static_assert(offsetof(TgfInteractorBattleComponent_MulticastDeathEvent, DamageInstigator) == 0x000000, "Member 'TgfInteractorBattleComponent_MulticastDeathEvent::DamageInstigator' has a wrong offset!");
static_assert(offsetof(TgfInteractorBattleComponent_MulticastDeathEvent, DamageTarget) == 0x000008, "Member 'TgfInteractorBattleComponent_MulticastDeathEvent::DamageTarget' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.OnHit
// 0x0010 (0x0010 - 0x0000)
struct TgfInteractorBattleComponent_OnHit final
{
public:
	class AActor*                                 SrcActor;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETgfUseAttackType                             AttackType;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfInteractorBattleComponent_OnHit) == 0x000008, "Wrong alignment on TgfInteractorBattleComponent_OnHit");
static_assert(sizeof(TgfInteractorBattleComponent_OnHit) == 0x000010, "Wrong size on TgfInteractorBattleComponent_OnHit");
static_assert(offsetof(TgfInteractorBattleComponent_OnHit, SrcActor) == 0x000000, "Member 'TgfInteractorBattleComponent_OnHit::SrcActor' has a wrong offset!");
static_assert(offsetof(TgfInteractorBattleComponent_OnHit, AttackType) == 0x000008, "Member 'TgfInteractorBattleComponent_OnHit::AttackType' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.OnRep_DeathState
// 0x0001 (0x0001 - 0x0000)
struct TgfInteractorBattleComponent_OnRep_DeathState final
{
public:
	ETgfDeathState                                OldDeathState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfInteractorBattleComponent_OnRep_DeathState) == 0x000001, "Wrong alignment on TgfInteractorBattleComponent_OnRep_DeathState");
static_assert(sizeof(TgfInteractorBattleComponent_OnRep_DeathState) == 0x000001, "Wrong size on TgfInteractorBattleComponent_OnRep_DeathState");
static_assert(offsetof(TgfInteractorBattleComponent_OnRep_DeathState, OldDeathState) == 0x000000, "Member 'TgfInteractorBattleComponent_OnRep_DeathState::OldDeathState' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.GetCurrentHP
// 0x0004 (0x0004 - 0x0000)
struct TgfInteractorBattleComponent_GetCurrentHP final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfInteractorBattleComponent_GetCurrentHP) == 0x000004, "Wrong alignment on TgfInteractorBattleComponent_GetCurrentHP");
static_assert(sizeof(TgfInteractorBattleComponent_GetCurrentHP) == 0x000004, "Wrong size on TgfInteractorBattleComponent_GetCurrentHP");
static_assert(offsetof(TgfInteractorBattleComponent_GetCurrentHP, ReturnValue) == 0x000000, "Member 'TgfInteractorBattleComponent_GetCurrentHP::ReturnValue' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.GetDeadOrDying
// 0x0001 (0x0001 - 0x0000)
struct TgfInteractorBattleComponent_GetDeadOrDying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfInteractorBattleComponent_GetDeadOrDying) == 0x000001, "Wrong alignment on TgfInteractorBattleComponent_GetDeadOrDying");
static_assert(sizeof(TgfInteractorBattleComponent_GetDeadOrDying) == 0x000001, "Wrong size on TgfInteractorBattleComponent_GetDeadOrDying");
static_assert(offsetof(TgfInteractorBattleComponent_GetDeadOrDying, ReturnValue) == 0x000000, "Member 'TgfInteractorBattleComponent_GetDeadOrDying::ReturnValue' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.GetTotalHP
// 0x0004 (0x0004 - 0x0000)
struct TgfInteractorBattleComponent_GetTotalHP final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfInteractorBattleComponent_GetTotalHP) == 0x000004, "Wrong alignment on TgfInteractorBattleComponent_GetTotalHP");
static_assert(sizeof(TgfInteractorBattleComponent_GetTotalHP) == 0x000004, "Wrong size on TgfInteractorBattleComponent_GetTotalHP");
static_assert(offsetof(TgfInteractorBattleComponent_GetTotalHP, ReturnValue) == 0x000000, "Member 'TgfInteractorBattleComponent_GetTotalHP::ReturnValue' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.IsDeadOrDying
// 0x0001 (0x0001 - 0x0000)
struct TgfInteractorBattleComponent_IsDeadOrDying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfInteractorBattleComponent_IsDeadOrDying) == 0x000001, "Wrong alignment on TgfInteractorBattleComponent_IsDeadOrDying");
static_assert(sizeof(TgfInteractorBattleComponent_IsDeadOrDying) == 0x000001, "Wrong size on TgfInteractorBattleComponent_IsDeadOrDying");
static_assert(offsetof(TgfInteractorBattleComponent_IsDeadOrDying, ReturnValue) == 0x000000, "Member 'TgfInteractorBattleComponent_IsDeadOrDying::ReturnValue' has a wrong offset!");

// Function LyraGame.TgfInteractorBattleComponent.IsEnableBattle
// 0x0001 (0x0001 - 0x0000)
struct TgfInteractorBattleComponent_IsEnableBattle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfInteractorBattleComponent_IsEnableBattle) == 0x000001, "Wrong alignment on TgfInteractorBattleComponent_IsEnableBattle");
static_assert(sizeof(TgfInteractorBattleComponent_IsEnableBattle) == 0x000001, "Wrong size on TgfInteractorBattleComponent_IsEnableBattle");
static_assert(offsetof(TgfInteractorBattleComponent_IsEnableBattle, ReturnValue) == 0x000000, "Member 'TgfInteractorBattleComponent_IsEnableBattle::ReturnValue' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.ForceSpectate
// 0x0001 (0x0001 - 0x0000)
struct TgfCharacterCheats_ForceSpectate final
{
public:
	bool                                          ToSpectate;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_ForceSpectate) == 0x000001, "Wrong alignment on TgfCharacterCheats_ForceSpectate");
static_assert(sizeof(TgfCharacterCheats_ForceSpectate) == 0x000001, "Wrong size on TgfCharacterCheats_ForceSpectate");
static_assert(offsetof(TgfCharacterCheats_ForceSpectate, ToSpectate) == 0x000000, "Member 'TgfCharacterCheats_ForceSpectate::ToSpectate' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.HidePlayerNames
// 0x0001 (0x0001 - 0x0000)
struct TgfCharacterCheats_HidePlayerNames final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_HidePlayerNames) == 0x000001, "Wrong alignment on TgfCharacterCheats_HidePlayerNames");
static_assert(sizeof(TgfCharacterCheats_HidePlayerNames) == 0x000001, "Wrong size on TgfCharacterCheats_HidePlayerNames");
static_assert(offsetof(TgfCharacterCheats_HidePlayerNames, Hide) == 0x000000, "Member 'TgfCharacterCheats_HidePlayerNames::Hide' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.ReinitCharaCareer
// 0x0004 (0x0004 - 0x0000)
struct TgfCharacterCheats_ReinitCharaCareer final
{
public:
	int32                                         CareerInt;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_ReinitCharaCareer) == 0x000004, "Wrong alignment on TgfCharacterCheats_ReinitCharaCareer");
static_assert(sizeof(TgfCharacterCheats_ReinitCharaCareer) == 0x000004, "Wrong size on TgfCharacterCheats_ReinitCharaCareer");
static_assert(offsetof(TgfCharacterCheats_ReinitCharaCareer, CareerInt) == 0x000000, "Member 'TgfCharacterCheats_ReinitCharaCareer::CareerInt' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetActorMapBounds
// 0x0008 (0x0008 - 0x0000)
struct TgfCharacterCheats_SetActorMapBounds final
{
public:
	float                                         AIBound;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickBound;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetActorMapBounds) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetActorMapBounds");
static_assert(sizeof(TgfCharacterCheats_SetActorMapBounds) == 0x000008, "Wrong size on TgfCharacterCheats_SetActorMapBounds");
static_assert(offsetof(TgfCharacterCheats_SetActorMapBounds, AIBound) == 0x000000, "Member 'TgfCharacterCheats_SetActorMapBounds::AIBound' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetActorMapBounds, TickBound) == 0x000004, "Member 'TgfCharacterCheats_SetActorMapBounds::TickBound' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetCharaLocation
// 0x000C (0x000C - 0x0000)
struct TgfCharacterCheats_SetCharaLocation final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetCharaLocation) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetCharaLocation");
static_assert(sizeof(TgfCharacterCheats_SetCharaLocation) == 0x00000C, "Wrong size on TgfCharacterCheats_SetCharaLocation");
static_assert(offsetof(TgfCharacterCheats_SetCharaLocation, X) == 0x000000, "Member 'TgfCharacterCheats_SetCharaLocation::X' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetCharaLocation, Y) == 0x000004, "Member 'TgfCharacterCheats_SetCharaLocation::Y' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetCharaLocation, Z) == 0x000008, "Member 'TgfCharacterCheats_SetCharaLocation::Z' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetDisplayCareerAndRace
// 0x0008 (0x0008 - 0x0000)
struct TgfCharacterCheats_SetDisplayCareerAndRace final
{
public:
	int32                                         CareerInt;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RaceInt;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetDisplayCareerAndRace) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetDisplayCareerAndRace");
static_assert(sizeof(TgfCharacterCheats_SetDisplayCareerAndRace) == 0x000008, "Wrong size on TgfCharacterCheats_SetDisplayCareerAndRace");
static_assert(offsetof(TgfCharacterCheats_SetDisplayCareerAndRace, CareerInt) == 0x000000, "Member 'TgfCharacterCheats_SetDisplayCareerAndRace::CareerInt' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetDisplayCareerAndRace, RaceInt) == 0x000004, "Member 'TgfCharacterCheats_SetDisplayCareerAndRace::RaceInt' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetFreeze
// 0x0001 (0x0001 - 0x0000)
struct TgfCharacterCheats_SetFreeze final
{
public:
	bool                                          bFreeze;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetFreeze) == 0x000001, "Wrong alignment on TgfCharacterCheats_SetFreeze");
static_assert(sizeof(TgfCharacterCheats_SetFreeze) == 0x000001, "Wrong size on TgfCharacterCheats_SetFreeze");
static_assert(offsetof(TgfCharacterCheats_SetFreeze, bFreeze) == 0x000000, "Member 'TgfCharacterCheats_SetFreeze::bFreeze' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetMithrilCharacter
// 0x0008 (0x0008 - 0x0000)
struct TgfCharacterCheats_SetMithrilCharacter final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RemainingRebirthChance;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetMithrilCharacter) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetMithrilCharacter");
static_assert(sizeof(TgfCharacterCheats_SetMithrilCharacter) == 0x000008, "Wrong size on TgfCharacterCheats_SetMithrilCharacter");
static_assert(offsetof(TgfCharacterCheats_SetMithrilCharacter, Value) == 0x000000, "Member 'TgfCharacterCheats_SetMithrilCharacter::Value' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetMithrilCharacter, RemainingRebirthChance) == 0x000004, "Member 'TgfCharacterCheats_SetMithrilCharacter::RemainingRebirthChance' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetPlayerSceneTag
// 0x0004 (0x0004 - 0x0000)
struct TgfCharacterCheats_SetPlayerSceneTag final
{
public:
	int32                                         Tag;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetPlayerSceneTag) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetPlayerSceneTag");
static_assert(sizeof(TgfCharacterCheats_SetPlayerSceneTag) == 0x000004, "Wrong size on TgfCharacterCheats_SetPlayerSceneTag");
static_assert(offsetof(TgfCharacterCheats_SetPlayerSceneTag, Tag) == 0x000000, "Member 'TgfCharacterCheats_SetPlayerSceneTag::Tag' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetPlayMontageDelay
// 0x0010 (0x0010 - 0x0000)
struct TgfCharacterCheats_SetPlayMontageDelay final
{
public:
	bool                                          bOpenServerPlayDelay;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayTime;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenClientBehind;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenClientAhead;                                  // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChaseMaxPing;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetPlayMontageDelay) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetPlayMontageDelay");
static_assert(sizeof(TgfCharacterCheats_SetPlayMontageDelay) == 0x000010, "Wrong size on TgfCharacterCheats_SetPlayMontageDelay");
static_assert(offsetof(TgfCharacterCheats_SetPlayMontageDelay, bOpenServerPlayDelay) == 0x000000, "Member 'TgfCharacterCheats_SetPlayMontageDelay::bOpenServerPlayDelay' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetPlayMontageDelay, DelayTime) == 0x000004, "Member 'TgfCharacterCheats_SetPlayMontageDelay::DelayTime' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetPlayMontageDelay, bOpenClientBehind) == 0x000008, "Member 'TgfCharacterCheats_SetPlayMontageDelay::bOpenClientBehind' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetPlayMontageDelay, bOpenClientAhead) == 0x000009, "Member 'TgfCharacterCheats_SetPlayMontageDelay::bOpenClientAhead' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetPlayMontageDelay, ChaseMaxPing) == 0x00000C, "Member 'TgfCharacterCheats_SetPlayMontageDelay::ChaseMaxPing' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SpawnActor
// 0x0018 (0x0018 - 0x0000)
struct TgfCharacterCheats_SpawnActor final
{
public:
	class FString                                 ClassPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfCharacterCheats_SpawnActor) == 0x000008, "Wrong alignment on TgfCharacterCheats_SpawnActor");
static_assert(sizeof(TgfCharacterCheats_SpawnActor) == 0x000018, "Wrong size on TgfCharacterCheats_SpawnActor");
static_assert(offsetof(TgfCharacterCheats_SpawnActor, ClassPath) == 0x000000, "Member 'TgfCharacterCheats_SpawnActor::ClassPath' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SpawnActor, Distance) == 0x000010, "Member 'TgfCharacterCheats_SpawnActor::Distance' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SpawnMonster
// 0x0020 (0x0020 - 0x0000)
struct TgfCharacterCheats_SpawnMonster final
{
public:
	class FString                                 ClassPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LootIndex;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Dormant;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfCharacterCheats_SpawnMonster) == 0x000008, "Wrong alignment on TgfCharacterCheats_SpawnMonster");
static_assert(sizeof(TgfCharacterCheats_SpawnMonster) == 0x000020, "Wrong size on TgfCharacterCheats_SpawnMonster");
static_assert(offsetof(TgfCharacterCheats_SpawnMonster, ClassPath) == 0x000000, "Member 'TgfCharacterCheats_SpawnMonster::ClassPath' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SpawnMonster, Distance) == 0x000010, "Member 'TgfCharacterCheats_SpawnMonster::Distance' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SpawnMonster, LootIndex) == 0x000014, "Member 'TgfCharacterCheats_SpawnMonster::LootIndex' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SpawnMonster, Dormant) == 0x000018, "Member 'TgfCharacterCheats_SpawnMonster::Dormant' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.TestTryIncreaseAndCheckSecurityInvalidCount
// 0x0004 (0x0004 - 0x0000)
struct TgfCharacterCheats_TestTryIncreaseAndCheckSecurityInvalidCount final
{
public:
	int32                                         Reason;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_TestTryIncreaseAndCheckSecurityInvalidCount) == 0x000004, "Wrong alignment on TgfCharacterCheats_TestTryIncreaseAndCheckSecurityInvalidCount");
static_assert(sizeof(TgfCharacterCheats_TestTryIncreaseAndCheckSecurityInvalidCount) == 0x000004, "Wrong size on TgfCharacterCheats_TestTryIncreaseAndCheckSecurityInvalidCount");
static_assert(offsetof(TgfCharacterCheats_TestTryIncreaseAndCheckSecurityInvalidCount, Reason) == 0x000000, "Member 'TgfCharacterCheats_TestTryIncreaseAndCheckSecurityInvalidCount::Reason' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.AddSkin
// 0x0008 (0x0008 - 0x0000)
struct TgfCharacterCheats_AddSkin final
{
public:
	int32                                         SkinType;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SkinId;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_AddSkin) == 0x000004, "Wrong alignment on TgfCharacterCheats_AddSkin");
static_assert(sizeof(TgfCharacterCheats_AddSkin) == 0x000008, "Wrong size on TgfCharacterCheats_AddSkin");
static_assert(offsetof(TgfCharacterCheats_AddSkin, SkinType) == 0x000000, "Member 'TgfCharacterCheats_AddSkin::SkinType' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_AddSkin, SkinId) == 0x000004, "Member 'TgfCharacterCheats_AddSkin::SkinId' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetFaceConfig
// 0x0018 (0x0018 - 0x0000)
struct TgfCharacterCheats_SetFaceConfig final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfCharacterCheats_SetFaceConfig) == 0x000008, "Wrong alignment on TgfCharacterCheats_SetFaceConfig");
static_assert(sizeof(TgfCharacterCheats_SetFaceConfig) == 0x000018, "Wrong size on TgfCharacterCheats_SetFaceConfig");
static_assert(offsetof(TgfCharacterCheats_SetFaceConfig, Param_Name) == 0x000000, "Member 'TgfCharacterCheats_SetFaceConfig::Param_Name' has a wrong offset!");
static_assert(offsetof(TgfCharacterCheats_SetFaceConfig, Type) == 0x000010, "Member 'TgfCharacterCheats_SetFaceConfig::Type' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetGender
// 0x0004 (0x0004 - 0x0000)
struct TgfCharacterCheats_SetGender final
{
public:
	int32                                         Gender;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetGender) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetGender");
static_assert(sizeof(TgfCharacterCheats_SetGender) == 0x000004, "Wrong size on TgfCharacterCheats_SetGender");
static_assert(offsetof(TgfCharacterCheats_SetGender, Gender) == 0x000000, "Member 'TgfCharacterCheats_SetGender::Gender' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetPlayerName
// 0x0010 (0x0010 - 0x0000)
struct TgfCharacterCheats_SetPlayerName final
{
public:
	class FString                                 Param_Name;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetPlayerName) == 0x000008, "Wrong alignment on TgfCharacterCheats_SetPlayerName");
static_assert(sizeof(TgfCharacterCheats_SetPlayerName) == 0x000010, "Wrong size on TgfCharacterCheats_SetPlayerName");
static_assert(offsetof(TgfCharacterCheats_SetPlayerName, Param_Name) == 0x000000, "Member 'TgfCharacterCheats_SetPlayerName::Param_Name' has a wrong offset!");

// Function LyraGame.TgfCharacterCheats.SetRace
// 0x0004 (0x0004 - 0x0000)
struct TgfCharacterCheats_SetRace final
{
public:
	int32                                         Race;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TgfCharacterCheats_SetRace) == 0x000004, "Wrong alignment on TgfCharacterCheats_SetRace");
static_assert(sizeof(TgfCharacterCheats_SetRace) == 0x000004, "Wrong size on TgfCharacterCheats_SetRace");
static_assert(offsetof(TgfCharacterCheats_SetRace, Race) == 0x000000, "Member 'TgfCharacterCheats_SetRace::Race' has a wrong offset!");

// Function LyraGame.AbilityTask_MonitorMove.MonitorMove
// 0x0028 (0x0028 - 0x0000)
struct AbilityTask_MonitorMove_MonitorMove final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasDuration;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Period;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExecuteAtFirst;                             // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_MonitorMove*               ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_MonitorMove_MonitorMove) == 0x000008, "Wrong alignment on AbilityTask_MonitorMove_MonitorMove");
static_assert(sizeof(AbilityTask_MonitorMove_MonitorMove) == 0x000028, "Wrong size on AbilityTask_MonitorMove_MonitorMove");
static_assert(offsetof(AbilityTask_MonitorMove_MonitorMove, OwningAbility) == 0x000000, "Member 'AbilityTask_MonitorMove_MonitorMove::OwningAbility' has a wrong offset!");
static_assert(offsetof(AbilityTask_MonitorMove_MonitorMove, TaskName) == 0x000008, "Member 'AbilityTask_MonitorMove_MonitorMove::TaskName' has a wrong offset!");
static_assert(offsetof(AbilityTask_MonitorMove_MonitorMove, bHasDuration) == 0x000010, "Member 'AbilityTask_MonitorMove_MonitorMove::bHasDuration' has a wrong offset!");
static_assert(offsetof(AbilityTask_MonitorMove_MonitorMove, Duration) == 0x000014, "Member 'AbilityTask_MonitorMove_MonitorMove::Duration' has a wrong offset!");
static_assert(offsetof(AbilityTask_MonitorMove_MonitorMove, Period) == 0x000018, "Member 'AbilityTask_MonitorMove_MonitorMove::Period' has a wrong offset!");
static_assert(offsetof(AbilityTask_MonitorMove_MonitorMove, bShouldExecuteAtFirst) == 0x00001C, "Member 'AbilityTask_MonitorMove_MonitorMove::bShouldExecuteAtFirst' has a wrong offset!");
static_assert(offsetof(AbilityTask_MonitorMove_MonitorMove, ReturnValue) == 0x000020, "Member 'AbilityTask_MonitorMove_MonitorMove::ReturnValue' has a wrong offset!");

// Function LyraGame.RoleDisplayAttributeUtility.GetMaxHealth
// 0x0010 (0x0010 - 0x0000)
struct RoleDisplayAttributeUtility_GetMaxHealth final
{
public:
	class ULyraAbilitySystemComponent*            AbilitySystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RoleDisplayAttributeUtility_GetMaxHealth) == 0x000008, "Wrong alignment on RoleDisplayAttributeUtility_GetMaxHealth");
static_assert(sizeof(RoleDisplayAttributeUtility_GetMaxHealth) == 0x000010, "Wrong size on RoleDisplayAttributeUtility_GetMaxHealth");
static_assert(offsetof(RoleDisplayAttributeUtility_GetMaxHealth, AbilitySystem) == 0x000000, "Member 'RoleDisplayAttributeUtility_GetMaxHealth::AbilitySystem' has a wrong offset!");
static_assert(offsetof(RoleDisplayAttributeUtility_GetMaxHealth, ReturnValue) == 0x000008, "Member 'RoleDisplayAttributeUtility_GetMaxHealth::ReturnValue' has a wrong offset!");

// Function LyraGame.RoleDisplayAttributeUtility.SortRoleDisplayAttribute
// 0x0020 (0x0020 - 0x0000)
struct RoleDisplayAttributeUtility_SortRoleDisplayAttribute final
{
public:
	TArray<struct FRoleDisplayAttribute>          Attributes;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoleDisplayAttribute>          ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RoleDisplayAttributeUtility_SortRoleDisplayAttribute) == 0x000008, "Wrong alignment on RoleDisplayAttributeUtility_SortRoleDisplayAttribute");
static_assert(sizeof(RoleDisplayAttributeUtility_SortRoleDisplayAttribute) == 0x000020, "Wrong size on RoleDisplayAttributeUtility_SortRoleDisplayAttribute");
static_assert(offsetof(RoleDisplayAttributeUtility_SortRoleDisplayAttribute, Attributes) == 0x000000, "Member 'RoleDisplayAttributeUtility_SortRoleDisplayAttribute::Attributes' has a wrong offset!");
static_assert(offsetof(RoleDisplayAttributeUtility_SortRoleDisplayAttribute, ReturnValue) == 0x000010, "Member 'RoleDisplayAttributeUtility_SortRoleDisplayAttribute::ReturnValue' has a wrong offset!");

// Function LyraGame.AbilityTask_StateChangeMonitor.WaitMonitorStateChanged
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_StateChangeMonitor_WaitMonitorStateChanged final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TriggerImmediately;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TriggerCounts;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_StateChangeMonitor*        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityTask_StateChangeMonitor_WaitMonitorStateChanged) == 0x000008, "Wrong alignment on AbilityTask_StateChangeMonitor_WaitMonitorStateChanged");
static_assert(sizeof(AbilityTask_StateChangeMonitor_WaitMonitorStateChanged) == 0x000020, "Wrong size on AbilityTask_StateChangeMonitor_WaitMonitorStateChanged");
static_assert(offsetof(AbilityTask_StateChangeMonitor_WaitMonitorStateChanged, OwningAbility) == 0x000000, "Member 'AbilityTask_StateChangeMonitor_WaitMonitorStateChanged::OwningAbility' has a wrong offset!");
static_assert(offsetof(AbilityTask_StateChangeMonitor_WaitMonitorStateChanged, TaskName) == 0x000008, "Member 'AbilityTask_StateChangeMonitor_WaitMonitorStateChanged::TaskName' has a wrong offset!");
static_assert(offsetof(AbilityTask_StateChangeMonitor_WaitMonitorStateChanged, TriggerImmediately) == 0x000010, "Member 'AbilityTask_StateChangeMonitor_WaitMonitorStateChanged::TriggerImmediately' has a wrong offset!");
static_assert(offsetof(AbilityTask_StateChangeMonitor_WaitMonitorStateChanged, TriggerCounts) == 0x000014, "Member 'AbilityTask_StateChangeMonitor_WaitMonitorStateChanged::TriggerCounts' has a wrong offset!");
static_assert(offsetof(AbilityTask_StateChangeMonitor_WaitMonitorStateChanged, ReturnValue) == 0x000018, "Member 'AbilityTask_StateChangeMonitor_WaitMonitorStateChanged::ReturnValue' has a wrong offset!");

// Function LyraGame.AsyncAtion_AppearanceDataListen.RegisterAppearanceDataListen
// 0x0018 (0x0018 - 0x0000)
struct AsyncAtion_AppearanceDataListen_RegisterAppearanceDataListen final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         RoleID;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
