#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LyraGame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LyraGame_structs.hpp"
#include "Hotfix_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "CommonUI_classes.hpp"
#include "ModularGameplayActors_classes.hpp"
#include "InputCore_structs.hpp"
#include "AGRPRO_structs.hpp"
#include "AGRPRO_classes.hpp"
#include "AudioMixer_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "PhysicsCore_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayMessageRuntime_structs.hpp"
#include "ReplicationGraph_structs.hpp"
#include "ReplicationGraph_classes.hpp"
#include "CommonInput_structs.hpp"
#include "GameSettings_classes.hpp"
#include "DeveloperSettings_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "CommonUser_structs.hpp"
#include "SignificanceManager_classes.hpp"
#include "Gauntlet_classes.hpp"


namespace SDK
{

// Class LyraGame.TgfAbilityCheats
// 0x0000 (0x0028 - 0x0028)
class UTgfAbilityCheats final : public UCheatManagerExtension
{
public:
	void AddAbilitySet(int32 AbilitySetId);
	void AddAttrValue(const class FString& AttrStr, float Value);
	void AddLooseGameplayTag(const class FString& TagName, int32 Nums, bool NeedReplicated, bool FoundTagInServer);
	void AttReady();
	void ClearAbilitySet();
	void GiveAbilitySet(const class FString& AssetName);
	void HPReady();
	void InjectInput(const class FString& InputStr);
	void MulAttrValue(const class FString& AttrStr, float Value);
	void Rebirth();
	void RebirthLocation(float X, float Y, float Z);
	void RemoveLooseGameplayTag(const class FString& TagName, int32 Nums, bool NeedReplicated, bool FoundTagInServer);
	void SetAttrValue(const class FString& AttrStr, float Value);
	void SetFirstLevel(float Value);
	void ShowAllTag();
	void ShowAllTagServer();
	void ToggleAuthIgnoreAbilitySystemCooldowns(bool Enabled);
	void ToggleAuthIgnoreAbilitySystemCosts(bool Enabled);
	void TriggerInput(const class FString& InputStr);
	void TriggerInputContinous(const class FString& InputStr);
	void UseOldHit(bool UseOld);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfAbilityCheats">();
	}
	static class UTgfAbilityCheats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfAbilityCheats>();
	}
};
static_assert(alignof(UTgfAbilityCheats) == 0x000008, "Wrong alignment on UTgfAbilityCheats");
static_assert(sizeof(UTgfAbilityCheats) == 0x000028, "Wrong size on UTgfAbilityCheats");

// Class LyraGame.AbilityTask_WaitGameplayTagCountChanged
// 0x0010 (0x00B8 - 0x00A8)
class UAbilityTask_WaitGameplayTagCountChanged final : public UAbilityTask_WaitGameplayTag
{
public:
	FMulticastInlineDelegateProperty_             Changed;                                           // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAbilityTask_WaitGameplayTagCountChanged* WaitGameplayTagCountChanged(class UGameplayAbility* OwningAbility, const struct FGameplayTag& Tag, class AActor* InOptionalExternalTarget, bool OnlyTriggerOnce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_WaitGameplayTagCountChanged">();
	}
	static class UAbilityTask_WaitGameplayTagCountChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitGameplayTagCountChanged>();
	}
};
static_assert(alignof(UAbilityTask_WaitGameplayTagCountChanged) == 0x000008, "Wrong alignment on UAbilityTask_WaitGameplayTagCountChanged");
static_assert(sizeof(UAbilityTask_WaitGameplayTagCountChanged) == 0x0000B8, "Wrong size on UAbilityTask_WaitGameplayTagCountChanged");
static_assert(offsetof(UAbilityTask_WaitGameplayTagCountChanged, Changed) == 0x0000A8, "Member 'UAbilityTask_WaitGameplayTagCountChanged::Changed' has a wrong offset!");

// Class LyraGame.TgfInteractorBattleComponent
// 0x0148 (0x01F0 - 0x00A8)
class UTgfInteractorBattleComponent final : public UGameFrameworkComponent
{
public:
	FMulticastInlineDelegateProperty_             OnDeathStarted;                                    // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDeathFinished;                                   // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDamageTaken;                                     // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnKillingTaken;                                    // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x00E8(0x00E8)(BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          EnableBattle;                                      // 0x01D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsLootable;                                        // 0x01D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeathTime;                                         // 0x01D4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TotalHP;                                           // 0x01D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentHP;                                         // 0x01DC(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          NeedReplicateDamage;                               // 0x01E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          DontRebound;                                       // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeathBeginTick;                                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETgfDeathState                                DeathState;                                        // 0x01E8(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MulticastDamageEvent(class AActor* DamageInstigator, const struct FGameplayTagContainer& DamageInstigatorTags, float DamageValue);
	void MulticastDeathEvent(class AActor* DamageInstigator, class AActor* DamageTarget);
	void OnHit(class AActor* SrcActor, ETgfUseAttackType AttackType);
	void OnRep_DeathState(ETgfDeathState OldDeathState);
	void TriggerDeath();

	float GetCurrentHP() const;
	bool GetDeadOrDying() const;
	float GetTotalHP() const;
	bool IsDeadOrDying() const;
	bool IsEnableBattle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfInteractorBattleComponent">();
	}
	static class UTgfInteractorBattleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfInteractorBattleComponent>();
	}
};
static_assert(alignof(UTgfInteractorBattleComponent) == 0x000008, "Wrong alignment on UTgfInteractorBattleComponent");
static_assert(sizeof(UTgfInteractorBattleComponent) == 0x0001F0, "Wrong size on UTgfInteractorBattleComponent");
static_assert(offsetof(UTgfInteractorBattleComponent, OnDeathStarted) == 0x0000A8, "Member 'UTgfInteractorBattleComponent::OnDeathStarted' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, OnDeathFinished) == 0x0000B8, "Member 'UTgfInteractorBattleComponent::OnDeathFinished' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, OnDamageTaken) == 0x0000C8, "Member 'UTgfInteractorBattleComponent::OnDamageTaken' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, OnKillingTaken) == 0x0000D8, "Member 'UTgfInteractorBattleComponent::OnKillingTaken' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, HitResult) == 0x0000E8, "Member 'UTgfInteractorBattleComponent::HitResult' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, EnableBattle) == 0x0001D0, "Member 'UTgfInteractorBattleComponent::EnableBattle' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, IsLootable) == 0x0001D1, "Member 'UTgfInteractorBattleComponent::IsLootable' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, DeathTime) == 0x0001D4, "Member 'UTgfInteractorBattleComponent::DeathTime' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, TotalHP) == 0x0001D8, "Member 'UTgfInteractorBattleComponent::TotalHP' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, CurrentHP) == 0x0001DC, "Member 'UTgfInteractorBattleComponent::CurrentHP' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, NeedReplicateDamage) == 0x0001E0, "Member 'UTgfInteractorBattleComponent::NeedReplicateDamage' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, DontRebound) == 0x0001E1, "Member 'UTgfInteractorBattleComponent::DontRebound' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, DeathBeginTick) == 0x0001E4, "Member 'UTgfInteractorBattleComponent::DeathBeginTick' has a wrong offset!");
static_assert(offsetof(UTgfInteractorBattleComponent, DeathState) == 0x0001E8, "Member 'UTgfInteractorBattleComponent::DeathState' has a wrong offset!");

// Class LyraGame.LyraGameInstance
// 0x0000 (0x01D0 - 0x01D0)
class ULyraGameInstance : public UCommonGameInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LyraGameInstance">();
	}
	static class ULyraGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULyraGameInstance>();
	}
};
static_assert(alignof(ULyraGameInstance) == 0x000008, "Wrong alignment on ULyraGameInstance");
static_assert(sizeof(ULyraGameInstance) == 0x0001D0, "Wrong size on ULyraGameInstance");

// Class LyraGame.PlayerDistanceCheckerComponent
// 0x0030 (0x00D8 - 0x00A8)
class UPlayerDistanceCheckerComponent final : public UActorComponent
{
public:
	struct FVector2D                              TickIntervalRange;                                 // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DistanceThresholdSquared;                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             Event_SomePlayerComesClose;                        // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bOneOff;                                           // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyTickOnAuthority;                              // 0x00D1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerDistanceCheckerComponent">();
	}
	static class UPlayerDistanceCheckerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerDistanceCheckerComponent>();
	}
};
static_assert(alignof(UPlayerDistanceCheckerComponent) == 0x000008, "Wrong alignment on UPlayerDistanceCheckerComponent");
static_assert(sizeof(UPlayerDistanceCheckerComponent) == 0x0000D8, "Wrong size on UPlayerDistanceCheckerComponent");
static_assert(offsetof(UPlayerDistanceCheckerComponent, TickIntervalRange) == 0x0000A8, "Member 'UPlayerDistanceCheckerComponent::TickIntervalRange' has a wrong offset!");
static_assert(offsetof(UPlayerDistanceCheckerComponent, DistanceThresholdSquared) == 0x0000B8, "Member 'UPlayerDistanceCheckerComponent::DistanceThresholdSquared' has a wrong offset!");
static_assert(offsetof(UPlayerDistanceCheckerComponent, Event_SomePlayerComesClose) == 0x0000C0, "Member 'UPlayerDistanceCheckerComponent::Event_SomePlayerComesClose' has a wrong offset!");
static_assert(offsetof(UPlayerDistanceCheckerComponent, bOneOff) == 0x0000D0, "Member 'UPlayerDistanceCheckerComponent::bOneOff' has a wrong offset!");
static_assert(offsetof(UPlayerDistanceCheckerComponent, bOnlyTickOnAuthority) == 0x0000D1, "Member 'UPlayerDistanceCheckerComponent::bOnlyTickOnAuthority' has a wrong offset!");

// Class LyraGame.AbilityTask_GrantNearbyTarget
// 0x0020 (0x00A0 - 0x0080)
class UAbilityTask_GrantNearbyTarget final : public UAbilityTask
{
public:
	uint8                                         Pad_80[0x20];                                      // 0x0080(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_GrantNearbyTarget">();
	}
	static class UAbilityTask_GrantNearbyTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_GrantNearbyTarget>();
	}
};
static_assert(alignof(UAbilityTask_GrantNearbyTarget) == 0x000008, "Wrong alignment on UAbilityTask_GrantNearbyTarget");
static_assert(sizeof(UAbilityTask_GrantNearbyTarget) == 0x0000A0, "Wrong size on UAbilityTask_GrantNearbyTarget");

// Class LyraGame.TgfInventoryDragDropOperation
// 0x0018 (0x00A8 - 0x0090)
class UTgfInventoryDragDropOperation : public UDragDropOperation
{
public:
	class UTgfInventoryItemWrapper*               DraggedItem;                                       // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETgfEquipSlot                                 FromEquipSlot;                                     // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   FromContext;                                       // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfInventoryDragDropOperation">();
	}
	static class UTgfInventoryDragDropOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfInventoryDragDropOperation>();
	}
};
static_assert(alignof(UTgfInventoryDragDropOperation) == 0x000008, "Wrong alignment on UTgfInventoryDragDropOperation");
static_assert(sizeof(UTgfInventoryDragDropOperation) == 0x0000A8, "Wrong size on UTgfInventoryDragDropOperation");
static_assert(offsetof(UTgfInventoryDragDropOperation, DraggedItem) == 0x000090, "Member 'UTgfInventoryDragDropOperation::DraggedItem' has a wrong offset!");
static_assert(offsetof(UTgfInventoryDragDropOperation, FromEquipSlot) == 0x000098, "Member 'UTgfInventoryDragDropOperation::FromEquipSlot' has a wrong offset!");
static_assert(offsetof(UTgfInventoryDragDropOperation, FromContext) == 0x0000A0, "Member 'UTgfInventoryDragDropOperation::FromContext' has a wrong offset!");

// Class LyraGame.RayTracingAudioMainComponent
// 0x0068 (0x0110 - 0x00A8)
class URayTracingAudioMainComponent final : public UActorComponent
{
public:
	float                                         HeightOffset;                                      // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RayLength;                                         // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameSpan;                                         // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x5C];                                      // 0x00B4(0x005C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RayTracingAudioMainComponent">();
	}
	static class URayTracingAudioMainComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URayTracingAudioMainComponent>();
	}
};
static_assert(alignof(URayTracingAudioMainComponent) == 0x000008, "Wrong alignment on URayTracingAudioMainComponent");
static_assert(sizeof(URayTracingAudioMainComponent) == 0x000110, "Wrong size on URayTracingAudioMainComponent");
static_assert(offsetof(URayTracingAudioMainComponent, HeightOffset) == 0x0000A8, "Member 'URayTracingAudioMainComponent::HeightOffset' has a wrong offset!");
static_assert(offsetof(URayTracingAudioMainComponent, RayLength) == 0x0000AC, "Member 'URayTracingAudioMainComponent::RayLength' has a wrong offset!");
static_assert(offsetof(URayTracingAudioMainComponent, FrameSpan) == 0x0000B0, "Member 'URayTracingAudioMainComponent::FrameSpan' has a wrong offset!");

// Class LyraGame.TgfCharacterCheats
// 0x0000 (0x0028 - 0x0028)
class UTgfCharacterCheats final : public UCheatManagerExtension
{
public:
	void ForceSpectate(bool ToSpectate);
	void HidePlayerNames(bool Hide);
	void NetTest();
	void PrintActorMapStat();
	void PrintCharacterName();
	void PrintCharaLocation();
	void ReinitCharaCareer(int32 CareerInt);
	void SetActorMapBounds(float AIBound, float TickBound);
	void SetCharaLocation(float X, float Y, float Z);
	void SetDisplayCareerAndRace(int32 CareerInt, int32 RaceInt);
	void SetFreeze(bool bFreeze);
	void SetMithrilCharacter(bool Value, int32 RemainingRebirthChance);
	void SetPlayerSceneTag(int32 Tag);
	void SetPlayMontageDelay(bool bOpenServerPlayDelay, float DelayTime, bool bOpenClientBehind, bool bOpenClientAhead, float ChaseMaxPing);
	void ShowTeamId();
	void SpawnActor(const class FString& ClassPath, float Distance);
	void SpawnMonster(const class FString& ClassPath, float Distance, int32 LootIndex, bool Dormant);
	void TestTryIncreaseAndCheckSecurityInvalidCount(int32 Reason);

	void AddSkin(int32 SkinType, int32 SkinId) const;
	void SetFaceConfig(const class FString& Param_Name, int32 Type) const;
	void SetGender(const int32 Gender) const;
	void SetPlayerName(const class FString& Param_Name) const;
	void SetRace(const int32 Race) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfCharacterCheats">();
	}
	static class UTgfCharacterCheats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfCharacterCheats>();
	}
};
static_assert(alignof(UTgfCharacterCheats) == 0x000008, "Wrong alignment on UTgfCharacterCheats");
static_assert(sizeof(UTgfCharacterCheats) == 0x000028, "Wrong size on UTgfCharacterCheats");

// Class LyraGame.AbilityTask_MonitorMove
// 0x0040 (0x00C0 - 0x0080)
class UAbilityTask_MonitorMove final : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_             OnExecutePeriodic;                                 // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTimeOut;                                         // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            CachedMovementComponent;                           // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UAbilityTask_MonitorMove* MonitorMove(class UGameplayAbility* OwningAbility, class FName TaskName, bool bHasDuration, float Duration, float Period, bool bShouldExecuteAtFirst);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_MonitorMove">();
	}
	static class UAbilityTask_MonitorMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_MonitorMove>();
	}
};
static_assert(alignof(UAbilityTask_MonitorMove) == 0x000008, "Wrong alignment on UAbilityTask_MonitorMove");
static_assert(sizeof(UAbilityTask_MonitorMove) == 0x0000C0, "Wrong size on UAbilityTask_MonitorMove");
static_assert(offsetof(UAbilityTask_MonitorMove, OnExecutePeriodic) == 0x000080, "Member 'UAbilityTask_MonitorMove::OnExecutePeriodic' has a wrong offset!");
static_assert(offsetof(UAbilityTask_MonitorMove, OnTimeOut) == 0x000090, "Member 'UAbilityTask_MonitorMove::OnTimeOut' has a wrong offset!");
static_assert(offsetof(UAbilityTask_MonitorMove, CachedMovementComponent) == 0x0000B8, "Member 'UAbilityTask_MonitorMove::CachedMovementComponent' has a wrong offset!");

// Class LyraGame.RoleDisplayAttributeUtility
// 0x0000 (0x0028 - 0x0028)
class URoleDisplayAttributeUtility final : public UObject
{
public:
	static float GetMaxHealth(class ULyraAbilitySystemComponent* AbilitySystem);
	static TArray<struct FRoleDisplayAttribute> SortRoleDisplayAttribute(const TArray<struct FRoleDisplayAttribute>& Attributes);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoleDisplayAttributeUtility">();
	}
	static class URoleDisplayAttributeUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoleDisplayAttributeUtility>();
	}
};
static_assert(alignof(URoleDisplayAttributeUtility) == 0x000008, "Wrong alignment on URoleDisplayAttributeUtility");
static_assert(sizeof(URoleDisplayAttributeUtility) == 0x000028, "Wrong size on URoleDisplayAttributeUtility");

// Class LyraGame.AbilityTask_StateChangeMonitor
// 0x0030 (0x00B0 - 0x0080)
class UAbilityTask_StateChangeMonitor final : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_             OnMonitorStateSatisfied;                           // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMonitorStateDissatisfied;                        // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_StateChangeMonitor* WaitMonitorStateChanged(class UGameplayAbility* OwningAbility, class FName TaskName, bool TriggerImmediately, int32 TriggerCounts);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_StateChangeMonitor">();
	}
	static class UAbilityTask_StateChangeMonitor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_StateChangeMonitor>();
	}
};
static_assert(alignof(UAbilityTask_StateChangeMonitor) == 0x000008, "Wrong alignment on UAbilityTask_StateChangeMonitor");
static_assert(sizeof(UAbilityTask_StateChangeMonitor) == 0x0000B0, "Wrong size on UAbilityTask_StateChangeMonitor");
static_assert(offsetof(UAbilityTask_StateChangeMonitor, OnMonitorStateSatisfied) == 0x000080, "Member 'UAbilityTask_StateChangeMonitor::OnMonitorStateSatisfied' has a wrong offset!");
static_assert(offsetof(UAbilityTask_StateChangeMonitor, OnMonitorStateDissatisfied) == 0x000090, "Member 'UAbilityTask_StateChangeMonitor::OnMonitorStateDissatisfied' has a wrong offset!");

// Class LyraGame.AsyncAtion_AppearanceDataListen
// 0x0020 (0x0050 - 0x0030)
class UAsyncAtion_AppearanceDataListen final : public UCancellableAsyncAction
{
public:
	FMulticastInlineDelegateProperty_             EventOnAppearanceDataGet;                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAtion_AppearanceDataListen* RegisterAppearanceDataListen(class UObject* WorldContextObject, int64 RoleID);

	void HandleOnAppearanceDataGet(int64 InRoleID, class UObject* SlateBrush);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAtion_AppearanceDataListen">();
	}
	static class UAsyncAtion_AppearanceDataListen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAtion_AppearanceDataListen>();
	}
};
static_assert(alignof(UAsyncAtion_AppearanceDataListen) == 0x000008, "Wrong alignment on UAsyncAtion_AppearanceDataListen");
static_assert(sizeof(UAsyncAtion_AppearanceDataListen) == 0x000050, "Wrong size on UAsyncAtion_AppearanceDataListen");
static_assert(offsetof(UAsyncAtion_AppearanceDataListen, EventOnAppearanceDataGet) == 0x000030, "Member 'UAsyncAtion_AppearanceDataListen::EventOnAppearanceDataGet' has a wrong offset!");

// Class LyraGame.RuneSwordSkillHelperActor
// 0x00A0 (0x0338 - 0x0298)
class ARuneSwordSkillHelperActor : public AActor
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0298(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           SocketNames;                                       // 0x02A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   Skill2SocketName;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MagicNumber;                                       // 0x02B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BaseBoneName;                                      // 0x02BC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CurveName;                                         // 0x02C4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x1C];                                     // 0x02CC(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ESwordMasterSkillType, struct FSwordInsSet> SwordInsCache;                                     // 0x02E8(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	class APawn* GetOwnerPawn() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RuneSwordSkillHelperActor">();
	}
	static class ARuneSwordSkillHelperActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARuneSwordSkillHelperActor>();
	}
};
static_assert(alignof(ARuneSwordSkillHelperActor) == 0x000008, "Wrong alignment on ARuneSwordSkillHelperActor");
static_assert(sizeof(ARuneSwordSkillHelperActor) == 0x000338, "Wrong size on ARuneSwordSkillHelperActor");
static_assert(offsetof(ARuneSwordSkillHelperActor, Mesh) == 0x000298, "Member 'ARuneSwordSkillHelperActor::Mesh' has a wrong offset!");
static_assert(offsetof(ARuneSwordSkillHelperActor, SocketNames) == 0x0002A0, "Member 'ARuneSwordSkillHelperActor::SocketNames' has a wrong offset!");
static_assert(offsetof(ARuneSwordSkillHelperActor, Skill2SocketName) == 0x0002B0, "Member 'ARuneSwordSkillHelperActor::Skill2SocketName' has a wrong offset!");
static_assert(offsetof(ARuneSwordSkillHelperActor, MagicNumber) == 0x0002B8, "Member 'ARuneSwordSkillHelperActor::MagicNumber' has a wrong offset!");
static_assert(offsetof(ARuneSwordSkillHelperActor, BaseBoneName) == 0x0002BC, "Member 'ARuneSwordSkillHelperActor::BaseBoneName' has a wrong offset!");
static_assert(offsetof(ARuneSwordSkillHelperActor, CurveName) == 0x0002C4, "Member 'ARuneSwordSkillHelperActor::CurveName' has a wrong offset!");
static_assert(offsetof(ARuneSwordSkillHelperActor, SwordInsCache) == 0x0002E8, "Member 'ARuneSwordSkillHelperActor::SwordInsCache' has a wrong offset!");

// Class LyraGame.TgfAnimNotifyState_MontagePlayRate
// 0x0060 (0x0090 - 0x0030)
class UTgfAnimNotifyState_MontagePlayRate : public UAnimNotifyState
{
public:
	float                                         PlayRate;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USkeletalMeshComponent*, float>    OldCachePlayRate;                                  // 0x0038(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bTriggerPlayRateManual;                            // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MontagePlayRateRevert(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;
	void MontagePlayRateTakeEffect(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfAnimNotifyState_MontagePlayRate">();
	}
	static class UTgfAnimNotifyState_MontagePlayRate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfAnimNotifyState_MontagePlayRate>();
	}
};
static_assert(alignof(UTgfAnimNotifyState_MontagePlayRate) == 0x000008, "Wrong alignment on UTgfAnimNotifyState_MontagePlayRate");
static_assert(sizeof(UTgfAnimNotifyState_MontagePlayRate) == 0x000090, "Wrong size on UTgfAnimNotifyState_MontagePlayRate");
static_assert(offsetof(UTgfAnimNotifyState_MontagePlayRate, PlayRate) == 0x000030, "Member 'UTgfAnimNotifyState_MontagePlayRate::PlayRate' has a wrong offset!");
static_assert(offsetof(UTgfAnimNotifyState_MontagePlayRate, OldCachePlayRate) == 0x000038, "Member 'UTgfAnimNotifyState_MontagePlayRate::OldCachePlayRate' has a wrong offset!");
static_assert(offsetof(UTgfAnimNotifyState_MontagePlayRate, bTriggerPlayRateManual) == 0x000088, "Member 'UTgfAnimNotifyState_MontagePlayRate::bTriggerPlayRateManual' has a wrong offset!");

// Class LyraGame.TgfAnimNotifyState_MontagePlayRateWithTags
// 0x0078 (0x0108 - 0x0090)
class UTgfAnimNotifyState_MontagePlayRateWithTags final : public UTgfAnimNotifyState_MontagePlayRate
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0090(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                         MaxTime;                                           // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x54];                                      // 0x00B4(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfAnimNotifyState_MontagePlayRateWithTags">();
	}
	static class UTgfAnimNotifyState_MontagePlayRateWithTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfAnimNotifyState_MontagePlayRateWithTags>();
	}
};
static_assert(alignof(UTgfAnimNotifyState_MontagePlayRateWithTags) == 0x000008, "Wrong alignment on UTgfAnimNotifyState_MontagePlayRateWithTags");
static_assert(sizeof(UTgfAnimNotifyState_MontagePlayRateWithTags) == 0x000108, "Wrong size on UTgfAnimNotifyState_MontagePlayRateWithTags");
static_assert(offsetof(UTgfAnimNotifyState_MontagePlayRateWithTags, Tags) == 0x000090, "Member 'UTgfAnimNotifyState_MontagePlayRateWithTags::Tags' has a wrong offset!");
static_assert(offsetof(UTgfAnimNotifyState_MontagePlayRateWithTags, MaxTime) == 0x0000B0, "Member 'UTgfAnimNotifyState_MontagePlayRateWithTags::MaxTime' has a wrong offset!");

// Class LyraGame.AbilityTask_TickMonitor
// 0x0020 (0x00A0 - 0x0080)
class UAbilityTask_TickMonitor final : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_             OnMonitorSatisfied;                                // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_TickMonitor* WaitMonitorSatisfied(class UGameplayAbility* OwningAbility, class FName TaskName, bool OnlyTriggerOnce);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_TickMonitor">();
	}
	static class UAbilityTask_TickMonitor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_TickMonitor>();
	}
};
static_assert(alignof(UAbilityTask_TickMonitor) == 0x000008, "Wrong alignment on UAbilityTask_TickMonitor");
static_assert(sizeof(UAbilityTask_TickMonitor) == 0x0000A0, "Wrong size on UAbilityTask_TickMonitor");
static_assert(offsetof(UAbilityTask_TickMonitor, OnMonitorSatisfied) == 0x000080, "Member 'UAbilityTask_TickMonitor::OnMonitorSatisfied' has a wrong offset!");

// Class LyraGame.AbilityTask_WaitForInteractableTargets
// 0x0030 (0x00B0 - 0x0080)
class UAbilityTask_WaitForInteractableTargets : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_             InteractableObjectsChanged;                        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_WaitForInteractableTargets">();
	}
	static class UAbilityTask_WaitForInteractableTargets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitForInteractableTargets>();
	}
};
static_assert(alignof(UAbilityTask_WaitForInteractableTargets) == 0x000008, "Wrong alignment on UAbilityTask_WaitForInteractableTargets");
static_assert(sizeof(UAbilityTask_WaitForInteractableTargets) == 0x0000B0, "Wrong size on UAbilityTask_WaitForInteractableTargets");
static_assert(offsetof(UAbilityTask_WaitForInteractableTargets, InteractableObjectsChanged) == 0x000080, "Member 'UAbilityTask_WaitForInteractableTargets::InteractableObjectsChanged' has a wrong offset!");

// Class LyraGame.TgfCameraFovSettingDataAsset
// 0x0008 (0x0038 - 0x0030)
class UTgfCameraFovSettingDataAsset final : public UPrimaryDataAsset
{
public:
	float                                         FieldOfView;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FieldOfViewAlt;                                    // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfCameraFovSettingDataAsset">();
	}
	static class UTgfCameraFovSettingDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfCameraFovSettingDataAsset>();
	}
};
static_assert(alignof(UTgfCameraFovSettingDataAsset) == 0x000008, "Wrong alignment on UTgfCameraFovSettingDataAsset");
static_assert(sizeof(UTgfCameraFovSettingDataAsset) == 0x000038, "Wrong size on UTgfCameraFovSettingDataAsset");
static_assert(offsetof(UTgfCameraFovSettingDataAsset, FieldOfView) == 0x000030, "Member 'UTgfCameraFovSettingDataAsset::FieldOfView' has a wrong offset!");
static_assert(offsetof(UTgfCameraFovSettingDataAsset, FieldOfViewAlt) == 0x000034, "Member 'UTgfCameraFovSettingDataAsset::FieldOfViewAlt' has a wrong offset!");

// Class LyraGame.AbilityTask_WaitForInteractableTargets_ProjectileTrace
// 0x00E0 (0x0190 - 0x00B0)
class UAbilityTask_WaitForInteractableTargets_ProjectileTrace final : public UAbilityTask_WaitForInteractableTargets
{
public:
	struct FGameplayAbilityTargetingLocationInfo  StartLocation;                                     // 0x00B0(0x00A0)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x40];                                     // 0x0150(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitForInteractableTargets_ProjectileTrace* WaitForInteractableTargets_ProjectileTrace(class UGameplayAbility* OwningAbility, const struct FCollisionProfileName& TraceProfile, float InteractionScanRate, const struct FGameplayAbilityTargetingLocationInfo& Param_StartLocation, float ProjectileRadius, const struct FVector& LaunchVelocity, float MaxSimTime, ECollisionChannel TraceChannel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_WaitForInteractableTargets_ProjectileTrace">();
	}
	static class UAbilityTask_WaitForInteractableTargets_ProjectileTrace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitForInteractableTargets_ProjectileTrace>();
	}
};
static_assert(alignof(UAbilityTask_WaitForInteractableTargets_ProjectileTrace) == 0x000010, "Wrong alignment on UAbilityTask_WaitForInteractableTargets_ProjectileTrace");
static_assert(sizeof(UAbilityTask_WaitForInteractableTargets_ProjectileTrace) == 0x000190, "Wrong size on UAbilityTask_WaitForInteractableTargets_ProjectileTrace");
static_assert(offsetof(UAbilityTask_WaitForInteractableTargets_ProjectileTrace, StartLocation) == 0x0000B0, "Member 'UAbilityTask_WaitForInteractableTargets_ProjectileTrace::StartLocation' has a wrong offset!");

// Class LyraGame.TgfGameWidgetBase
// 0x0018 (0x02B0 - 0x0298)
class UTgfGameWidgetBase : public UTickerUserWidget
{
public:
	class ALyraCharacter*                         CustomCharacter;                                   // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x10];                                     // 0x02A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ALyraCharacter* GetGameWidgetCharacter();
	void SetCustomCharacter(class ALyraCharacter* InCharacter);

	class ULyraAbilitySystemComponent* GetLyraAbilitySystemComponent() const;
	class ALyraPlayerController* GetLyraPlayerController() const;
	class ULyraAbilitySystemComponent* GetSelfLyraAbilitySystemComponent() const;
	class UTgfEquipmentManagerComponent* GetTgfEquipmentManagerComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfGameWidgetBase">();
	}
	static class UTgfGameWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfGameWidgetBase>();
	}
};
static_assert(alignof(UTgfGameWidgetBase) == 0x000008, "Wrong alignment on UTgfGameWidgetBase");
static_assert(sizeof(UTgfGameWidgetBase) == 0x0002B0, "Wrong size on UTgfGameWidgetBase");
static_assert(offsetof(UTgfGameWidgetBase, CustomCharacter) == 0x000298, "Member 'UTgfGameWidgetBase::CustomCharacter' has a wrong offset!");

// Class LyraGame.TgfDashBoardWidget
// 0x01A0 (0x0450 - 0x02B0)
class UTgfDashBoardWidget final : public UTgfGameWidgetBase
{
public:
	TMap<struct FActiveGameplayEffectHandle, class UUserWidget*> ActiveBuffWidget;                                  // 0x02B0(0x0050)(Edit, BlueprintVisible, ExportObject, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class FString>      FailedTextMap;                                     // 0x0300(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct FActorCareerRacePair, EHealthBarType> HealthBarConfig;                                   // 0x0350(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class ULyraAbilitySystemComponent*            OtherLyraASC;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAttachCarreer;                                    // 0x03A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UGameplayAbility>>   IgnoreFailedList;                                  // 0x03B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C0[0x28];                                     // 0x03C0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            LyraASC;                                           // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTgfMagicAttributeSet*                  MagicAttributeSet;                                 // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F8[0x58];                                     // 0x03F8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnApplyGECallback(class UAbilitySystemComponent* Target, const class UGameplayEffect* GE, const struct FActiveGameplayEffectHandle& ActiveHandle);
	void BP_OnBuffAdd(class UTgfGameplayEffect* GE, const struct FActiveGameplayEffectHandle& ActiveHandle, float RemainTime, float TotalTime, int32 StackCnt);
	void BP_OnCastFailed(const class UGameplayAbility* FailedGA, const struct FGameplayTag& Tag, const class FString& FailedText);
	void BP_OnGEDurationChange(const struct FActiveGameplayEffectHandle& GEHandle, float NewTime, float TotalTime, int32 StackCnt);
	void BP_OnGERemove(const struct FActiveGameplayEffectHandle& GEHandle);
	void BP_OnListenedTagChange(const struct FGameplayTag& Tag, int32 NewCnt);
	void BP_OnViewTargetChanged();
	void CheckExistGE();
	bool GetCareerAndRaceFromNecklace(ETgfActorCareer* OutCareer, ETgfActorRace* OutRace);
	float GetCurMagic();
	EHealthBarType GetHealthBarType(ETgfActorCareer Career, ETgfActorRace Race);
	float GetMaxMagicFinal();
	TArray<class UGameplayAbility*> GetTgfSkillGA(class ULyraAbilitySystemComponent* ASC, const TArray<struct FGameplayTag>& Tags);
	void ListenTagChanged(const struct FGameplayTagContainer& Container1, const struct FGameplayTagContainer& Container2);
	void OnChangeViewTarget(class AActor* NewViewTarget);
	void ResetListenedTags();
	void SetAttachCareer(bool bValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfDashBoardWidget">();
	}
	static class UTgfDashBoardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfDashBoardWidget>();
	}
};
static_assert(alignof(UTgfDashBoardWidget) == 0x000008, "Wrong alignment on UTgfDashBoardWidget");
static_assert(sizeof(UTgfDashBoardWidget) == 0x000450, "Wrong size on UTgfDashBoardWidget");
static_assert(offsetof(UTgfDashBoardWidget, ActiveBuffWidget) == 0x0002B0, "Member 'UTgfDashBoardWidget::ActiveBuffWidget' has a wrong offset!");
static_assert(offsetof(UTgfDashBoardWidget, FailedTextMap) == 0x000300, "Member 'UTgfDashBoardWidget::FailedTextMap' has a wrong offset!");
static_assert(offsetof(UTgfDashBoardWidget, HealthBarConfig) == 0x000350, "Member 'UTgfDashBoardWidget::HealthBarConfig' has a wrong offset!");
static_assert(offsetof(UTgfDashBoardWidget, OtherLyraASC) == 0x0003A0, "Member 'UTgfDashBoardWidget::OtherLyraASC' has a wrong offset!");
static_assert(offsetof(UTgfDashBoardWidget, bAttachCarreer) == 0x0003A8, "Member 'UTgfDashBoardWidget::bAttachCarreer' has a wrong offset!");
static_assert(offsetof(UTgfDashBoardWidget, IgnoreFailedList) == 0x0003B0, "Member 'UTgfDashBoardWidget::IgnoreFailedList' has a wrong offset!");
static_assert(offsetof(UTgfDashBoardWidget, LyraASC) == 0x0003E8, "Member 'UTgfDashBoardWidget::LyraASC' has a wrong offset!");
static_assert(offsetof(UTgfDashBoardWidget, MagicAttributeSet) == 0x0003F0, "Member 'UTgfDashBoardWidget::MagicAttributeSet' has a wrong offset!");

// Class LyraGame.ActorMapComponent
// 0x0038 (0x00E0 - 0x00A8)
class UActorMapComponent final : public UGameFrameworkComponent
{
public:
	FMulticastInlineDelegateProperty_             OnTick;                                            // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          LastAIEnabled;                                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastActorDisabled;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActorClientDisabled;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActorDSMeshEnabled;                                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        NextTick;                                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          MoveNoiseEventEnabled;                             // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MoveNoiseEventInterval;                            // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateCharacterGravity(class AActor* LocalPawn, float DefaultGravity, float TargetGravity);
	void UpdateCharacterPlayerNameHeight(class AActor* LocalPawn, class UWidgetComponent* PlayNameComponent, class UCurveVector* LocationCurve);

	bool CheckInDistanceToLocalPlayer(float XYDis, float ZDis) const;
	class ALyraCharacter* GetLyraCharacter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorMapComponent">();
	}
	static class UActorMapComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorMapComponent>();
	}
};
static_assert(alignof(UActorMapComponent) == 0x000008, "Wrong alignment on UActorMapComponent");
static_assert(sizeof(UActorMapComponent) == 0x0000E0, "Wrong size on UActorMapComponent");
static_assert(offsetof(UActorMapComponent, OnTick) == 0x0000A8, "Member 'UActorMapComponent::OnTick' has a wrong offset!");
static_assert(offsetof(UActorMapComponent, LastAIEnabled) == 0x0000B8, "Member 'UActorMapComponent::LastAIEnabled' has a wrong offset!");
static_assert(offsetof(UActorMapComponent, LastActorDisabled) == 0x0000BC, "Member 'UActorMapComponent::LastActorDisabled' has a wrong offset!");
static_assert(offsetof(UActorMapComponent, ActorClientDisabled) == 0x0000C0, "Member 'UActorMapComponent::ActorClientDisabled' has a wrong offset!");
static_assert(offsetof(UActorMapComponent, ActorDSMeshEnabled) == 0x0000C4, "Member 'UActorMapComponent::ActorDSMeshEnabled' has a wrong offset!");
static_assert(offsetof(UActorMapComponent, NextTick) == 0x0000C8, "Member 'UActorMapComponent::NextTick' has a wrong offset!");
static_assert(offsetof(UActorMapComponent, MoveNoiseEventEnabled) == 0x0000D0, "Member 'UActorMapComponent::MoveNoiseEventEnabled' has a wrong offset!");
static_assert(offsetof(UActorMapComponent, MoveNoiseEventInterval) == 0x0000D4, "Member 'UActorMapComponent::MoveNoiseEventInterval' has a wrong offset!");

// Class LyraGame.ActorMapSubsystem
// 0x0028 (0x0058 - 0x0030)
class UActorMapSubsystem final : public UWorldSubsystem
{
public:
	int32                                         MonsterAIEnableNum;                                // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MonsterAITotalNum;                                 // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MonsterTickEnableNum;                              // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MonsterTickTotalNum;                               // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MonsterActorMapAIBound;                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MonsterActorMapTickBound;                          // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ALyraCharacter*>                 HeroList;                                          // 0x0048(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddDeltaMonsterAINum(int32 Delta, int32 Total);
	void AddDeltaMonsterTickNum(int32 Delta, int32 Total);
	void AddHero(class ALyraCharacter* Hero);
	bool CheckCharacterEnabled(class ALyraCharacter* Character, float Bound);
	int32 GetCurrentHeroNum();
	void RemoveHero(class ALyraCharacter* Hero);
	void SetMonsterActorMapAIBound(float Bound);
	void SetMonsterActorMapTickBound(float Bound);

	float GetMonsterActorMapAIBound() const;
	float GetMonsterActorMapTickBound() const;
	int32 GetMonsterAIEnableNum() const;
	int32 GetMonsterAITotalNum() const;
	int32 GetMonsterTickEnableNum() const;
	int32 GetMonsterTickTotalNum() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorMapSubsystem">();
	}
	static class UActorMapSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorMapSubsystem>();
	}
};
static_assert(alignof(UActorMapSubsystem) == 0x000008, "Wrong alignment on UActorMapSubsystem");
static_assert(sizeof(UActorMapSubsystem) == 0x000058, "Wrong size on UActorMapSubsystem");
static_assert(offsetof(UActorMapSubsystem, MonsterAIEnableNum) == 0x000030, "Member 'UActorMapSubsystem::MonsterAIEnableNum' has a wrong offset!");
static_assert(offsetof(UActorMapSubsystem, MonsterAITotalNum) == 0x000034, "Member 'UActorMapSubsystem::MonsterAITotalNum' has a wrong offset!");
static_assert(offsetof(UActorMapSubsystem, MonsterTickEnableNum) == 0x000038, "Member 'UActorMapSubsystem::MonsterTickEnableNum' has a wrong offset!");
static_assert(offsetof(UActorMapSubsystem, MonsterTickTotalNum) == 0x00003C, "Member 'UActorMapSubsystem::MonsterTickTotalNum' has a wrong offset!");
static_assert(offsetof(UActorMapSubsystem, MonsterActorMapAIBound) == 0x000040, "Member 'UActorMapSubsystem::MonsterActorMapAIBound' has a wrong offset!");
static_assert(offsetof(UActorMapSubsystem, MonsterActorMapTickBound) == 0x000044, "Member 'UActorMapSubsystem::MonsterActorMapTickBound' has a wrong offset!");
static_assert(offsetof(UActorMapSubsystem, HeroList) == 0x000048, "Member 'UActorMapSubsystem::HeroList' has a wrong offset!");

// Class LyraGame.TgfCheckBox
// 0x0000 (0x0C80 - 0x0C80)
class UTgfCheckBox : public UCheckBox
{
public:
	void TgfOnCheckStateChanged(ECheckBoxState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TgfCheckBox">();
	}
	static class UTgfCheckBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTgfCheckBox>();
	}
};
static_assert(alignof(UTgfCheckBox) == 0x000010, "Wrong alignment on UTgfCheckBox");
static_assert(sizeof(UTgfCheckBox) == 0x000C80, "Wrong size on UTgfCheckBox");

// Class LyraGame.AIBlueprintHelperExLibrary
// 0x0000 (0x0028 - 0x0028)
class UAIBlueprintHelperExLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector GetActorSimpleCollisionCylinderExtent(const class AActor* Actor);
	static float GetActorSimpleCollisionHalfHeight(const class AActor* Actor);
	static float GetActorSimpleCollisionRadius(const class AActor* Actor);
	static class UAISenseConfig* GetAISenseConfig(class AAIController* Controller, TSubclassOf<class UAISense> SenseClass);
	static float GetAISenseHearingRange(class AAIController* Controller);
	static float GetAISenseSightPeripheralVisionAngleDegrees(class AAIController* Controller);
	static float GetAISenseSightRadius(class AAIController* Controller);
	static void PauseLogic(class UBrainComponent* BrainComponent, const class FString& Reason);
	static void RefreshAIPerceptionStimuliSource(class UObject* WorldContextObject, TSubclassOf<class UAISense> Sense, class AActor* Target);
	static void ResumeLogic(class UBrainComponent* BrainComponent, const class FString& Reason);
	static void SetAISenseEnabled(class AAIController* Controller, TSubclassOf<class UAISense> SenseClass, bool bEnable);
	static void SetAISenseHearingRange(class AAIController* Controller, float Range);
	static void SetAISensesEnabled(class AAIController* Controller, bool bEnable);
	static void SetAISenseSightPeripheralVisionAngleDegrees(class AAIController* Controller, float Degrees);
	static void SetAISenseSightRadius(class AAIController* Controller, float Radius);
	static bool TestPathSync(class UObject* WorldContextObject, const struct FVector& PointA, const struct FVector& PointB, EPathExistanceQueryType PathQueryType, TSubclassOf<class UNavigationQueryFilter> FilterClass, bool AllowPartialPaths);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIBlueprintHelperExLibrary">();
	}
	static class UAIBlueprintHelperExLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIBlueprintHelperExLibrary>();
	}
};
static_assert(alignof(UAIBlueprintHelperExLibrary) == 0x000008, "Wrong alignment on UAIBlueprintHelperExLibrary");
static_assert(sizeof(UAIBlueprintHelperExLibrary) == 0x000028, "Wrong size on UAIBlueprintHelperExLibrary");

// Class LyraGame.WaypointPath
// 0x0010 (0x0038 - 0x0028)
class UWaypointPath final : public UObject
{
public:
	TArray<struct FVector>                        Waypoints;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaypointPath">();
	}
	static class UWaypointPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaypointPath>();
	}
};
static_assert(alignof(UWaypointPath) == 0x000008, "Wrong alignment on UWaypointPath");
static_assert(sizeof(UWaypointPath) == 0x000038, "Wrong size on UWaypointPath");
static_assert(offsetof(UWaypointPath, Waypoints) == 0x000028, "Member 'UWaypointPath::Waypoints' has a wrong offset!");

