#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MovieRenderPipelineCore.EMoviePipelineEncodeQuality
// NumValues: 0x0005
enum class EMoviePipelineEncodeQuality : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	Epic                                     = 3,
	EMoviePipelineEncodeQuality_MAX          = 4,
};

// Enum MovieRenderPipelineCore.FCPXMLExportDataSource
// NumValues: 0x0003
enum class EFCPXMLExportDataSource : uint8
{
	OutputMetadata                           = 0,
	SequenceData                             = 1,
	FCPXMLExportDataSource_MAX               = 2,
};

// Enum MovieRenderPipelineCore.EMoviePipelineTextureStreamingMethod
// NumValues: 0x0004
enum class EMoviePipelineTextureStreamingMethod : uint8
{
	None                                     = 0,
	Disabled                                 = 1,
	FullyLoad                                = 2,
	EMoviePipelineTextureStreamingMethod_MAX = 3,
};

// Enum MovieRenderPipelineCore.EMovieRenderPipelineState
// NumValues: 0x0006
enum class EMovieRenderPipelineState : uint8
{
	Uninitialized                            = 0,
	ProducingFrames                          = 1,
	Finalize                                 = 2,
	Export                                   = 3,
	Finished                                 = 4,
	EMovieRenderPipelineState_MAX            = 5,
};

// Enum MovieRenderPipelineCore.EMovieRenderShotState
// NumValues: 0x0006
enum class EMovieRenderShotState : uint8
{
	Uninitialized                            = 0,
	WarmingUp                                = 1,
	MotionBlur                               = 2,
	Rendering                                = 3,
	Finished                                 = 4,
	EMovieRenderShotState_MAX                = 5,
};

// Enum MovieRenderPipelineCore.EMoviePipelineShutterTiming
// NumValues: 0x0004
enum class EMoviePipelineShutterTiming : uint8
{
	FrameOpen                                = 0,
	FrameCenter                              = 1,
	FrameClose                               = 2,
	EMoviePipelineShutterTiming_MAX          = 3,
};

// ScriptStruct MovieRenderPipelineCore.MoviePipelinePassIdentifier
// 0x0020 (0x0020 - 0x0000)
struct FMoviePipelinePassIdentifier final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CameraName;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoviePipelinePassIdentifier) == 0x000008, "Wrong alignment on FMoviePipelinePassIdentifier");
static_assert(sizeof(FMoviePipelinePassIdentifier) == 0x000020, "Wrong size on FMoviePipelinePassIdentifier");
static_assert(offsetof(FMoviePipelinePassIdentifier, Name) == 0x000000, "Member 'FMoviePipelinePassIdentifier::Name' has a wrong offset!");
static_assert(offsetof(FMoviePipelinePassIdentifier, CameraName) == 0x000010, "Member 'FMoviePipelinePassIdentifier::CameraName' has a wrong offset!");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineRenderPassOutputData
// 0x0010 (0x0010 - 0x0000)
struct FMoviePipelineRenderPassOutputData final
{
public:
	TArray<class FString>                         FilePaths;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoviePipelineRenderPassOutputData) == 0x000008, "Wrong alignment on FMoviePipelineRenderPassOutputData");
static_assert(sizeof(FMoviePipelineRenderPassOutputData) == 0x000010, "Wrong size on FMoviePipelineRenderPassOutputData");
static_assert(offsetof(FMoviePipelineRenderPassOutputData, FilePaths) == 0x000000, "Member 'FMoviePipelineRenderPassOutputData::FilePaths' has a wrong offset!");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineShotOutputData
// 0x0058 (0x0058 - 0x0000)
struct FMoviePipelineShotOutputData final
{
public:
	TWeakObjectPtr<class UMoviePipelineExecutorShot> Shot;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FMoviePipelinePassIdentifier, struct FMoviePipelineRenderPassOutputData> RenderPassData;                                    // 0x0008(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoviePipelineShotOutputData) == 0x000008, "Wrong alignment on FMoviePipelineShotOutputData");
static_assert(sizeof(FMoviePipelineShotOutputData) == 0x000058, "Wrong size on FMoviePipelineShotOutputData");
static_assert(offsetof(FMoviePipelineShotOutputData, Shot) == 0x000000, "Member 'FMoviePipelineShotOutputData::Shot' has a wrong offset!");
static_assert(offsetof(FMoviePipelineShotOutputData, RenderPassData) == 0x000008, "Member 'FMoviePipelineShotOutputData::RenderPassData' has a wrong offset!");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineOutputData
// 0x0028 (0x0028 - 0x0000)
struct FMoviePipelineOutputData final
{
public:
	class UMoviePipeline*                         Pipeline;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineExecutorJob*              Job;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMoviePipelineShotOutputData>   ShotData;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoviePipelineOutputData) == 0x000008, "Wrong alignment on FMoviePipelineOutputData");
static_assert(sizeof(FMoviePipelineOutputData) == 0x000028, "Wrong size on FMoviePipelineOutputData");
static_assert(offsetof(FMoviePipelineOutputData, Pipeline) == 0x000000, "Member 'FMoviePipelineOutputData::Pipeline' has a wrong offset!");
static_assert(offsetof(FMoviePipelineOutputData, Job) == 0x000008, "Member 'FMoviePipelineOutputData::Job' has a wrong offset!");
static_assert(offsetof(FMoviePipelineOutputData, bSuccess) == 0x000010, "Member 'FMoviePipelineOutputData::bSuccess' has a wrong offset!");
static_assert(offsetof(FMoviePipelineOutputData, ShotData) == 0x000018, "Member 'FMoviePipelineOutputData::ShotData' has a wrong offset!");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineCameraCutInfo
// 0x00A8 (0x00A8 - 0x0000)
struct alignas(0x08) FMoviePipelineCameraCutInfo final
{
public:
	uint8                                         Pad_0[0xA8];                                       // 0x0000(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMoviePipelineCameraCutInfo) == 0x000008, "Wrong alignment on FMoviePipelineCameraCutInfo");
static_assert(sizeof(FMoviePipelineCameraCutInfo) == 0x0000A8, "Wrong size on FMoviePipelineCameraCutInfo");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineSegmentWorkMetrics
// 0x0028 (0x0028 - 0x0000)
struct FMoviePipelineSegmentWorkMetrics final
{
public:
	class FString                                 SegmentName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputFrameIndex;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalOutputFrameCount;                             // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputSubSampleIndex;                              // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSubSampleCount;                               // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EngineWarmUpFrameIndex;                            // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalEngineWarmUpFrameCount;                       // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoviePipelineSegmentWorkMetrics) == 0x000008, "Wrong alignment on FMoviePipelineSegmentWorkMetrics");
static_assert(sizeof(FMoviePipelineSegmentWorkMetrics) == 0x000028, "Wrong size on FMoviePipelineSegmentWorkMetrics");
static_assert(offsetof(FMoviePipelineSegmentWorkMetrics, SegmentName) == 0x000000, "Member 'FMoviePipelineSegmentWorkMetrics::SegmentName' has a wrong offset!");
static_assert(offsetof(FMoviePipelineSegmentWorkMetrics, OutputFrameIndex) == 0x000010, "Member 'FMoviePipelineSegmentWorkMetrics::OutputFrameIndex' has a wrong offset!");
static_assert(offsetof(FMoviePipelineSegmentWorkMetrics, TotalOutputFrameCount) == 0x000014, "Member 'FMoviePipelineSegmentWorkMetrics::TotalOutputFrameCount' has a wrong offset!");
static_assert(offsetof(FMoviePipelineSegmentWorkMetrics, OutputSubSampleIndex) == 0x000018, "Member 'FMoviePipelineSegmentWorkMetrics::OutputSubSampleIndex' has a wrong offset!");
static_assert(offsetof(FMoviePipelineSegmentWorkMetrics, TotalSubSampleCount) == 0x00001C, "Member 'FMoviePipelineSegmentWorkMetrics::TotalSubSampleCount' has a wrong offset!");
static_assert(offsetof(FMoviePipelineSegmentWorkMetrics, EngineWarmUpFrameIndex) == 0x000020, "Member 'FMoviePipelineSegmentWorkMetrics::EngineWarmUpFrameIndex' has a wrong offset!");
static_assert(offsetof(FMoviePipelineSegmentWorkMetrics, TotalEngineWarmUpFrameCount) == 0x000024, "Member 'FMoviePipelineSegmentWorkMetrics::TotalEngineWarmUpFrameCount' has a wrong offset!");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineFilenameResolveParams
// 0x0118 (0x0118 - 0x0000)
struct FMoviePipelineFilenameResolveParams final
{
public:
	int32                                         FrameNumber;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameNumberShot;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameNumberRel;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameNumberShotRel;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CameraNameOverride;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShotNameOverride;                                  // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZeroPadFrameNumberCount;                           // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceRelativeFrameNumbers;                        // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameOverride;                                  // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            FileNameFormatOverrides;                           // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            FileMetadata;                                      // 0x0098(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDateTime                              InitializationTime;                                // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitializationVersion;                             // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoviePipelineExecutorJob*              Job;                                               // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoviePipelineExecutorShot*             ShotOverride;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AdditionalFrameNumberOffset;                       // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMoviePipelineFilenameResolveParams) == 0x000008, "Wrong alignment on FMoviePipelineFilenameResolveParams");
static_assert(sizeof(FMoviePipelineFilenameResolveParams) == 0x000118, "Wrong size on FMoviePipelineFilenameResolveParams");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, FrameNumber) == 0x000000, "Member 'FMoviePipelineFilenameResolveParams::FrameNumber' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, FrameNumberShot) == 0x000004, "Member 'FMoviePipelineFilenameResolveParams::FrameNumberShot' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, FrameNumberRel) == 0x000008, "Member 'FMoviePipelineFilenameResolveParams::FrameNumberRel' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, FrameNumberShotRel) == 0x00000C, "Member 'FMoviePipelineFilenameResolveParams::FrameNumberShotRel' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, CameraNameOverride) == 0x000010, "Member 'FMoviePipelineFilenameResolveParams::CameraNameOverride' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, ShotNameOverride) == 0x000020, "Member 'FMoviePipelineFilenameResolveParams::ShotNameOverride' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, ZeroPadFrameNumberCount) == 0x000030, "Member 'FMoviePipelineFilenameResolveParams::ZeroPadFrameNumberCount' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, bForceRelativeFrameNumbers) == 0x000034, "Member 'FMoviePipelineFilenameResolveParams::bForceRelativeFrameNumbers' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, FileNameOverride) == 0x000038, "Member 'FMoviePipelineFilenameResolveParams::FileNameOverride' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, FileNameFormatOverrides) == 0x000048, "Member 'FMoviePipelineFilenameResolveParams::FileNameFormatOverrides' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, FileMetadata) == 0x000098, "Member 'FMoviePipelineFilenameResolveParams::FileMetadata' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, InitializationTime) == 0x0000E8, "Member 'FMoviePipelineFilenameResolveParams::InitializationTime' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, InitializationVersion) == 0x0000F0, "Member 'FMoviePipelineFilenameResolveParams::InitializationVersion' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, Job) == 0x0000F8, "Member 'FMoviePipelineFilenameResolveParams::Job' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, ShotOverride) == 0x000108, "Member 'FMoviePipelineFilenameResolveParams::ShotOverride' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFilenameResolveParams, AdditionalFrameNumberOffset) == 0x000110, "Member 'FMoviePipelineFilenameResolveParams::AdditionalFrameNumberOffset' has a wrong offset!");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineSidecarCamera
// 0x0028 (0x0028 - 0x0000)
struct FMoviePipelineSidecarCamera final
{
public:
	struct FGuid                                  BindingId;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoviePipelineSidecarCamera) == 0x000008, "Wrong alignment on FMoviePipelineSidecarCamera");
static_assert(sizeof(FMoviePipelineSidecarCamera) == 0x000028, "Wrong size on FMoviePipelineSidecarCamera");
static_assert(offsetof(FMoviePipelineSidecarCamera, BindingId) == 0x000000, "Member 'FMoviePipelineSidecarCamera::BindingId' has a wrong offset!");
static_assert(offsetof(FMoviePipelineSidecarCamera, Name) == 0x000018, "Member 'FMoviePipelineSidecarCamera::Name' has a wrong offset!");

// ScriptStruct MovieRenderPipelineCore.MoviePipelineFormatArgs
// 0x00A8 (0x00A8 - 0x0000)
struct FMoviePipelineFormatArgs final
{
public:
	TMap<class FString, class FString>            FilenameArguments;                                 // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            FileMetadata;                                      // 0x0050(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UMoviePipelineExecutorJob*              InJob;                                             // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMoviePipelineFormatArgs) == 0x000008, "Wrong alignment on FMoviePipelineFormatArgs");
static_assert(sizeof(FMoviePipelineFormatArgs) == 0x0000A8, "Wrong size on FMoviePipelineFormatArgs");
static_assert(offsetof(FMoviePipelineFormatArgs, FilenameArguments) == 0x000000, "Member 'FMoviePipelineFormatArgs::FilenameArguments' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFormatArgs, FileMetadata) == 0x000050, "Member 'FMoviePipelineFormatArgs::FileMetadata' has a wrong offset!");
static_assert(offsetof(FMoviePipelineFormatArgs, InJob) == 0x0000A0, "Member 'FMoviePipelineFormatArgs::InJob' has a wrong offset!");

}

