#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Phase_TgfGame_Playing

#include "Basic.hpp"


namespace SDK::Params
{

// Function Phase_TgfGame_Playing.Phase_TgfGame_Playing_C.ExecuteUbergraph_Phase_TgfGame_Playing
// 0x0020 (0x0020 - 0x0000)
struct Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraGamePhaseSubsystem*                CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULyraGamePhaseAbility* Phase)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing) == 0x000008, "Wrong alignment on Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing");
static_assert(sizeof(Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing) == 0x000020, "Wrong size on Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing");
static_assert(offsetof(Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing, EntryPoint) == 0x000000, "Member 'Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing::EntryPoint' has a wrong offset!");
static_assert(offsetof(Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing, Temp_delegate_Variable) == 0x000010, "Member 'Phase_TgfGame_Playing_C_ExecuteUbergraph_Phase_TgfGame_Playing::Temp_delegate_Variable' has a wrong offset!");

}

