#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PocketWorlds

#include "Basic.hpp"


namespace SDK::Params
{

// Function PocketWorlds.PocketCaptureSubsystem.CreateThumbnailRenderer
// 0x0010 (0x0010 - 0x0000)
struct PocketCaptureSubsystem_CreateThumbnailRenderer final
{
public:
	TSubclassOf<class UPocketCapture>             PocketCaptureClass;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPocketCapture*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCaptureSubsystem_CreateThumbnailRenderer) == 0x000008, "Wrong alignment on PocketCaptureSubsystem_CreateThumbnailRenderer");
static_assert(sizeof(PocketCaptureSubsystem_CreateThumbnailRenderer) == 0x000010, "Wrong size on PocketCaptureSubsystem_CreateThumbnailRenderer");
static_assert(offsetof(PocketCaptureSubsystem_CreateThumbnailRenderer, PocketCaptureClass) == 0x000000, "Member 'PocketCaptureSubsystem_CreateThumbnailRenderer::PocketCaptureClass' has a wrong offset!");
static_assert(offsetof(PocketCaptureSubsystem_CreateThumbnailRenderer, ReturnValue) == 0x000008, "Member 'PocketCaptureSubsystem_CreateThumbnailRenderer::ReturnValue' has a wrong offset!");

// Function PocketWorlds.PocketCaptureSubsystem.DestroyThumbnailRenderer
// 0x0008 (0x0008 - 0x0000)
struct PocketCaptureSubsystem_DestroyThumbnailRenderer final
{
public:
	class UPocketCapture*                         ThumbnailRenderer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCaptureSubsystem_DestroyThumbnailRenderer) == 0x000008, "Wrong alignment on PocketCaptureSubsystem_DestroyThumbnailRenderer");
static_assert(sizeof(PocketCaptureSubsystem_DestroyThumbnailRenderer) == 0x000008, "Wrong size on PocketCaptureSubsystem_DestroyThumbnailRenderer");
static_assert(offsetof(PocketCaptureSubsystem_DestroyThumbnailRenderer, ThumbnailRenderer) == 0x000000, "Member 'PocketCaptureSubsystem_DestroyThumbnailRenderer::ThumbnailRenderer' has a wrong offset!");

// Function PocketWorlds.PocketCapture.GetOrCreateAlphaMaskRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct PocketCapture_GetOrCreateAlphaMaskRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCapture_GetOrCreateAlphaMaskRenderTarget) == 0x000008, "Wrong alignment on PocketCapture_GetOrCreateAlphaMaskRenderTarget");
static_assert(sizeof(PocketCapture_GetOrCreateAlphaMaskRenderTarget) == 0x000008, "Wrong size on PocketCapture_GetOrCreateAlphaMaskRenderTarget");
static_assert(offsetof(PocketCapture_GetOrCreateAlphaMaskRenderTarget, ReturnValue) == 0x000000, "Member 'PocketCapture_GetOrCreateAlphaMaskRenderTarget::ReturnValue' has a wrong offset!");

// Function PocketWorlds.PocketCapture.GetOrCreateDiffuseRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct PocketCapture_GetOrCreateDiffuseRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCapture_GetOrCreateDiffuseRenderTarget) == 0x000008, "Wrong alignment on PocketCapture_GetOrCreateDiffuseRenderTarget");
static_assert(sizeof(PocketCapture_GetOrCreateDiffuseRenderTarget) == 0x000008, "Wrong size on PocketCapture_GetOrCreateDiffuseRenderTarget");
static_assert(offsetof(PocketCapture_GetOrCreateDiffuseRenderTarget, ReturnValue) == 0x000000, "Member 'PocketCapture_GetOrCreateDiffuseRenderTarget::ReturnValue' has a wrong offset!");

// Function PocketWorlds.PocketCapture.GetOrCreateEffectsRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct PocketCapture_GetOrCreateEffectsRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCapture_GetOrCreateEffectsRenderTarget) == 0x000008, "Wrong alignment on PocketCapture_GetOrCreateEffectsRenderTarget");
static_assert(sizeof(PocketCapture_GetOrCreateEffectsRenderTarget) == 0x000008, "Wrong size on PocketCapture_GetOrCreateEffectsRenderTarget");
static_assert(offsetof(PocketCapture_GetOrCreateEffectsRenderTarget, ReturnValue) == 0x000000, "Member 'PocketCapture_GetOrCreateEffectsRenderTarget::ReturnValue' has a wrong offset!");

// Function PocketWorlds.PocketCapture.SetAlphaMaskedActors
// 0x0010 (0x0010 - 0x0000)
struct PocketCapture_SetAlphaMaskedActors final
{
public:
	TArray<class AActor*>                         InCaptureTarget;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCapture_SetAlphaMaskedActors) == 0x000008, "Wrong alignment on PocketCapture_SetAlphaMaskedActors");
static_assert(sizeof(PocketCapture_SetAlphaMaskedActors) == 0x000010, "Wrong size on PocketCapture_SetAlphaMaskedActors");
static_assert(offsetof(PocketCapture_SetAlphaMaskedActors, InCaptureTarget) == 0x000000, "Member 'PocketCapture_SetAlphaMaskedActors::InCaptureTarget' has a wrong offset!");

// Function PocketWorlds.PocketCapture.SetCaptureTarget
// 0x0008 (0x0008 - 0x0000)
struct PocketCapture_SetCaptureTarget final
{
public:
	class AActor*                                 InCaptureTarget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCapture_SetCaptureTarget) == 0x000008, "Wrong alignment on PocketCapture_SetCaptureTarget");
static_assert(sizeof(PocketCapture_SetCaptureTarget) == 0x000008, "Wrong size on PocketCapture_SetCaptureTarget");
static_assert(offsetof(PocketCapture_SetCaptureTarget, InCaptureTarget) == 0x000000, "Member 'PocketCapture_SetCaptureTarget::InCaptureTarget' has a wrong offset!");

// Function PocketWorlds.PocketCapture.SetRenderTargetSize
// 0x0008 (0x0008 - 0x0000)
struct PocketCapture_SetRenderTargetSize final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCapture_SetRenderTargetSize) == 0x000004, "Wrong alignment on PocketCapture_SetRenderTargetSize");
static_assert(sizeof(PocketCapture_SetRenderTargetSize) == 0x000008, "Wrong size on PocketCapture_SetRenderTargetSize");
static_assert(offsetof(PocketCapture_SetRenderTargetSize, Width) == 0x000000, "Member 'PocketCapture_SetRenderTargetSize::Width' has a wrong offset!");
static_assert(offsetof(PocketCapture_SetRenderTargetSize, Height) == 0x000004, "Member 'PocketCapture_SetRenderTargetSize::Height' has a wrong offset!");

// Function PocketWorlds.PocketCapture.GetRendererIndex
// 0x0004 (0x0004 - 0x0000)
struct PocketCapture_GetRendererIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PocketCapture_GetRendererIndex) == 0x000004, "Wrong alignment on PocketCapture_GetRendererIndex");
static_assert(sizeof(PocketCapture_GetRendererIndex) == 0x000004, "Wrong size on PocketCapture_GetRendererIndex");
static_assert(offsetof(PocketCapture_GetRendererIndex, ReturnValue) == 0x000000, "Member 'PocketCapture_GetRendererIndex::ReturnValue' has a wrong offset!");

}

