#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PortalSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PortalSystem_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PortalSystem.BoxRenderableComponent
// 0x0010 (0x0550 - 0x0540)
class UBoxRenderableComponent final : public UPrimitiveComponent
{
public:
	struct FColor                                 ShapeColor;                                        // 0x0540(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Visible;                                           // 0x0544(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_545[0xB];                                      // 0x0545(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoxRenderableComponent">();
	}
	static class UBoxRenderableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoxRenderableComponent>();
	}
};
static_assert(alignof(UBoxRenderableComponent) == 0x000010, "Wrong alignment on UBoxRenderableComponent");
static_assert(sizeof(UBoxRenderableComponent) == 0x000550, "Wrong size on UBoxRenderableComponent");
static_assert(offsetof(UBoxRenderableComponent, ShapeColor) == 0x000540, "Member 'UBoxRenderableComponent::ShapeColor' has a wrong offset!");
static_assert(offsetof(UBoxRenderableComponent, Visible) == 0x000544, "Member 'UBoxRenderableComponent::Visible' has a wrong offset!");

// Class PortalSystem.EmptyRenderableComponent
// 0x0000 (0x0540 - 0x0540)
class UEmptyRenderableComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmptyRenderableComponent">();
	}
	static class UEmptyRenderableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmptyRenderableComponent>();
	}
};
static_assert(alignof(UEmptyRenderableComponent) == 0x000010, "Wrong alignment on UEmptyRenderableComponent");
static_assert(sizeof(UEmptyRenderableComponent) == 0x000540, "Wrong size on UEmptyRenderableComponent");

// Class PortalSystem.PortalSystemManager
// 0x0118 (0x03B0 - 0x0298)
class APortalSystemManager final : public AActor
{
public:
	bool                                          _occluderInitHasStarted;                           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPortalZonesGrid                       Grid;                                              // 0x02A0(0x0020)(NativeAccessSpecifierPublic)
	TArray<class APortalSystemPortal*>            Portals;                                           // 0x02C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class APortalSystemPortal*>            OutsidePortals;                                    // 0x02D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class APortalSystemZone*>              Zones;                                             // 0x02E0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class ULightComponent*, class APortalSystemZone*> LightToZoneMap;                                    // 0x02F0(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UPortalSystemOccluderComponent*> Occluders;                                         // 0x0340(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSet<class APortalSystemZone*>                LastRenderedZones;                                 // 0x0350(0x0050)(NativeAccessSpecifierPublic)
	bool                                          ShowDebugLines;                                    // 0x03A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableOptimisation;                                // 0x03A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableOptimisationInEditor;                        // 0x03A2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ManualRebuildOnly;                                 // 0x03A3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UpdateForAllViewLocations;                         // 0x03A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LogWarningsOnRebuild;                              // 0x03A5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LogVerboseWarnings;                                // 0x03A6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LogGlobalInfosOfInternalState;                     // 0x03A7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LogVerboseInfosOfInternalState;                    // 0x03A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class APortalSystemManager* GetPortalSystemManagerInstance(class UObject* WorldContextObject);

	void AddLight(class ULightComponent* LightComponent);
	void AddLightFromActor(class AActor* Actor);
	void ForceUpdatePortalSystem();
	void NotifyLightMoved(class ULightComponent* LightComponent);
	void OnZonesVisibilityChanged(const TArray<class APortalSystemZone*>& ZonesNewlyEnabled, const TArray<class APortalSystemZone*>& ZonesNewlyDisabled);
	void RebuildPortalSystemData(bool FromBeginPlay);
	void RegisterOccluder(class UPortalSystemOccluderComponent* Occluder);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PortalSystemManager">();
	}
	static class APortalSystemManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<APortalSystemManager>();
	}
};
static_assert(alignof(APortalSystemManager) == 0x000008, "Wrong alignment on APortalSystemManager");
static_assert(sizeof(APortalSystemManager) == 0x0003B0, "Wrong size on APortalSystemManager");
static_assert(offsetof(APortalSystemManager, _occluderInitHasStarted) == 0x000298, "Member 'APortalSystemManager::_occluderInitHasStarted' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, Grid) == 0x0002A0, "Member 'APortalSystemManager::Grid' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, Portals) == 0x0002C0, "Member 'APortalSystemManager::Portals' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, OutsidePortals) == 0x0002D0, "Member 'APortalSystemManager::OutsidePortals' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, Zones) == 0x0002E0, "Member 'APortalSystemManager::Zones' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, LightToZoneMap) == 0x0002F0, "Member 'APortalSystemManager::LightToZoneMap' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, Occluders) == 0x000340, "Member 'APortalSystemManager::Occluders' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, LastRenderedZones) == 0x000350, "Member 'APortalSystemManager::LastRenderedZones' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, ShowDebugLines) == 0x0003A0, "Member 'APortalSystemManager::ShowDebugLines' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, EnableOptimisation) == 0x0003A1, "Member 'APortalSystemManager::EnableOptimisation' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, EnableOptimisationInEditor) == 0x0003A2, "Member 'APortalSystemManager::EnableOptimisationInEditor' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, ManualRebuildOnly) == 0x0003A3, "Member 'APortalSystemManager::ManualRebuildOnly' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, UpdateForAllViewLocations) == 0x0003A4, "Member 'APortalSystemManager::UpdateForAllViewLocations' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, LogWarningsOnRebuild) == 0x0003A5, "Member 'APortalSystemManager::LogWarningsOnRebuild' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, LogVerboseWarnings) == 0x0003A6, "Member 'APortalSystemManager::LogVerboseWarnings' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, LogGlobalInfosOfInternalState) == 0x0003A7, "Member 'APortalSystemManager::LogGlobalInfosOfInternalState' has a wrong offset!");
static_assert(offsetof(APortalSystemManager, LogVerboseInfosOfInternalState) == 0x0003A8, "Member 'APortalSystemManager::LogVerboseInfosOfInternalState' has a wrong offset!");

// Class PortalSystem.PortalSystemOccluderComponent
// 0x0050 (0x0590 - 0x0540)
class UPortalSystemOccluderComponent final : public UPrimitiveComponent
{
public:
	struct FColor                                 ShapeColor;                                        // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   _box;                                              // 0x0548(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_580[0x1];                                      // 0x0580(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FollowThisOccluderForPortalDetection;              // 0x0581(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Visible;                                           // 0x0582(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_583[0xD];                                      // 0x0583(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PortalSystemOccluderComponent">();
	}
	static class UPortalSystemOccluderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPortalSystemOccluderComponent>();
	}
};
static_assert(alignof(UPortalSystemOccluderComponent) == 0x000010, "Wrong alignment on UPortalSystemOccluderComponent");
static_assert(sizeof(UPortalSystemOccluderComponent) == 0x000590, "Wrong size on UPortalSystemOccluderComponent");
static_assert(offsetof(UPortalSystemOccluderComponent, ShapeColor) == 0x000540, "Member 'UPortalSystemOccluderComponent::ShapeColor' has a wrong offset!");
static_assert(offsetof(UPortalSystemOccluderComponent, _box) == 0x000548, "Member 'UPortalSystemOccluderComponent::_box' has a wrong offset!");
static_assert(offsetof(UPortalSystemOccluderComponent, FollowThisOccluderForPortalDetection) == 0x000581, "Member 'UPortalSystemOccluderComponent::FollowThisOccluderForPortalDetection' has a wrong offset!");
static_assert(offsetof(UPortalSystemOccluderComponent, Visible) == 0x000582, "Member 'UPortalSystemOccluderComponent::Visible' has a wrong offset!");

// Class PortalSystem.PortalSystemPortal
// 0x0080 (0x0318 - 0x0298)
class APortalSystemPortal final : public AActor
{
public:
	bool                                          IsOutsidePortal;                                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   _localBox;                                         // 0x02A0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         _radiusBounds;                                     // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        _points;                                           // 0x02E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBasicLine>                     _lines;                                            // 0x02F0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          ManualZoneDetection;                               // 0x0300(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APortalSystemZone*>              Zones;                                             // 0x0308(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PortalSystemPortal">();
	}
	static class APortalSystemPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<APortalSystemPortal>();
	}
};
static_assert(alignof(APortalSystemPortal) == 0x000008, "Wrong alignment on APortalSystemPortal");
static_assert(sizeof(APortalSystemPortal) == 0x000318, "Wrong size on APortalSystemPortal");
static_assert(offsetof(APortalSystemPortal, IsOutsidePortal) == 0x000298, "Member 'APortalSystemPortal::IsOutsidePortal' has a wrong offset!");
static_assert(offsetof(APortalSystemPortal, _localBox) == 0x0002A0, "Member 'APortalSystemPortal::_localBox' has a wrong offset!");
static_assert(offsetof(APortalSystemPortal, _radiusBounds) == 0x0002D8, "Member 'APortalSystemPortal::_radiusBounds' has a wrong offset!");
static_assert(offsetof(APortalSystemPortal, _points) == 0x0002E0, "Member 'APortalSystemPortal::_points' has a wrong offset!");
static_assert(offsetof(APortalSystemPortal, _lines) == 0x0002F0, "Member 'APortalSystemPortal::_lines' has a wrong offset!");
static_assert(offsetof(APortalSystemPortal, ManualZoneDetection) == 0x000300, "Member 'APortalSystemPortal::ManualZoneDetection' has a wrong offset!");
static_assert(offsetof(APortalSystemPortal, Zones) == 0x000308, "Member 'APortalSystemPortal::Zones' has a wrong offset!");

// Class PortalSystem.PortalSystemZone
// 0x0080 (0x0318 - 0x0298)
class APortalSystemZone final : public AActor
{
public:
	struct FBox                                   _box;                                              // 0x0298(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector>                        _points;                                           // 0x02D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBasicLine>                     _lines;                                            // 0x02E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0x8];                                      // 0x02F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                Lights;                                            // 0x02F8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class APortalSystemPortal*>            Portals;                                           // 0x0308(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	bool IsZoneVisible();
	void OnZoneVisibilityChange(bool NewVisibility);

	bool ContainPoint(const struct FVector& Point) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PortalSystemZone">();
	}
	static class APortalSystemZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<APortalSystemZone>();
	}
};
static_assert(alignof(APortalSystemZone) == 0x000008, "Wrong alignment on APortalSystemZone");
static_assert(sizeof(APortalSystemZone) == 0x000318, "Wrong size on APortalSystemZone");
static_assert(offsetof(APortalSystemZone, _box) == 0x000298, "Member 'APortalSystemZone::_box' has a wrong offset!");
static_assert(offsetof(APortalSystemZone, _points) == 0x0002D0, "Member 'APortalSystemZone::_points' has a wrong offset!");
static_assert(offsetof(APortalSystemZone, _lines) == 0x0002E0, "Member 'APortalSystemZone::_lines' has a wrong offset!");
static_assert(offsetof(APortalSystemZone, Lights) == 0x0002F8, "Member 'APortalSystemZone::Lights' has a wrong offset!");
static_assert(offsetof(APortalSystemZone, Portals) == 0x000308, "Member 'APortalSystemZone::Portals' has a wrong offset!");

}

