#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigLogicModule

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RigLogicModule.SkelMeshDNAUtils
// 0x0000 (0x0028 - 0x0028)
class USkelMeshDNAUtils final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkelMeshDNAUtils">();
	}
	static class USkelMeshDNAUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkelMeshDNAUtils>();
	}
};
static_assert(alignof(USkelMeshDNAUtils) == 0x000008, "Wrong alignment on USkelMeshDNAUtils");
static_assert(sizeof(USkelMeshDNAUtils) == 0x000028, "Wrong size on USkelMeshDNAUtils");

// Class RigLogicModule.DNAAsset
// 0x0070 (0x0098 - 0x0028)
class UDNAAsset final : public UAssetUserData
{
public:
	class FString                                 DNAFileName;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x60];                                      // 0x0038(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAAsset">();
	}
	static class UDNAAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAAsset>();
	}
};
static_assert(alignof(UDNAAsset) == 0x000008, "Wrong alignment on UDNAAsset");
static_assert(sizeof(UDNAAsset) == 0x000098, "Wrong size on UDNAAsset");
static_assert(offsetof(UDNAAsset, DNAFileName) == 0x000028, "Member 'UDNAAsset::DNAFileName' has a wrong offset!");

// Class RigLogicModule.DNAIndexMapping
// 0x0018 (0x0040 - 0x0028)
class UDNAIndexMapping final : public UAssetUserData
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DNAIndexMapping">();
	}
	static class UDNAIndexMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDNAIndexMapping>();
	}
};
static_assert(alignof(UDNAIndexMapping) == 0x000008, "Wrong alignment on UDNAIndexMapping");
static_assert(sizeof(UDNAIndexMapping) == 0x000040, "Wrong size on UDNAIndexMapping");

}

