#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_DetectPortal_Msg

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_DetectPortal_Msg.S_DetectPortal_Msg
// 0x0020 (0x0020 - 0x0000)
struct FS_DetectPortal_Msg final
{
public:
	class AActor*                                 Owner_10_983FE12C40556DEF85B5E09A7C529C60;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        DetectDistance_9_E79BD1E2479A6A511F251D95AE9A44F2; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetectDuration_13_B580C02849C00DA703D1B5946FFF2DED; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayStartDetect_16_499B7E484AA05A3491B628A56C5761E6; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_DetectPortal_Msg) == 0x000008, "Wrong alignment on FS_DetectPortal_Msg");
static_assert(sizeof(FS_DetectPortal_Msg) == 0x000020, "Wrong size on FS_DetectPortal_Msg");
static_assert(offsetof(FS_DetectPortal_Msg, Owner_10_983FE12C40556DEF85B5E09A7C529C60) == 0x000000, "Member 'FS_DetectPortal_Msg::Owner_10_983FE12C40556DEF85B5E09A7C529C60' has a wrong offset!");
static_assert(offsetof(FS_DetectPortal_Msg, DetectDistance_9_E79BD1E2479A6A511F251D95AE9A44F2) == 0x000008, "Member 'FS_DetectPortal_Msg::DetectDistance_9_E79BD1E2479A6A511F251D95AE9A44F2' has a wrong offset!");
static_assert(offsetof(FS_DetectPortal_Msg, DetectDuration_13_B580C02849C00DA703D1B5946FFF2DED) == 0x000010, "Member 'FS_DetectPortal_Msg::DetectDuration_13_B580C02849C00DA703D1B5946FFF2DED' has a wrong offset!");
static_assert(offsetof(FS_DetectPortal_Msg, DelayStartDetect_16_499B7E484AA05A3491B628A56C5761E6) == 0x000018, "Member 'FS_DetectPortal_Msg::DelayStartDetect_16_499B7E484AA05A3491B628A56C5761E6' has a wrong offset!");

}

