#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Detected_Portal_Item

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Detected_Portal_Item.S_Detected_Portal_Item
// 0x0028 (0x0028 - 0x0000)
struct FS_Detected_Portal_Item final
{
public:
	int64                                         ID_2_5C37AB1D4D1ECBEC1B03A48D80294936;             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PortalLocation_5_A9C8C50C49A4A1BD5526B5B6099D0B18; // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MarkIndex_8_38DA69234EED6E060A8A0EADA20751B3;      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Detected_Portal_Item) == 0x000008, "Wrong alignment on FS_Detected_Portal_Item");
static_assert(sizeof(FS_Detected_Portal_Item) == 0x000028, "Wrong size on FS_Detected_Portal_Item");
static_assert(offsetof(FS_Detected_Portal_Item, ID_2_5C37AB1D4D1ECBEC1B03A48D80294936) == 0x000000, "Member 'FS_Detected_Portal_Item::ID_2_5C37AB1D4D1ECBEC1B03A48D80294936' has a wrong offset!");
static_assert(offsetof(FS_Detected_Portal_Item, PortalLocation_5_A9C8C50C49A4A1BD5526B5B6099D0B18) == 0x000008, "Member 'FS_Detected_Portal_Item::PortalLocation_5_A9C8C50C49A4A1BD5526B5B6099D0B18' has a wrong offset!");
static_assert(offsetof(FS_Detected_Portal_Item, MarkIndex_8_38DA69234EED6E060A8A0EADA20751B3) == 0x000020, "Member 'FS_Detected_Portal_Item::MarkIndex_8_38DA69234EED6E060A8A0EADA20751B3' has a wrong offset!");

}

