#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_DisplayDropInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_DisplayDropInfo.S_DisplayDropInfo
// 0x0038 (0x0038 - 0x0000)
struct FS_DisplayDropInfo final
{
public:
	struct FVector                                Location_10_A96361534D537C64A0DD07B29BF522E6;      // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                DropObject_11_A1AA9281490D6F35E640928456EE30D5;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfIntraGameDisplayInfoType                  DisplayInfoType_12_364E18F14DEDB20F276366AB8DE6B471; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DisplaySubType_13_C21963BE4321BA8EBE4A71B50D81B2C1; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfDisplayAgingType                          DisplayAgingType_14_352017E34F80DF4D636BFBB845151E98; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_DisplayDropInfo) == 0x000008, "Wrong alignment on FS_DisplayDropInfo");
static_assert(sizeof(FS_DisplayDropInfo) == 0x000038, "Wrong size on FS_DisplayDropInfo");
static_assert(offsetof(FS_DisplayDropInfo, Location_10_A96361534D537C64A0DD07B29BF522E6) == 0x000000, "Member 'FS_DisplayDropInfo::Location_10_A96361534D537C64A0DD07B29BF522E6' has a wrong offset!");
static_assert(offsetof(FS_DisplayDropInfo, DropObject_11_A1AA9281490D6F35E640928456EE30D5) == 0x000018, "Member 'FS_DisplayDropInfo::DropObject_11_A1AA9281490D6F35E640928456EE30D5' has a wrong offset!");
static_assert(offsetof(FS_DisplayDropInfo, DisplayInfoType_12_364E18F14DEDB20F276366AB8DE6B471) == 0x000020, "Member 'FS_DisplayDropInfo::DisplayInfoType_12_364E18F14DEDB20F276366AB8DE6B471' has a wrong offset!");
static_assert(offsetof(FS_DisplayDropInfo, DisplaySubType_13_C21963BE4321BA8EBE4A71B50D81B2C1) == 0x000028, "Member 'FS_DisplayDropInfo::DisplaySubType_13_C21963BE4321BA8EBE4A71B50D81B2C1' has a wrong offset!");
static_assert(offsetof(FS_DisplayDropInfo, DisplayAgingType_14_352017E34F80DF4D636BFBB845151E98) == 0x000030, "Member 'FS_DisplayDropInfo::DisplayAgingType_14_352017E34F80DF4D636BFBB845151E98' has a wrong offset!");

}

