#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_DisplayPersistentData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_DisplayPersistentData.S_DisplayPersistentData
// 0x0060 (0x0060 - 0x0000)
struct FS_DisplayPersistentData final
{
public:
	struct FVector                                Location_10_B588EDFC4E89A9AEE47BAAA27DD7DE4B;      // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Object_11_1CD5A2F14C62581BB51EC989207A115E;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETgfIntraGameDisplayInfoType                  DisplayType_13_8D18EF54420ABDA31EB662A9B4E52541;   // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Subtype_14_49169DA145F464008BB94A8C600D0963;       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         ObjectID_17_EEABF942490C845E67289D837B3C9207;      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ObjectCls_25_7562288040F9681559E44FBC11FAFDAF;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        FloatParam_23_ADDC5A784072061C04CAA296F5CF672A;    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         ReplaceWithNewID_29_3DDD2FF1468D49811867AA9FCE57130C; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         AbilityOwnerID_32_C23D6A0F490365D38392EB9D315F7506; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IntParam_35_9AC945EB4C1593783CD8C2877B3050C9;      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_DisplayPersistentData) == 0x000008, "Wrong alignment on FS_DisplayPersistentData");
static_assert(sizeof(FS_DisplayPersistentData) == 0x000060, "Wrong size on FS_DisplayPersistentData");
static_assert(offsetof(FS_DisplayPersistentData, Location_10_B588EDFC4E89A9AEE47BAAA27DD7DE4B) == 0x000000, "Member 'FS_DisplayPersistentData::Location_10_B588EDFC4E89A9AEE47BAAA27DD7DE4B' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, Object_11_1CD5A2F14C62581BB51EC989207A115E) == 0x000018, "Member 'FS_DisplayPersistentData::Object_11_1CD5A2F14C62581BB51EC989207A115E' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, DisplayType_13_8D18EF54420ABDA31EB662A9B4E52541) == 0x000020, "Member 'FS_DisplayPersistentData::DisplayType_13_8D18EF54420ABDA31EB662A9B4E52541' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, Subtype_14_49169DA145F464008BB94A8C600D0963) == 0x000028, "Member 'FS_DisplayPersistentData::Subtype_14_49169DA145F464008BB94A8C600D0963' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, ObjectID_17_EEABF942490C845E67289D837B3C9207) == 0x000030, "Member 'FS_DisplayPersistentData::ObjectID_17_EEABF942490C845E67289D837B3C9207' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, ObjectCls_25_7562288040F9681559E44FBC11FAFDAF) == 0x000038, "Member 'FS_DisplayPersistentData::ObjectCls_25_7562288040F9681559E44FBC11FAFDAF' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, FloatParam_23_ADDC5A784072061C04CAA296F5CF672A) == 0x000040, "Member 'FS_DisplayPersistentData::FloatParam_23_ADDC5A784072061C04CAA296F5CF672A' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, ReplaceWithNewID_29_3DDD2FF1468D49811867AA9FCE57130C) == 0x000048, "Member 'FS_DisplayPersistentData::ReplaceWithNewID_29_3DDD2FF1468D49811867AA9FCE57130C' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, AbilityOwnerID_32_C23D6A0F490365D38392EB9D315F7506) == 0x000050, "Member 'FS_DisplayPersistentData::AbilityOwnerID_32_C23D6A0F490365D38392EB9D315F7506' has a wrong offset!");
static_assert(offsetof(FS_DisplayPersistentData, IntParam_35_9AC945EB4C1593783CD8C2877B3050C9) == 0x000058, "Member 'FS_DisplayPersistentData::IntParam_35_9AC945EB4C1593783CD8C2877B3050C9' has a wrong offset!");

}

