#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PortalInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_PortalInfo.S_PortalInfo
// 0x0020 (0x0020 - 0x0000)
struct FS_PortalInfo final
{
public:
	int32                                         PortalNum_2_19C2034A4CB812D14A44D0B87CC8D418;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  ExtractPawn_5_7FAA4D9C4BEC6ED7F53B57BF8F70FFC5;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnedNum_9_CBFB20844783AE1B9E116A8797C39F25;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object_14_594BEF8E453E47EAAAF09E80506315FA;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PortalInfo) == 0x000008, "Wrong alignment on FS_PortalInfo");
static_assert(sizeof(FS_PortalInfo) == 0x000020, "Wrong size on FS_PortalInfo");
static_assert(offsetof(FS_PortalInfo, PortalNum_2_19C2034A4CB812D14A44D0B87CC8D418) == 0x000000, "Member 'FS_PortalInfo::PortalNum_2_19C2034A4CB812D14A44D0B87CC8D418' has a wrong offset!");
static_assert(offsetof(FS_PortalInfo, ExtractPawn_5_7FAA4D9C4BEC6ED7F53B57BF8F70FFC5) == 0x000008, "Member 'FS_PortalInfo::ExtractPawn_5_7FAA4D9C4BEC6ED7F53B57BF8F70FFC5' has a wrong offset!");
static_assert(offsetof(FS_PortalInfo, SpawnedNum_9_CBFB20844783AE1B9E116A8797C39F25) == 0x000010, "Member 'FS_PortalInfo::SpawnedNum_9_CBFB20844783AE1B9E116A8797C39F25' has a wrong offset!");
static_assert(offsetof(FS_PortalInfo, Object_14_594BEF8E453E47EAAAF09E80506315FA) == 0x000018, "Member 'FS_PortalInfo::Object_14_594BEF8E453E47EAAAF09E80506315FA' has a wrong offset!");

}

