#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PretreatDisplayPortalInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PretreatDisplayPortalInfo.S_PretreatDisplayPortalInfo
// 0x0060 (0x0060 - 0x0000)
struct FS_PretreatDisplayPortalInfo final
{
public:
	int32                                         PortalCnt_21_870D0E9D41845420CE4B5CB37CD5CC38;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location_6_CACC1B6F414FEB627A3C8786DDDB023C;       // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Object_29_44BEFF394DFF512B432FA395933054D9;        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         Character_30_598B67F0454E87B47D86F28A0264DAF8;     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	ETgfIntraGameDisplayInfoType                  DisplayInfoType_17_E64288DB4FF7FDA04073789A726ACB68; // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DisplaySubType_20_953ADDB348C5A5040BFC7E805F7C8E3D; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfDisplayAgingType                          DisplayAgingType_28_34506412464E158C199E82891A3C7466; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ObjectID_33_A74B8CC2403579D0EC24BFBB43AB8900;      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IntParam_36_F58AE90E424730CD3E00339ED09503AF;      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfPlayerSceneTag                            SceneTag_39_0F78EE0C44297FF670E56897283BBCC1;      // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InPortalTag_43_133244EC478D9B98E112259066546C9E;   // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PretreatDisplayPortalInfo) == 0x000008, "Wrong alignment on FS_PretreatDisplayPortalInfo");
static_assert(sizeof(FS_PretreatDisplayPortalInfo) == 0x000060, "Wrong size on FS_PretreatDisplayPortalInfo");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, PortalCnt_21_870D0E9D41845420CE4B5CB37CD5CC38) == 0x000000, "Member 'FS_PretreatDisplayPortalInfo::PortalCnt_21_870D0E9D41845420CE4B5CB37CD5CC38' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, Location_6_CACC1B6F414FEB627A3C8786DDDB023C) == 0x000008, "Member 'FS_PretreatDisplayPortalInfo::Location_6_CACC1B6F414FEB627A3C8786DDDB023C' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, Object_29_44BEFF394DFF512B432FA395933054D9) == 0x000020, "Member 'FS_PretreatDisplayPortalInfo::Object_29_44BEFF394DFF512B432FA395933054D9' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, Character_30_598B67F0454E87B47D86F28A0264DAF8) == 0x000028, "Member 'FS_PretreatDisplayPortalInfo::Character_30_598B67F0454E87B47D86F28A0264DAF8' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, DisplayInfoType_17_E64288DB4FF7FDA04073789A726ACB68) == 0x000030, "Member 'FS_PretreatDisplayPortalInfo::DisplayInfoType_17_E64288DB4FF7FDA04073789A726ACB68' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, DisplaySubType_20_953ADDB348C5A5040BFC7E805F7C8E3D) == 0x000038, "Member 'FS_PretreatDisplayPortalInfo::DisplaySubType_20_953ADDB348C5A5040BFC7E805F7C8E3D' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, DisplayAgingType_28_34506412464E158C199E82891A3C7466) == 0x000040, "Member 'FS_PretreatDisplayPortalInfo::DisplayAgingType_28_34506412464E158C199E82891A3C7466' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, ObjectID_33_A74B8CC2403579D0EC24BFBB43AB8900) == 0x000048, "Member 'FS_PretreatDisplayPortalInfo::ObjectID_33_A74B8CC2403579D0EC24BFBB43AB8900' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, IntParam_36_F58AE90E424730CD3E00339ED09503AF) == 0x000050, "Member 'FS_PretreatDisplayPortalInfo::IntParam_36_F58AE90E424730CD3E00339ED09503AF' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, SceneTag_39_0F78EE0C44297FF670E56897283BBCC1) == 0x000054, "Member 'FS_PretreatDisplayPortalInfo::SceneTag_39_0F78EE0C44297FF670E56897283BBCC1' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayPortalInfo, InPortalTag_43_133244EC478D9B98E112259066546C9E) == 0x000058, "Member 'FS_PretreatDisplayPortalInfo::InPortalTag_43_133244EC478D9B98E112259066546C9E' has a wrong offset!");

}

