#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PretreatDisplayCharacterInfo

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PretreatDisplayCharacterInfo.S_PretreatDisplayCharacterInfo
// 0x0050 (0x0050 - 0x0000)
struct FS_PretreatDisplayCharacterInfo final
{
public:
	class ABP_Tgf_Character_Default_C*            HintCharacter_2_F178FA534814BD2AD29B3BB1A11FE34A;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	ETgfIntraGameDisplayInfoType                  DisplayInfoType_5_FF66533E462CDDF23F054FA27F358CEB; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DisplaySubType_8_3972996D4CA941BB5DF7C7BFA299D005; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfDisplayAgingType                          DisplayAgingType_11_BA6B20E04683420AF83AA9A738AD42A3; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location_14_9DF929FD4077D92242170FAFC2418FC2;      // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Opacity_20_CBE64CF64A5F5F8B0DD29D99A3904E24;       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ActorSpawnPoint_C*                  SpawnPoint_23_CFF497B84A6CAD9E7EDA07B53EA5232A;    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCharacterInstance_26_424708E84704924E2920829142725F3D; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PretreatDisplayCharacterInfo) == 0x000008, "Wrong alignment on FS_PretreatDisplayCharacterInfo");
static_assert(sizeof(FS_PretreatDisplayCharacterInfo) == 0x000050, "Wrong size on FS_PretreatDisplayCharacterInfo");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, HintCharacter_2_F178FA534814BD2AD29B3BB1A11FE34A) == 0x000000, "Member 'FS_PretreatDisplayCharacterInfo::HintCharacter_2_F178FA534814BD2AD29B3BB1A11FE34A' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, DisplayInfoType_5_FF66533E462CDDF23F054FA27F358CEB) == 0x000008, "Member 'FS_PretreatDisplayCharacterInfo::DisplayInfoType_5_FF66533E462CDDF23F054FA27F358CEB' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, DisplaySubType_8_3972996D4CA941BB5DF7C7BFA299D005) == 0x000010, "Member 'FS_PretreatDisplayCharacterInfo::DisplaySubType_8_3972996D4CA941BB5DF7C7BFA299D005' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, DisplayAgingType_11_BA6B20E04683420AF83AA9A738AD42A3) == 0x000018, "Member 'FS_PretreatDisplayCharacterInfo::DisplayAgingType_11_BA6B20E04683420AF83AA9A738AD42A3' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, Location_14_9DF929FD4077D92242170FAFC2418FC2) == 0x000020, "Member 'FS_PretreatDisplayCharacterInfo::Location_14_9DF929FD4077D92242170FAFC2418FC2' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, Opacity_20_CBE64CF64A5F5F8B0DD29D99A3904E24) == 0x000038, "Member 'FS_PretreatDisplayCharacterInfo::Opacity_20_CBE64CF64A5F5F8B0DD29D99A3904E24' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, SpawnPoint_23_CFF497B84A6CAD9E7EDA07B53EA5232A) == 0x000040, "Member 'FS_PretreatDisplayCharacterInfo::SpawnPoint_23_CFF497B84A6CAD9E7EDA07B53EA5232A' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayCharacterInfo, IsCharacterInstance_26_424708E84704924E2920829142725F3D) == 0x000048, "Member 'FS_PretreatDisplayCharacterInfo::IsCharacterInstance_26_424708E84704924E2920829142725F3D' has a wrong offset!");

}

