#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PretreatDisplayDetectInfo

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PretreatDisplayDetectInfo.S_PretreatDisplayDetectInfo
// 0x0040 (0x0040 - 0x0000)
struct FS_PretreatDisplayDetectInfo final
{
public:
	class AActor*                                 OwnerActor_2_4F3E14B6466652055E195FB6E893A39A;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	ETgfIntraGameDisplayInfoType                  DisplayInfoType_5_EBA80CC8441718391C096097CAE72B21; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DisplaySubType_8_F4BFC5B64DD02456232433AA42364B32; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfDisplayAgingType                          DisplayAgingType_11_A519ACD347273527C424B290FA5A2481; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location_14_8EDCD4B04C51936BB6C972B99496E67C;      // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_17_0DE9B46948C0FA6698F4B1A0D582497E;      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PretreatDisplayDetectInfo) == 0x000008, "Wrong alignment on FS_PretreatDisplayDetectInfo");
static_assert(sizeof(FS_PretreatDisplayDetectInfo) == 0x000040, "Wrong size on FS_PretreatDisplayDetectInfo");
static_assert(offsetof(FS_PretreatDisplayDetectInfo, OwnerActor_2_4F3E14B6466652055E195FB6E893A39A) == 0x000000, "Member 'FS_PretreatDisplayDetectInfo::OwnerActor_2_4F3E14B6466652055E195FB6E893A39A' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayDetectInfo, DisplayInfoType_5_EBA80CC8441718391C096097CAE72B21) == 0x000008, "Member 'FS_PretreatDisplayDetectInfo::DisplayInfoType_5_EBA80CC8441718391C096097CAE72B21' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayDetectInfo, DisplaySubType_8_F4BFC5B64DD02456232433AA42364B32) == 0x000010, "Member 'FS_PretreatDisplayDetectInfo::DisplaySubType_8_F4BFC5B64DD02456232433AA42364B32' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayDetectInfo, DisplayAgingType_11_A519ACD347273527C424B290FA5A2481) == 0x000018, "Member 'FS_PretreatDisplayDetectInfo::DisplayAgingType_11_A519ACD347273527C424B290FA5A2481' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayDetectInfo, Location_14_8EDCD4B04C51936BB6C972B99496E67C) == 0x000020, "Member 'FS_PretreatDisplayDetectInfo::Location_14_8EDCD4B04C51936BB6C972B99496E67C' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayDetectInfo, Distance_17_0DE9B46948C0FA6698F4B1A0D582497E) == 0x000038, "Member 'FS_PretreatDisplayDetectInfo::Distance_17_0DE9B46948C0FA6698F4B1A0D582497E' has a wrong offset!");

}

