#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PretreatDisplayKillInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PretreatDisplayKillInfo.S_PretreatDisplayKillInfo
// 0x00E8 (0x00E8 - 0x0000)
struct FS_PretreatDisplayKillInfo final
{
public:
	struct FVector                                Location_12_A96361534D537C64A0DD07B29BF522E6;      // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfIntraGameDisplayInfoType                  DisplayInfoType_15_A781573A48A5D951B131F58F5B5100DD; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DisplaySubType_17_97933DC64454891ED9DDB8ADB949D6F3; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfDisplayAgingType                          DisplayAgingType_18_001D49B74A8F386BF8C009BB7C6D223F; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipSubType                              AttackWeaponType_31_EDF8CCFD427FEB0B15A755A987F616B2; // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfEquipQuality                              WeaponQuality_32_1C5A229A43AE94D6FE19558DC97BD7D1; // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        KillerHealthPercent_35_2C9E112B498112A77E55B29DF3B751B0; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                KillObj_41_A3F6019945F8CECA89030CA198E989CE;       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                DeadObj_42_D8D053694B5339EF033E50BC3A9AFB32;       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKillerNameMultiLang_45_F509C7E348B79D20AEEE9DB2D792AEF7; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeadNameMultiLang_46_32DA1875483FAD8869705BA9DC1CCC56; // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerNameData                        KillerNameData_51_50E023F84DF62F81F634CC916B9820A2; // 0x0050(0x0030)(Edit, BlueprintVisible)
	struct FPlayerNameData                        DeadNameData_52_4AB9A2724AF5331A4BA976809E1246FB;  // 0x0080(0x0030)(Edit, BlueprintVisible)
	ETgfPlayerSceneTag                            SceneTag_55_D0474DB143B9805AD2DBF39160D8723F;      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKillerSummonNameMultiLang_59_E8D71B6C483B5A624F2B27A201F2916A; // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerNameData                        KillerSummonNameData_62_F086CE284280D3CB190C4488FFEA6E43; // 0x00B8(0x0030)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_PretreatDisplayKillInfo) == 0x000008, "Wrong alignment on FS_PretreatDisplayKillInfo");
static_assert(sizeof(FS_PretreatDisplayKillInfo) == 0x0000E8, "Wrong size on FS_PretreatDisplayKillInfo");
static_assert(offsetof(FS_PretreatDisplayKillInfo, Location_12_A96361534D537C64A0DD07B29BF522E6) == 0x000000, "Member 'FS_PretreatDisplayKillInfo::Location_12_A96361534D537C64A0DD07B29BF522E6' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, DisplayInfoType_15_A781573A48A5D951B131F58F5B5100DD) == 0x000018, "Member 'FS_PretreatDisplayKillInfo::DisplayInfoType_15_A781573A48A5D951B131F58F5B5100DD' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, DisplaySubType_17_97933DC64454891ED9DDB8ADB949D6F3) == 0x000020, "Member 'FS_PretreatDisplayKillInfo::DisplaySubType_17_97933DC64454891ED9DDB8ADB949D6F3' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, DisplayAgingType_18_001D49B74A8F386BF8C009BB7C6D223F) == 0x000028, "Member 'FS_PretreatDisplayKillInfo::DisplayAgingType_18_001D49B74A8F386BF8C009BB7C6D223F' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, AttackWeaponType_31_EDF8CCFD427FEB0B15A755A987F616B2) == 0x000029, "Member 'FS_PretreatDisplayKillInfo::AttackWeaponType_31_EDF8CCFD427FEB0B15A755A987F616B2' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, WeaponQuality_32_1C5A229A43AE94D6FE19558DC97BD7D1) == 0x00002A, "Member 'FS_PretreatDisplayKillInfo::WeaponQuality_32_1C5A229A43AE94D6FE19558DC97BD7D1' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, KillerHealthPercent_35_2C9E112B498112A77E55B29DF3B751B0) == 0x000030, "Member 'FS_PretreatDisplayKillInfo::KillerHealthPercent_35_2C9E112B498112A77E55B29DF3B751B0' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, KillObj_41_A3F6019945F8CECA89030CA198E989CE) == 0x000038, "Member 'FS_PretreatDisplayKillInfo::KillObj_41_A3F6019945F8CECA89030CA198E989CE' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, DeadObj_42_D8D053694B5339EF033E50BC3A9AFB32) == 0x000040, "Member 'FS_PretreatDisplayKillInfo::DeadObj_42_D8D053694B5339EF033E50BC3A9AFB32' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, IsKillerNameMultiLang_45_F509C7E348B79D20AEEE9DB2D792AEF7) == 0x000048, "Member 'FS_PretreatDisplayKillInfo::IsKillerNameMultiLang_45_F509C7E348B79D20AEEE9DB2D792AEF7' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, IsDeadNameMultiLang_46_32DA1875483FAD8869705BA9DC1CCC56) == 0x000049, "Member 'FS_PretreatDisplayKillInfo::IsDeadNameMultiLang_46_32DA1875483FAD8869705BA9DC1CCC56' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, KillerNameData_51_50E023F84DF62F81F634CC916B9820A2) == 0x000050, "Member 'FS_PretreatDisplayKillInfo::KillerNameData_51_50E023F84DF62F81F634CC916B9820A2' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, DeadNameData_52_4AB9A2724AF5331A4BA976809E1246FB) == 0x000080, "Member 'FS_PretreatDisplayKillInfo::DeadNameData_52_4AB9A2724AF5331A4BA976809E1246FB' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, SceneTag_55_D0474DB143B9805AD2DBF39160D8723F) == 0x0000B0, "Member 'FS_PretreatDisplayKillInfo::SceneTag_55_D0474DB143B9805AD2DBF39160D8723F' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, IsKillerSummonNameMultiLang_59_E8D71B6C483B5A624F2B27A201F2916A) == 0x0000B1, "Member 'FS_PretreatDisplayKillInfo::IsKillerSummonNameMultiLang_59_E8D71B6C483B5A624F2B27A201F2916A' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayKillInfo, KillerSummonNameData_62_F086CE284280D3CB190C4488FFEA6E43) == 0x0000B8, "Member 'FS_PretreatDisplayKillInfo::KillerSummonNameData_62_F086CE284280D3CB190C4488FFEA6E43' has a wrong offset!");

}

