#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_PretreatDisplayStateTagInfo

#include "Basic.hpp"

#include "LyraGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_PretreatDisplayStateTagInfo.S_PretreatDisplayStateTagInfo
// 0x0018 (0x0018 - 0x0000)
struct FS_PretreatDisplayStateTagInfo final
{
public:
	ETgfIntraGameDisplayInfoType                  DisplayInfoType_2_E2D5BF71405571D23D05D195B0C358E5; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DisplaySubType_5_0F1E4DDE4C0B163D9E9E65A04FD34041; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfDisplayAgingType                          DisplayAgingType_8_F02398294334C904361C7C80C1985D5E; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExtraIntParam_11_9B897E0645F2D9B24B25D9963DA0B64F; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_PretreatDisplayStateTagInfo) == 0x000008, "Wrong alignment on FS_PretreatDisplayStateTagInfo");
static_assert(sizeof(FS_PretreatDisplayStateTagInfo) == 0x000018, "Wrong size on FS_PretreatDisplayStateTagInfo");
static_assert(offsetof(FS_PretreatDisplayStateTagInfo, DisplayInfoType_2_E2D5BF71405571D23D05D195B0C358E5) == 0x000000, "Member 'FS_PretreatDisplayStateTagInfo::DisplayInfoType_2_E2D5BF71405571D23D05D195B0C358E5' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayStateTagInfo, DisplaySubType_5_0F1E4DDE4C0B163D9E9E65A04FD34041) == 0x000008, "Member 'FS_PretreatDisplayStateTagInfo::DisplaySubType_5_0F1E4DDE4C0B163D9E9E65A04FD34041' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayStateTagInfo, DisplayAgingType_8_F02398294334C904361C7C80C1985D5E) == 0x000010, "Member 'FS_PretreatDisplayStateTagInfo::DisplayAgingType_8_F02398294334C904361C7C80C1985D5E' has a wrong offset!");
static_assert(offsetof(FS_PretreatDisplayStateTagInfo, ExtraIntParam_11_9B897E0645F2D9B24B25D9963DA0B64F) == 0x000014, "Member 'FS_PretreatDisplayStateTagInfo::ExtraIntParam_11_9B897E0645F2D9B24B25D9963DA0B64F' has a wrong offset!");

}

