#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGF_AIController

#include "Basic.hpp"


namespace SDK::Params
{

// Function TGF_AIController.TGF_AIController_C.GetPawnClass
// 0x0020 (0x0020 - 0x0000)
struct TGF_AIController_C_GetPawnClass final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Param_Pawn;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGF_AIControllerData_C*                K2Node_DynamicCast_AsTGF_AIController_Data;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TGF_AIController_C_GetPawnClass) == 0x000008, "Wrong alignment on TGF_AIController_C_GetPawnClass");
static_assert(sizeof(TGF_AIController_C_GetPawnClass) == 0x000020, "Wrong size on TGF_AIController_C_GetPawnClass");
static_assert(offsetof(TGF_AIController_C_GetPawnClass, Result) == 0x000000, "Member 'TGF_AIController_C_GetPawnClass::Result' has a wrong offset!");
static_assert(offsetof(TGF_AIController_C_GetPawnClass, Param_Pawn) == 0x000008, "Member 'TGF_AIController_C_GetPawnClass::Param_Pawn' has a wrong offset!");
static_assert(offsetof(TGF_AIController_C_GetPawnClass, K2Node_DynamicCast_AsTGF_AIController_Data) == 0x000010, "Member 'TGF_AIController_C_GetPawnClass::K2Node_DynamicCast_AsTGF_AIController_Data' has a wrong offset!");
static_assert(offsetof(TGF_AIController_C_GetPawnClass, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TGF_AIController_C_GetPawnClass::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

