#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGFGame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TGFBattleProtocol_structs.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK
{

// Enum TGFGame.EAlertResult
// NumValues: 0x0003
enum class EAlertResult : uint8
{
	Confirmed                                = 0,
	Unknown                                  = 1,
	EAlertResult_MAX                         = 2,
};

// Enum TGFGame.EConfirmResult
// NumValues: 0x0004
enum class EConfirmResult : uint8
{
	Confirmed                                = 0,
	Cancelled                                = 1,
	Unknown                                  = 2,
	EConfirmResult_MAX                       = 3,
};

// Enum TGFGame.EAppState
// NumValues: 0x0005
enum class EAppState : uint8
{
	None                                     = 0,
	Login                                    = 1,
	Hall                                     = 2,
	Battle                                   = 3,
	Max                                      = 4,
};

// Enum TGFGame.EHallState
// NumValues: 0x0007
enum class EHallState : uint8
{
	HallEmpty                                = 0,
	HallMain                                 = 1,
	CreateRole                               = 2,
	Wardrobe                                 = 3,
	StoreDetail                              = 4,
	UICover                                  = 5,
	Max                                      = 6,
};

// Enum TGFGame.ETGFBattlePassTaskType
// NumValues: 0x0004
enum class ETGFBattlePassTaskType : uint8
{
	Normal                                   = 0,
	Dispatch                                 = 1,
	Sealed                                   = 2,
	ETGFBattlePassTaskType_MAX               = 3,
};

// Enum TGFGame.EBattleType
// NumValues: 0x0004
enum class EBattleType : uint8
{
	None                                     = 0,
	Local                                    = 1,
	Remote                                   = 2,
	EBattleType_MAX                          = 3,
};

// Enum TGFGame.ETgfFusionStateType
// NumValues: 0x0005
enum class ETgfFusionStateType : uint8
{
	None                                     = 0,
	Unlock                                   = 1,
	Running                                  = 2,
	Finish                                   = 3,
	ETgfFusionStateType_MAX                  = 4,
};

// Enum TGFGame.EMarqueeType
// NumValues: 0x0006
enum class EMarqueeType : uint8
{
	E_MARQUEE_TYPE_INVALID                   = 0,
	E_MARQUEE_TYPE_LOW                       = 1,
	E_MARQUEE_TYPE_MID                       = 2,
	E_MARQUEE_TYPE_HIGH                      = 3,
	E_MARQUEE_TYPE_BATTLE                    = 4,
	E_MARQUEE_TYPE_MAX                       = 5,
};

// Enum TGFGame.EMatchState
// NumValues: 0x0004
enum class EMatchState : uint8
{
	None                                     = 0,
	Matching                                 = 1,
	Matched                                  = 2,
	EMatchState_MAX                          = 3,
};

// Enum TGFGame.ENMatchWindowStatus
// NumValues: 0x0004
enum class ENMatchWindowStatus : uint8
{
	None                                     = 0,
	Matching                                 = 1,
	Matched                                  = 2,
	ENMatchWindowStatus_MAX                  = 3,
};

// Enum TGFGame.EPVPRoomMemberCamp
// NumValues: 0x0005
enum class EPVPRoomMemberCamp : uint8
{
	None                                     = 0,
	CampA                                    = 1,
	CampB                                    = 2,
	Watcher                                  = 3,
	EPVPRoomMemberCamp_MAX                   = 4,
};

// Enum TGFGame.ESocialToggleType
// NumValues: 0x000A
enum class ESocialToggleType : uint8
{
	E_SOCIAL_TOGGLE_INVALID                  = 0,
	E_SOCIAL_TOGGLE_FRIEND                   = 10,
	E_SOCIAL_TOGGLE_GAME_FRIEND              = 11,
	E_SOCIAL_TOGGLE_STEAM_FRIEND             = 12,
	E_SOCIAL_TOGGLE_FRIEND_APPLY             = 20,
	E_SOCIAL_TOGGLE_RECENT_PLAYER            = 30,
	E_SOCIAL_TOGGLE_MEMBER_SEARCH            = 40,
	E_SOCIAL_TOGGLE_QUICKLY_TEAM             = 41,
	E_SOCIAL_TOGGLE_RECRUIT                  = 42,
	E_SOCIAL_TOGGLE_MAX                      = 43,
};

// Enum TGFGame.ESearchPlayerTag
// NumValues: 0x0004
enum class ESearchPlayerTag : uint8
{
	E_INVALID                                = 0,
	E_SOCIAL                                 = 1,
	E_TEAM_INVITE                            = 2,
	E_MAX                                    = 3,
};

// Enum TGFGame.ECreateRoleFrom
// NumValues: 0x0004
enum class ECreateRoleFrom : uint8
{
	E_INVALID                                = 0,
	E_LOGIN                                  = 1,
	E_HALL                                   = 2,
	E_MAX                                    = 3,
};

// Enum TGFGame.ETeamRole
// NumValues: 0x0004
enum class ETeamRole : uint8
{
	None                                     = 0,
	Captain                                  = 1,
	Member                                   = 2,
	ETeamRole_MAX                            = 3,
};

// Enum TGFGame.EnRoleGenderType
// NumValues: 0x0004
enum class EnRoleGenderType : uint8
{
	EN_ROLE_GENDER_NONE                      = 0,
	EN_ROLE_GENDER_MALE                      = 1,
	EN_ROLE_GENDER_DEMALE                    = 2,
	EN_ROLE_GENDER_MAX                       = 3,
};

// Enum TGFGame.ETimeFormatType
// NumValues: 0x0005
enum class ETimeFormatType : uint8
{
	None                                     = 0,
	DateTime                                 = 1,
	TimeOnly                                 = 2,
	DateOnly                                 = 3,
	ETimeFormatType_MAX                      = 4,
};

// Enum TGFGame.ETradeBidOrderState
// NumValues: 0x0008
enum class ETradeBidOrderState : uint8
{
	None                                     = 0,
	Failed                                   = 1,
	CurrentlyWinning                         = 2,
	OutBid                                   = 3,
	Success                                  = 4,
	Processing                               = 5,
	OrderError                               = 6,
	ETradeBidOrderState_MAX                  = 7,
};

// Enum TGFGame.ETradeSaleOrderType
// NumValues: 0x0004
enum class ETradeSaleOrderType : uint8
{
	None                                     = 0,
	Hint                                     = 1,
	Auction                                  = 2,
	ETradeSaleOrderType_MAX                  = 3,
};

// Enum TGFGame.ETradeSaleOrderState
// NumValues: 0x0008
enum class ETradeSaleOrderState : uint8
{
	None                                     = 0,
	Trading                                  = 1,
	Expired                                  = 2,
	Cancel                                   = 3,
	SoldOut                                  = 4,
	Processing                               = 5,
	OrderError                               = 6,
	ETradeSaleOrderState_MAX                 = 7,
};

// Enum TGFGame.ETradeMarketId
// NumValues: 0x0004
enum class ETradeMarketId : uint8
{
	None                                     = 0,
	HomogenTrade                             = 1,
	Auction                                  = 2,
	ETradeMarketId_MAX                       = 3,
};

// ScriptStruct TGFGame.BannerConfig
// 0x0050 (0x0050 - 0x0000)
struct FBannerConfig final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BannerId;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnable;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SortOrder;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              StartDateTime;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              EndDateTime;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalImagePath;                                    // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HttpImageUrl;                                      // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClickHref;                                         // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBannerConfig) == 0x000008, "Wrong alignment on FBannerConfig");
static_assert(sizeof(FBannerConfig) == 0x000050, "Wrong size on FBannerConfig");
static_assert(offsetof(FBannerConfig, bIsValid) == 0x000000, "Member 'FBannerConfig::bIsValid' has a wrong offset!");
static_assert(offsetof(FBannerConfig, BannerId) == 0x000004, "Member 'FBannerConfig::BannerId' has a wrong offset!");
static_assert(offsetof(FBannerConfig, bIsEnable) == 0x000008, "Member 'FBannerConfig::bIsEnable' has a wrong offset!");
static_assert(offsetof(FBannerConfig, SortOrder) == 0x00000C, "Member 'FBannerConfig::SortOrder' has a wrong offset!");
static_assert(offsetof(FBannerConfig, StartDateTime) == 0x000010, "Member 'FBannerConfig::StartDateTime' has a wrong offset!");
static_assert(offsetof(FBannerConfig, EndDateTime) == 0x000018, "Member 'FBannerConfig::EndDateTime' has a wrong offset!");
static_assert(offsetof(FBannerConfig, LocalImagePath) == 0x000020, "Member 'FBannerConfig::LocalImagePath' has a wrong offset!");
static_assert(offsetof(FBannerConfig, HttpImageUrl) == 0x000030, "Member 'FBannerConfig::HttpImageUrl' has a wrong offset!");
static_assert(offsetof(FBannerConfig, ClickHref) == 0x000040, "Member 'FBannerConfig::ClickHref' has a wrong offset!");

// ScriptStruct TGFGame.TGFItem
// 0x0058 (0x0058 - 0x0000)
struct FTGFItem final
{
public:
	int32                                         Type_id;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Guid;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Expire_timepoint;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTGFItemPosition                       Position;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTGFItem) == 0x000008, "Wrong alignment on FTGFItem");
static_assert(sizeof(FTGFItem) == 0x000058, "Wrong size on FTGFItem");
static_assert(offsetof(FTGFItem, Type_id) == 0x000000, "Member 'FTGFItem::Type_id' has a wrong offset!");
static_assert(offsetof(FTGFItem, Count) == 0x000004, "Member 'FTGFItem::Count' has a wrong offset!");
static_assert(offsetof(FTGFItem, Guid) == 0x000008, "Member 'FTGFItem::Guid' has a wrong offset!");
static_assert(offsetof(FTGFItem, Expire_timepoint) == 0x00000C, "Member 'FTGFItem::Expire_timepoint' has a wrong offset!");
static_assert(offsetof(FTGFItem, Position) == 0x000010, "Member 'FTGFItem::Position' has a wrong offset!");

// ScriptStruct TGFGame.TGFMailReceiveKey
// 0x0028 (0x0028 - 0x0000)
struct FTGFMailReceiveKey final
{
public:
	int64                                         MailId;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTGFItem>                       Items;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Indexes;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTGFMailReceiveKey) == 0x000008, "Wrong alignment on FTGFMailReceiveKey");
static_assert(sizeof(FTGFMailReceiveKey) == 0x000028, "Wrong size on FTGFMailReceiveKey");
static_assert(offsetof(FTGFMailReceiveKey, MailId) == 0x000000, "Member 'FTGFMailReceiveKey::MailId' has a wrong offset!");
static_assert(offsetof(FTGFMailReceiveKey, Items) == 0x000008, "Member 'FTGFMailReceiveKey::Items' has a wrong offset!");
static_assert(offsetof(FTGFMailReceiveKey, Indexes) == 0x000018, "Member 'FTGFMailReceiveKey::Indexes' has a wrong offset!");

// ScriptStruct TGFGame.FlawlessStruct
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FFlawlessStruct final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFlawlessStruct) == 0x000004, "Wrong alignment on FFlawlessStruct");
static_assert(sizeof(FFlawlessStruct) == 0x00000C, "Wrong size on FFlawlessStruct");

// ScriptStruct TGFGame.RecommendProductSet
// 0x0050 (0x0050 - 0x0000)
struct FRecommendProductSet final
{
public:
	TMap<int32, class UTGFTradeMarketProductData*> ProductDataMap;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRecommendProductSet) == 0x000008, "Wrong alignment on FRecommendProductSet");
static_assert(sizeof(FRecommendProductSet) == 0x000050, "Wrong size on FRecommendProductSet");
static_assert(offsetof(FRecommendProductSet, ProductDataMap) == 0x000000, "Member 'FRecommendProductSet::ProductDataMap' has a wrong offset!");

// ScriptStruct TGFGame.RecommendProductPool
// 0x00F0 (0x00F0 - 0x0000)
struct FRecommendProductPool final
{
public:
	struct FRecommendProductSet                   ProductSetBase;                                    // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<ETgfEquipSubType, struct FRecommendProductSet> ProductSetEquipSubType;                            // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<ETGFProtoTgfEnItemMinorType, struct FRecommendProductSet> ProductSetItemMinorType;                           // 0x00A0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRecommendProductPool) == 0x000008, "Wrong alignment on FRecommendProductPool");
static_assert(sizeof(FRecommendProductPool) == 0x0000F0, "Wrong size on FRecommendProductPool");
static_assert(offsetof(FRecommendProductPool, ProductSetBase) == 0x000000, "Member 'FRecommendProductPool::ProductSetBase' has a wrong offset!");
static_assert(offsetof(FRecommendProductPool, ProductSetEquipSubType) == 0x000050, "Member 'FRecommendProductPool::ProductSetEquipSubType' has a wrong offset!");
static_assert(offsetof(FRecommendProductPool, ProductSetItemMinorType) == 0x0000A0, "Member 'FRecommendProductPool::ProductSetItemMinorType' has a wrong offset!");

// ScriptStruct TGFGame.ChatChannelConfigRow
// 0x0080 (0x0088 - 0x0008)
struct FChatChannelConfigRow final : public FTableRowBase
{
public:
	ETGFProtoTgfEnChatChannelType                 ChannelType;                                       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ChannelName;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         MaxCount;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxLength;                                         // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SendInterval;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInPanel;                                      // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<ETGFProtoTgfEnChatChannelType>           CanShowChannelSet;                                 // 0x0038(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatChannelConfigRow) == 0x000008, "Wrong alignment on FChatChannelConfigRow");
static_assert(sizeof(FChatChannelConfigRow) == 0x000088, "Wrong size on FChatChannelConfigRow");
static_assert(offsetof(FChatChannelConfigRow, ChannelType) == 0x000008, "Member 'FChatChannelConfigRow::ChannelType' has a wrong offset!");
static_assert(offsetof(FChatChannelConfigRow, ChannelName) == 0x000010, "Member 'FChatChannelConfigRow::ChannelName' has a wrong offset!");
static_assert(offsetof(FChatChannelConfigRow, MaxCount) == 0x000028, "Member 'FChatChannelConfigRow::MaxCount' has a wrong offset!");
static_assert(offsetof(FChatChannelConfigRow, MaxLength) == 0x00002C, "Member 'FChatChannelConfigRow::MaxLength' has a wrong offset!");
static_assert(offsetof(FChatChannelConfigRow, SendInterval) == 0x000030, "Member 'FChatChannelConfigRow::SendInterval' has a wrong offset!");
static_assert(offsetof(FChatChannelConfigRow, bShowInPanel) == 0x000034, "Member 'FChatChannelConfigRow::bShowInPanel' has a wrong offset!");
static_assert(offsetof(FChatChannelConfigRow, CanShowChannelSet) == 0x000038, "Member 'FChatChannelConfigRow::CanShowChannelSet' has a wrong offset!");

// ScriptStruct TGFGame.CultureTextMap
// 0x0058 (0x0058 - 0x0000)
struct FCultureTextMap final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ETGFProtoTgfEnMutlLanguageType, class FString> CultureTextMap;                                    // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCultureTextMap) == 0x000008, "Wrong alignment on FCultureTextMap");
static_assert(sizeof(FCultureTextMap) == 0x000058, "Wrong size on FCultureTextMap");
static_assert(offsetof(FCultureTextMap, bIsValid) == 0x000000, "Member 'FCultureTextMap::bIsValid' has a wrong offset!");
static_assert(offsetof(FCultureTextMap, CultureTextMap) == 0x000008, "Member 'FCultureTextMap::CultureTextMap' has a wrong offset!");

// ScriptStruct TGFGame.SystemNotify
// 0x0070 (0x0070 - 0x0000)
struct FSystemNotify final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETGFProtoTgfEnChatMsgSendType                 MsgSendType;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCultureTextMap                        CultureTextMap;                                    // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int64                                         RevocationSequence;                                // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExpirationTimestamp;                               // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSystemNotify) == 0x000008, "Wrong alignment on FSystemNotify");
static_assert(sizeof(FSystemNotify) == 0x000070, "Wrong size on FSystemNotify");
static_assert(offsetof(FSystemNotify, bIsValid) == 0x000000, "Member 'FSystemNotify::bIsValid' has a wrong offset!");
static_assert(offsetof(FSystemNotify, MsgSendType) == 0x000001, "Member 'FSystemNotify::MsgSendType' has a wrong offset!");
static_assert(offsetof(FSystemNotify, CultureTextMap) == 0x000008, "Member 'FSystemNotify::CultureTextMap' has a wrong offset!");
static_assert(offsetof(FSystemNotify, RevocationSequence) == 0x000060, "Member 'FSystemNotify::RevocationSequence' has a wrong offset!");
static_assert(offsetof(FSystemNotify, ExpirationTimestamp) == 0x000068, "Member 'FSystemNotify::ExpirationTimestamp' has a wrong offset!");

// ScriptStruct TGFGame.UserKey
// 0x0010 (0x0010 - 0x0000)
struct FUserKey final
{
public:
	int32                                         ZoneId;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         UserId;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUserKey) == 0x000008, "Wrong alignment on FUserKey");
static_assert(sizeof(FUserKey) == 0x000010, "Wrong size on FUserKey");
static_assert(offsetof(FUserKey, ZoneId) == 0x000000, "Member 'FUserKey::ZoneId' has a wrong offset!");
static_assert(offsetof(FUserKey, UserId) == 0x000008, "Member 'FUserKey::UserId' has a wrong offset!");

// ScriptStruct TGFGame.RoleKey
// 0x0010 (0x0010 - 0x0000)
struct FRoleKey final
{
public:
	int32                                         ZoneId;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RoleGuid;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoleKey) == 0x000008, "Wrong alignment on FRoleKey");
static_assert(sizeof(FRoleKey) == 0x000010, "Wrong size on FRoleKey");
static_assert(offsetof(FRoleKey, ZoneId) == 0x000000, "Member 'FRoleKey::ZoneId' has a wrong offset!");
static_assert(offsetof(FRoleKey, RoleGuid) == 0x000008, "Member 'FRoleKey::RoleGuid' has a wrong offset!");

// ScriptStruct TGFGame.ChatMessage
// 0x00E0 (0x00E0 - 0x0000)
struct FChatMessage final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETGFProtoTgfEnChatChannelType                 ChannelType;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Sequence;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         SendTimeStamp;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SendTimeNanos;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserKey                               SenderUserKey;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRoleKey                               SenderRoleKey;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUserKey                               ReceiverUserKey;                                   // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRoleKey                               ReceiverRoleKey;                                   // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TextContent;                                       // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSystemNotify                          SystemNotify;                                      // 0x0070(0x0070)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatMessage) == 0x000008, "Wrong alignment on FChatMessage");
static_assert(sizeof(FChatMessage) == 0x0000E0, "Wrong size on FChatMessage");
static_assert(offsetof(FChatMessage, bIsValid) == 0x000000, "Member 'FChatMessage::bIsValid' has a wrong offset!");
static_assert(offsetof(FChatMessage, ChannelType) == 0x000001, "Member 'FChatMessage::ChannelType' has a wrong offset!");
static_assert(offsetof(FChatMessage, Sequence) == 0x000008, "Member 'FChatMessage::Sequence' has a wrong offset!");
static_assert(offsetof(FChatMessage, SendTimeStamp) == 0x000010, "Member 'FChatMessage::SendTimeStamp' has a wrong offset!");
static_assert(offsetof(FChatMessage, SendTimeNanos) == 0x000018, "Member 'FChatMessage::SendTimeNanos' has a wrong offset!");
static_assert(offsetof(FChatMessage, SenderUserKey) == 0x000020, "Member 'FChatMessage::SenderUserKey' has a wrong offset!");
static_assert(offsetof(FChatMessage, SenderRoleKey) == 0x000030, "Member 'FChatMessage::SenderRoleKey' has a wrong offset!");
static_assert(offsetof(FChatMessage, ReceiverUserKey) == 0x000040, "Member 'FChatMessage::ReceiverUserKey' has a wrong offset!");
static_assert(offsetof(FChatMessage, ReceiverRoleKey) == 0x000050, "Member 'FChatMessage::ReceiverRoleKey' has a wrong offset!");
static_assert(offsetof(FChatMessage, TextContent) == 0x000060, "Member 'FChatMessage::TextContent' has a wrong offset!");
static_assert(offsetof(FChatMessage, SystemNotify) == 0x000070, "Member 'FChatMessage::SystemNotify' has a wrong offset!");

// ScriptStruct TGFGame.TGFDRoleDressUp
// 0x0004 (0x0004 - 0x0000)
struct FTGFDRoleDressUp final
{
public:
	int32                                         Default_dress_up_type_id;                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTGFDRoleDressUp) == 0x000004, "Wrong alignment on FTGFDRoleDressUp");
static_assert(sizeof(FTGFDRoleDressUp) == 0x000004, "Wrong size on FTGFDRoleDressUp");
static_assert(offsetof(FTGFDRoleDressUp, Default_dress_up_type_id) == 0x000000, "Member 'FTGFDRoleDressUp::Default_dress_up_type_id' has a wrong offset!");

// ScriptStruct TGFGame.TGFRoleMetaIndex
// 0x0008 (0x0008 - 0x0000)
struct FTGFRoleMetaIndex final
{
public:
	int32                                         Faction;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETgfActorCareer                               Career;                                            // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EnRoleGenderType                              Gender;                                            // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETgfActorRace                                 Race;                                              // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETgfForceType                                 Force;                                             // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTGFRoleMetaIndex) == 0x000004, "Wrong alignment on FTGFRoleMetaIndex");
static_assert(sizeof(FTGFRoleMetaIndex) == 0x000008, "Wrong size on FTGFRoleMetaIndex");
static_assert(offsetof(FTGFRoleMetaIndex, Faction) == 0x000000, "Member 'FTGFRoleMetaIndex::Faction' has a wrong offset!");
static_assert(offsetof(FTGFRoleMetaIndex, Career) == 0x000004, "Member 'FTGFRoleMetaIndex::Career' has a wrong offset!");
static_assert(offsetof(FTGFRoleMetaIndex, Gender) == 0x000005, "Member 'FTGFRoleMetaIndex::Gender' has a wrong offset!");
static_assert(offsetof(FTGFRoleMetaIndex, Race) == 0x000006, "Member 'FTGFRoleMetaIndex::Race' has a wrong offset!");
static_assert(offsetof(FTGFRoleMetaIndex, Force) == 0x000007, "Member 'FTGFRoleMetaIndex::Force' has a wrong offset!");

// ScriptStruct TGFGame.TGFTradeProductSearchResultData
// 0x0018 (0x0018 - 0x0000)
struct FTGFTradeProductSearchResultData final
{
public:
	TArray<class UTGFTradeMarketProductData*>     ResultDatas;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          HasNextPage;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTGFTradeProductSearchResultData) == 0x000008, "Wrong alignment on FTGFTradeProductSearchResultData");
static_assert(sizeof(FTGFTradeProductSearchResultData) == 0x000018, "Wrong size on FTGFTradeProductSearchResultData");
static_assert(offsetof(FTGFTradeProductSearchResultData, ResultDatas) == 0x000000, "Member 'FTGFTradeProductSearchResultData::ResultDatas' has a wrong offset!");
static_assert(offsetof(FTGFTradeProductSearchResultData, HasNextPage) == 0x000010, "Member 'FTGFTradeProductSearchResultData::HasNextPage' has a wrong offset!");

// ScriptStruct TGFGame.CraftTab
// 0x0050 (0x0050 - 0x0000)
struct FCraftTab final
{
public:
	TMap<int32, class UFusionItemData*>           Crafts;                                            // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCraftTab) == 0x000008, "Wrong alignment on FCraftTab");
static_assert(sizeof(FCraftTab) == 0x000050, "Wrong size on FCraftTab");
static_assert(offsetof(FCraftTab, Crafts) == 0x000000, "Member 'FCraftTab::Crafts' has a wrong offset!");

// ScriptStruct TGFGame.RpcGameClientServiceMethods
// 0x0730 (0x0730 - 0x0000)
struct FRpcGameClientServiceMethods final
{
public:
	class FName                                   PreLogin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LoginNotifySync;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Login;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ClientActionLog;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Ping;                                              // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BusinessPing;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NetworkLatencyReport;                              // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UpdateAccountData;                                 // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TelemetryReport;                                   // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ModalMessage;                                      // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerGetInfo;                                     // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerDirtyChange;                                 // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerGetInfoByPage;                               // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerBatchGetBasicInfo;                           // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerBatchGetIdKey;                               // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerRename;                                      // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerUpdateIcon;                                  // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerUpdateOptions;                               // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerGmCommand;                                   // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerSettingData;                                 // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerKickoffReason;                               // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerAcePacket;                                   // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerAcePacketSync;                               // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EventCmdInfoSync;                                  // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerUriRedirect;                                 // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerReceiveHomelandReward;                       // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReportAction;                                      // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerBirthdayUpdate;                              // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CacheBatchGet;                                     // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CacheUnwatch;                                      // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CacheExpired;                                      // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CacheUpdateMeta;                                   // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerAllCacheExpired;                             // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MailGetAll;                                        // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MailRead;                                          // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MailReadAll;                                       // 0x0118(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MailReceiveAttachment;                             // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MailReceiveAttachmentAll;                          // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MailChangeSync;                                    // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MailReceiveAttachmentPartly;                       // 0x0138(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HallSetRole;                                       // 0x0140(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HallSwitch;                                        // 0x0148(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleMatchingPreSearch;                           // 0x0150(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleMatchingCancelPreSearch;                     // 0x0158(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleMatchingSearch;                              // 0x0160(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleMatchingHeartbeat;                           // 0x0168(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleMatchingExit;                                // 0x0170(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleMatchingConfirmRefuse;                       // 0x0178(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleMatchingLogSync;                             // 0x0180(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleRoomLogSync;                                 // 0x0188(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleRoomHeartbeat;                               // 0x0190(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleRecordListGet;                               // 0x0198(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleRecordDataGet;                               // 0x01A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleRecordDataSet;                               // 0x01A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleRoomPlayerAct;                               // 0x01B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleUpdateSetting;                               // 0x01B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleSettleSync;                                  // 0x01C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BattleFetchBattleUserData;                         // 0x01C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LevelPrestart;                                     // 0x01D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LevelStart;                                        // 0x01D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LevelFinish;                                       // 0x01E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LevelSelect;                                       // 0x01E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LevelChallenge;                                    // 0x01F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MapMove;                                           // 0x01F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendGetAll;                                      // 0x0200(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendInvite;                                      // 0x0208(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendAcceptInvite;                                // 0x0210(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendRejectInvite;                                // 0x0218(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendRemove;                                      // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendSendGift;                                    // 0x0228(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendReceiveGift;                                 // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendGetSuggest;                                  // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendAcceptAllInvite;                             // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FriendRejectAllInvite;                             // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildCreate;                                       // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildExit;                                         // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildPayOff;                                       // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildGetAll;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildBatchGet;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildSuggest;                                      // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildSetRole;                                      // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildRename;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildSetConfigure;                                 // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildSendApply;                                    // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildApproveApply;                                 // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildRejectApply;                                  // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildSendInvitation;                               // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildApproveInvitation;                            // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildRejectInvitation;                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildRevokeInvitation;                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildRemoveMember;                                 // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildAddImpeachment;                               // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GuildVoteImpeachment;                              // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChatGetAllChannels;                                // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChatGetChannelSnapshot;                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChatChannelHeartbeat;                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChatSendMessage;                                   // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChatUpdatePanel;                                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TeamSendInvitation;                                // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TeamApproveInvitation;                             // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
