#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGFGame

#include "Basic.hpp"

#include "TGFFramework_classes.hpp"
#include "LyraGame_structs.hpp"
#include "LyraGame_classes.hpp"
#include "TGFGame_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"
#include "TGFBattleProtocol_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameSettings_classes.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class TGFGame.TGFTradeSalesOrderResponseEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFTradeSalesOrderResponseEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFTradeSalesOrderResponseEvent">();
	}
	static class UTGFTradeSalesOrderResponseEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFTradeSalesOrderResponseEvent>();
	}
};
static_assert(alignof(UTGFTradeSalesOrderResponseEvent) == 0x000008, "Wrong alignment on UTGFTradeSalesOrderResponseEvent");
static_assert(sizeof(UTGFTradeSalesOrderResponseEvent) == 0x000028, "Wrong size on UTGFTradeSalesOrderResponseEvent");

// Class TGFGame.ACEReportService
// 0x0010 (0x0040 - 0x0030)
class UACEReportService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Lua_ACEReportPlayerInBattle(int64 TargetOpenId, int32 TargetZoneId, const class FString& TargetPlayerName, class APlayerController* SourcePC);
	void SendACEReportRequest(class UTGFProtoTgfCSReportActionReqReportBodyPublic* Body);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ACEReportService">();
	}
	static class UACEReportService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UACEReportService>();
	}
};
static_assert(alignof(UACEReportService) == 0x000008, "Wrong alignment on UACEReportService");
static_assert(sizeof(UACEReportService) == 0x000040, "Wrong size on UACEReportService");

// Class TGFGame.ACEService
// 0x0018 (0x0048 - 0x0030)
class UACEService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameLoginSuccess(class UTGFEventArgs* Args);
	void OnGameLogout(class UTGFEventArgs* Args);
	void OnNetworkManagerEnterState(class UTGFEventArgs* Args);
	void OnNetworkManagerExitState(class UTGFEventArgs* Args);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ACEService">();
	}
	static class UACEService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UACEService>();
	}
};
static_assert(alignof(UACEService) == 0x000008, "Wrong alignment on UACEService");
static_assert(sizeof(UACEService) == 0x000048, "Wrong size on UACEService");

// Class TGFGame.TGFTradeTradeUnlockStateUpdateEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFTradeTradeUnlockStateUpdateEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFTradeTradeUnlockStateUpdateEvent">();
	}
	static class UTGFTradeTradeUnlockStateUpdateEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFTradeTradeUnlockStateUpdateEvent>();
	}
};
static_assert(alignof(UTGFTradeTradeUnlockStateUpdateEvent) == 0x000008, "Wrong alignment on UTGFTradeTradeUnlockStateUpdateEvent");
static_assert(sizeof(UTGFTradeTradeUnlockStateUpdateEvent) == 0x000028, "Wrong size on UTGFTradeTradeUnlockStateUpdateEvent");

// Class TGFGame.ActivityCenterListRsponse
// 0x0008 (0x0030 - 0x0028)
class UActivityCenterListRsponse final : public UTGFEventArgs
{
public:
	class UTGFProtoTgfDUserActivityDataList*      List;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityCenterListRsponse">();
	}
	static class UActivityCenterListRsponse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityCenterListRsponse>();
	}
};
static_assert(alignof(UActivityCenterListRsponse) == 0x000008, "Wrong alignment on UActivityCenterListRsponse");
static_assert(sizeof(UActivityCenterListRsponse) == 0x000030, "Wrong size on UActivityCenterListRsponse");
static_assert(offsetof(UActivityCenterListRsponse, List) == 0x000028, "Member 'UActivityCenterListRsponse::List' has a wrong offset!");

// Class TGFGame.ActivityCenterUpdate
// 0x0008 (0x0030 - 0x0028)
class UActivityCenterUpdate final : public UTGFEventArgs
{
public:
	class UTGFProtoTgfDUserActivityDataList*      List;                                              // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityCenterUpdate">();
	}
	static class UActivityCenterUpdate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityCenterUpdate>();
	}
};
static_assert(alignof(UActivityCenterUpdate) == 0x000008, "Wrong alignment on UActivityCenterUpdate");
static_assert(sizeof(UActivityCenterUpdate) == 0x000030, "Wrong size on UActivityCenterUpdate");
static_assert(offsetof(UActivityCenterUpdate, List) == 0x000028, "Member 'UActivityCenterUpdate::List' has a wrong offset!");

// Class TGFGame.TGFResolutionService
// 0x0070 (0x00A0 - 0x0030)
class UTGFResolutionService final : public UGameInstanceSubsystem
{
public:
	TArray<struct FTGFScreenResolutionPackage>    ResolutionPacks;                                   // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntPoint>                      DPLimitFullScreenResolutionList;                   // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Version;                                           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFResolutionService">();
	}
	static class UTGFResolutionService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFResolutionService>();
	}
};
static_assert(alignof(UTGFResolutionService) == 0x000008, "Wrong alignment on UTGFResolutionService");
static_assert(sizeof(UTGFResolutionService) == 0x0000A0, "Wrong size on UTGFResolutionService");
static_assert(offsetof(UTGFResolutionService, ResolutionPacks) == 0x000030, "Member 'UTGFResolutionService::ResolutionPacks' has a wrong offset!");
static_assert(offsetof(UTGFResolutionService, DPLimitFullScreenResolutionList) == 0x000070, "Member 'UTGFResolutionService::DPLimitFullScreenResolutionList' has a wrong offset!");
static_assert(offsetof(UTGFResolutionService, Version) == 0x000088, "Member 'UTGFResolutionService::Version' has a wrong offset!");

// Class TGFGame.ActivityCenterService
// 0x0010 (0x0040 - 0x0030)
class UActivityCenterService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTGFProtoTgfDUserActivityDataList*      ActivityCenterData;                                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UTGFProtoTgfDUserActivityDataList* GetActivityCenterData();
	bool IsActivityListEmpty();
	void SendActivityCenterListReq();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityCenterService">();
	}
	static class UActivityCenterService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityCenterService>();
	}
};
static_assert(alignof(UActivityCenterService) == 0x000008, "Wrong alignment on UActivityCenterService");
static_assert(sizeof(UActivityCenterService) == 0x000040, "Wrong size on UActivityCenterService");
static_assert(offsetof(UActivityCenterService, ActivityCenterData) == 0x000038, "Member 'UActivityCenterService::ActivityCenterData' has a wrong offset!");

// Class TGFGame.TGFReceiveActivityRandomRewardEvent
// 0x0010 (0x0038 - 0x0028)
class UTGFReceiveActivityRandomRewardEvent final : public UTGFEventArgs
{
public:
	TArray<class UTGFProtoTgfDItemBasic*>         ItemBasics;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFReceiveActivityRandomRewardEvent">();
	}
	static class UTGFReceiveActivityRandomRewardEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFReceiveActivityRandomRewardEvent>();
	}
};
static_assert(alignof(UTGFReceiveActivityRandomRewardEvent) == 0x000008, "Wrong alignment on UTGFReceiveActivityRandomRewardEvent");
static_assert(sizeof(UTGFReceiveActivityRandomRewardEvent) == 0x000038, "Wrong size on UTGFReceiveActivityRandomRewardEvent");
static_assert(offsetof(UTGFReceiveActivityRandomRewardEvent, ItemBasics) == 0x000028, "Member 'UTGFReceiveActivityRandomRewardEvent::ItemBasics' has a wrong offset!");

// Class TGFGame.TGFNetworkManagerExitStateEvent
// 0x0020 (0x0048 - 0x0028)
class UTGFNetworkManagerExitStateEvent final : public UTGFEventArgs
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFNetworkManagerExitStateEvent">();
	}
	static class UTGFNetworkManagerExitStateEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFNetworkManagerExitStateEvent>();
	}
};
static_assert(alignof(UTGFNetworkManagerExitStateEvent) == 0x000008, "Wrong alignment on UTGFNetworkManagerExitStateEvent");
static_assert(sizeof(UTGFNetworkManagerExitStateEvent) == 0x000048, "Wrong size on UTGFNetworkManagerExitStateEvent");

// Class TGFGame.ActivityRewardService
// 0x0008 (0x0038 - 0x0030)
class UActivityRewardService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetActivityRandomReward(int32 ActivityId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActivityRewardService">();
	}
	static class UActivityRewardService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityRewardService>();
	}
};
static_assert(alignof(UActivityRewardService) == 0x000008, "Wrong alignment on UActivityRewardService");
static_assert(sizeof(UActivityRewardService) == 0x000038, "Wrong size on UActivityRewardService");

// Class TGFGame.AlertWindow
// 0x0008 (0x02C0 - 0x02B8)
class UAlertWindow final : public UTGFWindow
{
public:
	class UAlertWindowArgs*                       AlertWindowArgs;                                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnConfirmButtonClicked();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlertWindow">();
	}
	static class UAlertWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlertWindow>();
	}
};
static_assert(alignof(UAlertWindow) == 0x000008, "Wrong alignment on UAlertWindow");
static_assert(sizeof(UAlertWindow) == 0x0002C0, "Wrong size on UAlertWindow");
static_assert(offsetof(UAlertWindow, AlertWindowArgs) == 0x0002B8, "Member 'UAlertWindow::AlertWindowArgs' has a wrong offset!");

// Class TGFGame.TGFTradeAuctionInfoResponseEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFTradeAuctionInfoResponseEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFTradeAuctionInfoResponseEvent">();
	}
	static class UTGFTradeAuctionInfoResponseEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFTradeAuctionInfoResponseEvent>();
	}
};
static_assert(alignof(UTGFTradeAuctionInfoResponseEvent) == 0x000008, "Wrong alignment on UTGFTradeAuctionInfoResponseEvent");
static_assert(sizeof(UTGFTradeAuctionInfoResponseEvent) == 0x000028, "Wrong size on UTGFTradeAuctionInfoResponseEvent");

// Class TGFGame.AlertWindowArgs
// 0x0040 (0x0070 - 0x0030)
class UAlertWindowArgs final : public UTGFWindowArgs
{
public:
	class FText                                   Message;                                           // 0x0030(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ConfirmText;                                       // 0x0048(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlertWindowArgs">();
	}
	static class UAlertWindowArgs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlertWindowArgs>();
	}
};
static_assert(alignof(UAlertWindowArgs) == 0x000008, "Wrong alignment on UAlertWindowArgs");
static_assert(sizeof(UAlertWindowArgs) == 0x000070, "Wrong size on UAlertWindowArgs");
static_assert(offsetof(UAlertWindowArgs, Message) == 0x000030, "Member 'UAlertWindowArgs::Message' has a wrong offset!");
static_assert(offsetof(UAlertWindowArgs, ConfirmText) == 0x000048, "Member 'UAlertWindowArgs::ConfirmText' has a wrong offset!");

// Class TGFGame.AppService
// 0x00D0 (0x0100 - 0x0030)
class UAppService final : public UTGFService
{
public:
	uint8                                         Pad_30[0xD0];                                      // 0x0030(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastGameLogoutEvent();
	void ChangeHallState(const EHallState& InHallState);
	void CleanWindows();
	class AActor* GetWardrobeAvatarFromPool();
	void LogoutGame();
	void Lua_OnEnterStateHall();
	void OnCreateRoleLevelLoaded();
	void OnCreateRoleLevelShown();
	void OnNetworkManagerEnterState(class UTGFEventArgs* Args);
	void OnWardrobeLevelHidden();
	void OnWardrobeLevelLoaded();
	void OnWardrobeLevelShown();
	class UUserWidget* OpenWindow(const class FString& Path, class UTGFWindowArgs* Args, bool bIsUnique);
	void RecycleWardrobeAvatar(class AActor* InRecycleActor);
	void RollbackHallState();
	void SetCreateRoleLevelVisible(bool bValue);
	void SetWardrobeLevelVisible(bool bValue);
	void ShouldShutDownHallGlobalEffects(bool bIsOpen);
	class AActor* SpawnActorToWardrobeLevel(class UClass* Param_Class, const struct FVector& Location, const struct FRotator& Rotation);
	void ToggleCurrentLevelCompRegistration(bool bValue);
	void ToggleOptimizationForSceneCapture(bool bIsOpen);

	bool CheckAboutToQuit() const;
	void ConfirmToQuit() const;
	EAppState GetAppState() const;
	EHallState GetHallState() const;
	void LoadHall() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppService">();
	}
	static class UAppService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppService>();
	}
};
static_assert(alignof(UAppService) == 0x000008, "Wrong alignment on UAppService");
static_assert(sizeof(UAppService) == 0x000100, "Wrong size on UAppService");

// Class TGFGame.TGFNetworkManager
// 0x0078 (0x00A8 - 0x0030)
class UTGFNetworkManager final : public UTGFSubsystem
{
public:
	uint8                                         Pad_30[0x78];                                      // 0x0030(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameLoginFailed(class UTGFEventArgs* Args);
	void OnGameLoginSuccess(class UTGFEventArgs* Args);
	void OnGameLogout(class UTGFEventArgs* Args);
	void OnGamePreLoginFailed(class UTGFEventArgs* Args);
	void OnGamePreLoginSuccess(class UTGFEventArgs* Args);
	void OnSyncPlayerInfoSuccess(class UTGFEventArgs* Args);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFNetworkManager">();
	}
	static class UTGFNetworkManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFNetworkManager>();
	}
};
static_assert(alignof(UTGFNetworkManager) == 0x000008, "Wrong alignment on UTGFNetworkManager");
static_assert(sizeof(UTGFNetworkManager) == 0x0000A8, "Wrong size on UTGFNetworkManager");

// Class TGFGame.AsyncAction_ShowAlert
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_ShowAlert final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnResult;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAlertWindowArgs*                       Args;                                              // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAsyncAction_ShowAlert* ShowAlert(class UObject* InWorldContextObject, const class FText& Message, const class FText& ConfirmText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ShowAlert">();
	}
	static class UAsyncAction_ShowAlert* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ShowAlert>();
	}
};
static_assert(alignof(UAsyncAction_ShowAlert) == 0x000008, "Wrong alignment on UAsyncAction_ShowAlert");
static_assert(sizeof(UAsyncAction_ShowAlert) == 0x000050, "Wrong size on UAsyncAction_ShowAlert");
static_assert(offsetof(UAsyncAction_ShowAlert, OnResult) == 0x000030, "Member 'UAsyncAction_ShowAlert::OnResult' has a wrong offset!");
static_assert(offsetof(UAsyncAction_ShowAlert, WorldContextObject) == 0x000040, "Member 'UAsyncAction_ShowAlert::WorldContextObject' has a wrong offset!");
static_assert(offsetof(UAsyncAction_ShowAlert, Args) == 0x000048, "Member 'UAsyncAction_ShowAlert::Args' has a wrong offset!");

// Class TGFGame.AsyncAction_ShowConfirm
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_ShowConfirm final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnResult;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UConfirmWindowArgs*                     Args;                                              // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAsyncAction_ShowConfirm* ShowConfirm(class UObject* InWorldContextObject, const class FText& Message, const class FText& ConfirmText, const class FText& CancelText, class UObject* Context);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ShowConfirm">();
	}
	static class UAsyncAction_ShowConfirm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ShowConfirm>();
	}
};
static_assert(alignof(UAsyncAction_ShowConfirm) == 0x000008, "Wrong alignment on UAsyncAction_ShowConfirm");
static_assert(sizeof(UAsyncAction_ShowConfirm) == 0x000050, "Wrong size on UAsyncAction_ShowConfirm");
static_assert(offsetof(UAsyncAction_ShowConfirm, OnResult) == 0x000030, "Member 'UAsyncAction_ShowConfirm::OnResult' has a wrong offset!");
static_assert(offsetof(UAsyncAction_ShowConfirm, WorldContextObject) == 0x000040, "Member 'UAsyncAction_ShowConfirm::WorldContextObject' has a wrong offset!");
static_assert(offsetof(UAsyncAction_ShowConfirm, Args) == 0x000048, "Member 'UAsyncAction_ShowConfirm::Args' has a wrong offset!");

// Class TGFGame.RoleAttributeCoreInfo
// 0x0020 (0x0048 - 0x0028)
class URoleAttributeCoreInfo final : public UObject
{
public:
	float                                         Health;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Dexterity;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stamina;                                           // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intelligence;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Will;                                              // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Faith;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EquipLevel;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoleAttributeCoreInfo">();
	}
	static class URoleAttributeCoreInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoleAttributeCoreInfo>();
	}
};
static_assert(alignof(URoleAttributeCoreInfo) == 0x000008, "Wrong alignment on URoleAttributeCoreInfo");
static_assert(sizeof(URoleAttributeCoreInfo) == 0x000048, "Wrong size on URoleAttributeCoreInfo");
static_assert(offsetof(URoleAttributeCoreInfo, Health) == 0x000028, "Member 'URoleAttributeCoreInfo::Health' has a wrong offset!");
static_assert(offsetof(URoleAttributeCoreInfo, Strength) == 0x00002C, "Member 'URoleAttributeCoreInfo::Strength' has a wrong offset!");
static_assert(offsetof(URoleAttributeCoreInfo, Dexterity) == 0x000030, "Member 'URoleAttributeCoreInfo::Dexterity' has a wrong offset!");
static_assert(offsetof(URoleAttributeCoreInfo, Stamina) == 0x000034, "Member 'URoleAttributeCoreInfo::Stamina' has a wrong offset!");
static_assert(offsetof(URoleAttributeCoreInfo, Intelligence) == 0x000038, "Member 'URoleAttributeCoreInfo::Intelligence' has a wrong offset!");
static_assert(offsetof(URoleAttributeCoreInfo, Will) == 0x00003C, "Member 'URoleAttributeCoreInfo::Will' has a wrong offset!");
static_assert(offsetof(URoleAttributeCoreInfo, Faith) == 0x000040, "Member 'URoleAttributeCoreInfo::Faith' has a wrong offset!");
static_assert(offsetof(URoleAttributeCoreInfo, EquipLevel) == 0x000044, "Member 'URoleAttributeCoreInfo::EquipLevel' has a wrong offset!");

// Class TGFGame.TGFBannerUpdateConfigEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFBannerUpdateConfigEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBannerUpdateConfigEvent">();
	}
	static class UTGFBannerUpdateConfigEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBannerUpdateConfigEvent>();
	}
};
static_assert(alignof(UTGFBannerUpdateConfigEvent) == 0x000008, "Wrong alignment on UTGFBannerUpdateConfigEvent");
static_assert(sizeof(UTGFBannerUpdateConfigEvent) == 0x000028, "Wrong size on UTGFBannerUpdateConfigEvent");

// Class TGFGame.BannerScrollView
// 0x0000 (0x0278 - 0x0278)
class UBannerScrollView final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BannerScrollView">();
	}
	static class UBannerScrollView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBannerScrollView>();
	}
};
static_assert(alignof(UBannerScrollView) == 0x000008, "Wrong alignment on UBannerScrollView");
static_assert(sizeof(UBannerScrollView) == 0x000278, "Wrong size on UBannerScrollView");

// Class TGFGame.UnlockBanWindowArgs
// 0x0030 (0x0060 - 0x0030)
class UUnlockBanWindowArgs final : public UTGFWindowArgs
{
public:
	class FText                                   Message;                                           // 0x0030(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bCustomerService;                                  // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x17];                                      // 0x0049(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnlockBanWindowArgs">();
	}
	static class UUnlockBanWindowArgs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnlockBanWindowArgs>();
	}
};
static_assert(alignof(UUnlockBanWindowArgs) == 0x000008, "Wrong alignment on UUnlockBanWindowArgs");
static_assert(sizeof(UUnlockBanWindowArgs) == 0x000060, "Wrong size on UUnlockBanWindowArgs");
static_assert(offsetof(UUnlockBanWindowArgs, Message) == 0x000030, "Member 'UUnlockBanWindowArgs::Message' has a wrong offset!");
static_assert(offsetof(UUnlockBanWindowArgs, bCustomerService) == 0x000048, "Member 'UUnlockBanWindowArgs::bCustomerService' has a wrong offset!");

// Class TGFGame.BannerSubsystem
// 0x0060 (0x0090 - 0x0030)
class UBannerSubsystem final : public UTGFSubsystem
{
public:
	int32                                         MyConfigExpiredTime;                               // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         MyLastUpdateConfigTimestamp;                       // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<int32, struct FBannerConfig>             MyBannerConfigMap;                                 // 0x0040(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	bool GetBannerConfigList(TArray<struct FBannerConfig>* BannerConfigList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BannerSubsystem">();
	}
	static class UBannerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBannerSubsystem>();
	}
};
static_assert(alignof(UBannerSubsystem) == 0x000008, "Wrong alignment on UBannerSubsystem");
static_assert(sizeof(UBannerSubsystem) == 0x000090, "Wrong size on UBannerSubsystem");
static_assert(offsetof(UBannerSubsystem, MyConfigExpiredTime) == 0x000030, "Member 'UBannerSubsystem::MyConfigExpiredTime' has a wrong offset!");
static_assert(offsetof(UBannerSubsystem, MyLastUpdateConfigTimestamp) == 0x000038, "Member 'UBannerSubsystem::MyLastUpdateConfigTimestamp' has a wrong offset!");
static_assert(offsetof(UBannerSubsystem, MyBannerConfigMap) == 0x000040, "Member 'UBannerSubsystem::MyBannerConfigMap' has a wrong offset!");

// Class TGFGame.TGFBattlePassPassportInfoUpdateEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFBattlePassPassportInfoUpdateEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBattlePassPassportInfoUpdateEvent">();
	}
	static class UTGFBattlePassPassportInfoUpdateEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBattlePassPassportInfoUpdateEvent>();
	}
};
static_assert(alignof(UTGFBattlePassPassportInfoUpdateEvent) == 0x000008, "Wrong alignment on UTGFBattlePassPassportInfoUpdateEvent");
static_assert(sizeof(UTGFBattlePassPassportInfoUpdateEvent) == 0x000028, "Wrong size on UTGFBattlePassPassportInfoUpdateEvent");

// Class TGFGame.TradeSaleService
// 0x0028 (0x0058 - 0x0030)
class UTradeSaleService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTradeSaleItem*>                 SaleableItems;                                     // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	TArray<class UTradeSaleItem*> GetSaleableItems(const int32 MarketId, const TArray<ETGFProtoTgfEnGearEquipSubType>& Types, ETGFProtoTgfEnItemRarity Rarity, bool SortByPriceUp);
	void OnGameLogout(class UTGFEventArgs* Args);
	void PublishAuctionOrder(int32 MarketId, const struct FTGFItem& SaleItem, int32 Price, int32 CostType, int32 FixedPrice);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TradeSaleService">();
	}
	static class UTradeSaleService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTradeSaleService>();
	}
};
static_assert(alignof(UTradeSaleService) == 0x000008, "Wrong alignment on UTradeSaleService");
static_assert(sizeof(UTradeSaleService) == 0x000058, "Wrong size on UTradeSaleService");
static_assert(offsetof(UTradeSaleService, SaleableItems) == 0x000048, "Member 'UTradeSaleService::SaleableItems' has a wrong offset!");

// Class TGFGame.TGFBattleBuyPassPassportEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFBattleBuyPassPassportEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBattleBuyPassPassportEvent">();
	}
	static class UTGFBattleBuyPassPassportEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBattleBuyPassPassportEvent>();
	}
};
static_assert(alignof(UTGFBattleBuyPassPassportEvent) == 0x000008, "Wrong alignment on UTGFBattleBuyPassPassportEvent");
static_assert(sizeof(UTGFBattleBuyPassPassportEvent) == 0x000028, "Wrong size on UTGFBattleBuyPassPassportEvent");

// Class TGFGame.TGFBattlePassPassportReceiveRewardsEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFBattlePassPassportReceiveRewardsEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBattlePassPassportReceiveRewardsEvent">();
	}
	static class UTGFBattlePassPassportReceiveRewardsEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBattlePassPassportReceiveRewardsEvent>();
	}
};
static_assert(alignof(UTGFBattlePassPassportReceiveRewardsEvent) == 0x000008, "Wrong alignment on UTGFBattlePassPassportReceiveRewardsEvent");
static_assert(sizeof(UTGFBattlePassPassportReceiveRewardsEvent) == 0x000028, "Wrong size on UTGFBattlePassPassportReceiveRewardsEvent");

// Class TGFGame.UnlockService
// 0x01F0 (0x0220 - 0x0030)
class UUnlockService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMyHaveBeenKicked;                                 // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBanModule                             MyBanModule;                                       // 0x0040(0x0088)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FUnlockModuleMap                       MyGlobalUnlockModuleMap;                           // 0x00C8(0x0058)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FUnlockModuleMap                       MyUserUnlockModuleMap;                             // 0x0120(0x0058)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FModuleCircularCfgDataMap              MyModuleCircularQueueMap;                          // 0x0178(0x0058)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FTimerHandle>              MyModuleCircularTimerMap;                          // 0x01D0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	class FText GetModuleBannedMessage(int32 InModuleId);
	class FText GetModuleCircularLockMessage(int32 InModuleId);
	class FText GetModuleCircularNextTimeMessage(int32 InModuleId);
	class FText GetModuleGlobalForbidMessage(int32 InModuleId);
	class FText GetModuleLockMessage(int32 InModuleId);
	class FText GetModuleNextTimeMessage(int32 InModuleId);
	class FText GetModuleTimeLockMessage(int32 InModuleId);
	bool IsModuleAllowed(int32 InModuleId, bool bIsAlert, bool bIsToast);
	bool IsModuleBanned(int32 InModuleId, bool bIsAlert, bool bIsToast);
	bool IsModuleCircularLock(int32 InModuleId, bool bIsAlert, bool bIsToast);
	bool IsModuleGlobalForbid(int32 InModuleId, bool bIsAlert, bool bIsToast);
	bool IsModuleLock(int32 InModuleId, bool bIsAlert, bool bIsToast);
	bool IsModuleTimeLock(int32 InModuleId, bool bIsAlert, bool bIsToast);
	void ShowGameKickedAlert();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnlockService">();
	}
	static class UUnlockService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnlockService>();
	}
};
static_assert(alignof(UUnlockService) == 0x000008, "Wrong alignment on UUnlockService");
static_assert(sizeof(UUnlockService) == 0x000220, "Wrong size on UUnlockService");
static_assert(offsetof(UUnlockService, bMyHaveBeenKicked) == 0x000038, "Member 'UUnlockService::bMyHaveBeenKicked' has a wrong offset!");
static_assert(offsetof(UUnlockService, MyBanModule) == 0x000040, "Member 'UUnlockService::MyBanModule' has a wrong offset!");
static_assert(offsetof(UUnlockService, MyGlobalUnlockModuleMap) == 0x0000C8, "Member 'UUnlockService::MyGlobalUnlockModuleMap' has a wrong offset!");
static_assert(offsetof(UUnlockService, MyUserUnlockModuleMap) == 0x000120, "Member 'UUnlockService::MyUserUnlockModuleMap' has a wrong offset!");
static_assert(offsetof(UUnlockService, MyModuleCircularQueueMap) == 0x000178, "Member 'UUnlockService::MyModuleCircularQueueMap' has a wrong offset!");
static_assert(offsetof(UUnlockService, MyModuleCircularTimerMap) == 0x0001D0, "Member 'UUnlockService::MyModuleCircularTimerMap' has a wrong offset!");

// Class TGFGame.TGFBattlePassPassportReceiveCycleRewardsEvent
// 0x0000 (0x0028 - 0x0028)
class UTGFBattlePassPassportReceiveCycleRewardsEvent final : public UTGFEventArgs
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBattlePassPassportReceiveCycleRewardsEvent">();
	}
	static class UTGFBattlePassPassportReceiveCycleRewardsEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBattlePassPassportReceiveCycleRewardsEvent>();
	}
};
static_assert(alignof(UTGFBattlePassPassportReceiveCycleRewardsEvent) == 0x000008, "Wrong alignment on UTGFBattlePassPassportReceiveCycleRewardsEvent");
static_assert(sizeof(UTGFBattlePassPassportReceiveCycleRewardsEvent) == 0x000028, "Wrong size on UTGFBattlePassPassportReceiveCycleRewardsEvent");

// Class TGFGame.TGFBattlePassPassportRefreshQuestEvent
// 0x0008 (0x0030 - 0x0028)
class UTGFBattlePassPassportRefreshQuestEvent final : public UTGFEventArgs
{
public:
	int32                                         QuestId;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBattlePassPassportRefreshQuestEvent">();
	}
	static class UTGFBattlePassPassportRefreshQuestEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBattlePassPassportRefreshQuestEvent>();
	}
};
static_assert(alignof(UTGFBattlePassPassportRefreshQuestEvent) == 0x000008, "Wrong alignment on UTGFBattlePassPassportRefreshQuestEvent");
static_assert(sizeof(UTGFBattlePassPassportRefreshQuestEvent) == 0x000030, "Wrong size on UTGFBattlePassPassportRefreshQuestEvent");
static_assert(offsetof(UTGFBattlePassPassportRefreshQuestEvent, QuestId) == 0x000028, "Member 'UTGFBattlePassPassportRefreshQuestEvent::QuestId' has a wrong offset!");

// Class TGFGame.VelocityService
// 0x0108 (0x0138 - 0x0030)
class UVelocityService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTGFRegionDetailData                   Region_detail;                                     // 0x0040(0x0098)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x20];                                      // 0x00D8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTGFRegionData                         CurSelectRegionData;                               // 0x00F8(0x0040)(NativeAccessSpecifierPrivate)

public:
	void CdnHTTPRequest(const class FString& URL);
	void ClosePersistentSend();
	struct FTGFRegionData GetCurSelectRegionData();
	int32 GetLatencyByRegionId(const class FString& RegionId);
	const struct FTGFRegionDetailData GetRegionDetailData();
	void OpenPersistentSend();
	void SetCurSelectRegionData(const struct FTGFRegionData& RegionData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VelocityService">();
	}
	static class UVelocityService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVelocityService>();
	}
};
static_assert(alignof(UVelocityService) == 0x000008, "Wrong alignment on UVelocityService");
static_assert(sizeof(UVelocityService) == 0x000138, "Wrong size on UVelocityService");
static_assert(offsetof(UVelocityService, Region_detail) == 0x000040, "Member 'UVelocityService::Region_detail' has a wrong offset!");
static_assert(offsetof(UVelocityService, CurSelectRegionData) == 0x0000F8, "Member 'UVelocityService::CurSelectRegionData' has a wrong offset!");

// Class TGFGame.BattlePassRewardService
// 0x0020 (0x0050 - 0x0030)
class UBattlePassRewardService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTGFProtoTgfDUserActivityData*          PassportActivityInfo;                              // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsBattlePassUnlocked();
	void Lua_Initialized();
	void OnActivityCenterListResponse(class UTGFEventArgs* Args);
	void OnActivityCenterUpdate(class UTGFEventArgs* Args);
	void SendBuyPassportReq(int32 InActivityId);
	void SendReceiveCycleRewardsReq(int32 InActivityId, int32 InGradeQty, const TArray<struct FTGFItemOffset>& InRewardItems);
	void SendReceiveRewardsReq(int32 InActivityId, int32 InRewardId, const TArray<struct FTGFItemOffset>& InRewardItems);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassRewardService">();
	}
	static class UBattlePassRewardService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassRewardService>();
	}
};
static_assert(alignof(UBattlePassRewardService) == 0x000008, "Wrong alignment on UBattlePassRewardService");
static_assert(sizeof(UBattlePassRewardService) == 0x000050, "Wrong size on UBattlePassRewardService");
static_assert(offsetof(UBattlePassRewardService, PassportActivityInfo) == 0x000040, "Member 'UBattlePassRewardService::PassportActivityInfo' has a wrong offset!");

// Class TGFGame.BattlePassTaskService
// 0x0018 (0x0048 - 0x0030)
class UBattlePassTaskService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Lua_Initialized();
	void SendRefreshQuestReq(int32 InActivityId, int32 InQuestId);
	void SetDailyTaskToastShowed(bool bShowed);

	bool GetDailyTaskToastShowed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePassTaskService">();
	}
	static class UBattlePassTaskService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassTaskService>();
	}
};
static_assert(alignof(UBattlePassTaskService) == 0x000008, "Wrong alignment on UBattlePassTaskService");
static_assert(sizeof(UBattlePassTaskService) == 0x000048, "Wrong size on UBattlePassTaskService");

// Class TGFGame.UserRoleCacheService
// 0x0330 (0x0360 - 0x0030)
class UUserRoleCacheService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TickUpdateTimerHandle;                             // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         CurrentUpdateHandler;                              // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<int64, struct FPlayerKey>                UpdateHandlerKeyMap;                               // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPlayerKey, struct FUpdateHandlerArray> UpdateHandlerArrayMap;                             // 0x00A0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPlayerKey, struct FUpdateHandlerArray> SubscribeHandlerArrayMap;                          // 0x00F0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x40];                                     // 0x0140(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUserKey, class UUserInfo*>       UserCacheMap;                                      // 0x0180(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<int64, struct FUserUpdateCallback>       UserUpdateCallbackMap;                             // 0x01D0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FRoleKey, class URoleInfo*>       RoleCacheMap;                                      // 0x0220(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<int64, struct FRoleUpdateCallback>       RoleUpdateCallbackMap;                             // 0x0270(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGlobalUserKey, class UGlobalUserInfo*> GlobalUserCacheMap;                                // 0x02C0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<int64, struct FGlobalUserUpdateCallback> GlobalUserUpdateCallbackMap;                       // 0x0310(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	class UGlobalUserInfo* GetGlobalUserInfo(const struct FGlobalUserKey& GlobalUserKey);
	class URoleInfo* GetRoleInfoByKey(const struct FRoleKey& RoleKey, bool bMustValid);
	int64 GetRoleInfoCallbackHandler(const struct FRoleKey& RoleKey, bool bIsSubscribe);
	TMap<struct FRoleKey, class URoleInfo*> GetRoleInfoMapByKeySet(const TSet<struct FRoleKey>& RoleKeySet, bool bMustValid, bool* bOutAllValid);
	int64 GetRoleInfoMapCallbackHandler(const TSet<struct FRoleKey>& RoleKeySet);
	class UUserInfo* GetUserInfoByKey(const struct FUserKey& UserKey, bool bMustValid);
	int64 GetUserInfoCallbackHandler(const struct FUserKey& UserKey, bool bIsSubscribe);
	TMap<struct FUserKey, class UUserInfo*> GetUserInfoMapByKeySet(const TSet<struct FUserKey>& UserKeySet, bool bMustValid, bool* bOutAllValid);
	int64 GetUserInfoMapCallbackHandler(const TSet<struct FUserKey>& UserKeySet);
	void Lua_AppearanceCaptureFinish(int64 RoleGuid, class UObject* AppearanceTexture);
	void Lua_ExecuteUpdateEvent(int64 UpdateHandler);
	void Lua_Initialized();
	void OnAppearanceTextureCaptureFinish(int64 RoleGuid, class UObject* SlateBrush);
	void OnHostPlayerEquipChange(class UTGFEventArgs* Args);
	void OnUpdateItemsNoti(class UTGFEventArgs* Args);
	void RemoveUpdateHandler(int64 UpdateHandler);
	void ResetAllRoleInfo();
	void ResetAllUserInfo();
	void ResetRoleInfoByKey(const struct FRoleKey& RoleKey);
	void ResetUserInfoByKey(const struct FUserKey& UserKey);

	struct FRoleKey GetSelfRoleKey() const;
	struct FUserKey GetSelfUserKey() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UserRoleCacheService">();
	}
	static class UUserRoleCacheService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserRoleCacheService>();
	}
};
static_assert(alignof(UUserRoleCacheService) == 0x000008, "Wrong alignment on UUserRoleCacheService");
static_assert(sizeof(UUserRoleCacheService) == 0x000360, "Wrong size on UUserRoleCacheService");
static_assert(offsetof(UUserRoleCacheService, TickUpdateTimerHandle) == 0x000040, "Member 'UUserRoleCacheService::TickUpdateTimerHandle' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, CurrentUpdateHandler) == 0x000048, "Member 'UUserRoleCacheService::CurrentUpdateHandler' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, UpdateHandlerKeyMap) == 0x000050, "Member 'UUserRoleCacheService::UpdateHandlerKeyMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, UpdateHandlerArrayMap) == 0x0000A0, "Member 'UUserRoleCacheService::UpdateHandlerArrayMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, SubscribeHandlerArrayMap) == 0x0000F0, "Member 'UUserRoleCacheService::SubscribeHandlerArrayMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, UserCacheMap) == 0x000180, "Member 'UUserRoleCacheService::UserCacheMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, UserUpdateCallbackMap) == 0x0001D0, "Member 'UUserRoleCacheService::UserUpdateCallbackMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, RoleCacheMap) == 0x000220, "Member 'UUserRoleCacheService::RoleCacheMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, RoleUpdateCallbackMap) == 0x000270, "Member 'UUserRoleCacheService::RoleUpdateCallbackMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, GlobalUserCacheMap) == 0x0002C0, "Member 'UUserRoleCacheService::GlobalUserCacheMap' has a wrong offset!");
static_assert(offsetof(UUserRoleCacheService, GlobalUserUpdateCallbackMap) == 0x000310, "Member 'UUserRoleCacheService::GlobalUserUpdateCallbackMap' has a wrong offset!");

// Class TGFGame.TGFBattlePassTaskInfo
// 0x0070 (0x0098 - 0x0028)
class UTGFBattlePassTaskInfo final : public UObject
{
public:
	int32                                         ID;                                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ETGFProtoTgfEnQuestProgressType, int64>  MapProgressTypeValue;                              // 0x0030(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	ETGFProtoTgfEnQuestStatus                     Status;                                            // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OrderWeight;                                       // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_TGFBattlePassTaskInfo;                       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DisplayPosition;                                   // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDeadTask;                                        // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddProgressValue(int32 ProgressType, int64 Value);
	void ClearProgressValue();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBattlePassTaskInfo">();
	}
	static class UTGFBattlePassTaskInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBattlePassTaskInfo>();
	}
};
static_assert(alignof(UTGFBattlePassTaskInfo) == 0x000008, "Wrong alignment on UTGFBattlePassTaskInfo");
static_assert(sizeof(UTGFBattlePassTaskInfo) == 0x000098, "Wrong size on UTGFBattlePassTaskInfo");
static_assert(offsetof(UTGFBattlePassTaskInfo, ID) == 0x000028, "Member 'UTGFBattlePassTaskInfo::ID' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskInfo, MapProgressTypeValue) == 0x000030, "Member 'UTGFBattlePassTaskInfo::MapProgressTypeValue' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskInfo, Status) == 0x000080, "Member 'UTGFBattlePassTaskInfo::Status' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskInfo, OrderWeight) == 0x000084, "Member 'UTGFBattlePassTaskInfo::OrderWeight' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskInfo, Index_TGFBattlePassTaskInfo) == 0x000088, "Member 'UTGFBattlePassTaskInfo::Index_TGFBattlePassTaskInfo' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskInfo, DisplayPosition) == 0x00008C, "Member 'UTGFBattlePassTaskInfo::DisplayPosition' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskInfo, IsDeadTask) == 0x000090, "Member 'UTGFBattlePassTaskInfo::IsDeadTask' has a wrong offset!");

// Class TGFGame.TGFBattlePassTaskListItemObject
// 0x0028 (0x0050 - 0x0028)
class UTGFBattlePassTaskListItemObject final : public UObject
{
public:
	ETGFBattlePassTaskType                        Type;                                              // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProgressValue;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETGFProtoTgfEnQuestStatus                     Status;                                            // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RefreshLimit;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         NextResetTimestamp;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_TGFBattlePassTaskListItemObject;             // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TGFBattlePassTaskListItemObject">();
	}
	static class UTGFBattlePassTaskListItemObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGFBattlePassTaskListItemObject>();
	}
};
static_assert(alignof(UTGFBattlePassTaskListItemObject) == 0x000008, "Wrong alignment on UTGFBattlePassTaskListItemObject");
static_assert(sizeof(UTGFBattlePassTaskListItemObject) == 0x000050, "Wrong size on UTGFBattlePassTaskListItemObject");
static_assert(offsetof(UTGFBattlePassTaskListItemObject, Type) == 0x000028, "Member 'UTGFBattlePassTaskListItemObject::Type' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskListItemObject, ID) == 0x00002C, "Member 'UTGFBattlePassTaskListItemObject::ID' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskListItemObject, ProgressValue) == 0x000030, "Member 'UTGFBattlePassTaskListItemObject::ProgressValue' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskListItemObject, Status) == 0x000034, "Member 'UTGFBattlePassTaskListItemObject::Status' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskListItemObject, RefreshLimit) == 0x000038, "Member 'UTGFBattlePassTaskListItemObject::RefreshLimit' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskListItemObject, NextResetTimestamp) == 0x000040, "Member 'UTGFBattlePassTaskListItemObject::NextResetTimestamp' has a wrong offset!");
static_assert(offsetof(UTGFBattlePassTaskListItemObject, Index_TGFBattlePassTaskListItemObject) == 0x000048, "Member 'UTGFBattlePassTaskListItemObject::Index_TGFBattlePassTaskListItemObject' has a wrong offset!");

// Class TGFGame.UnlockBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UUnlockBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FText GetModuleBannedMessage(int32 ModuleId);
	static class FText GetModuleCircularNextTimeMessage(int32 ModuleId);
	static class FText GetModuleGlobalForbidMessage(int32 ModuleId);
	static class FText GetModuleLockMessage(int32 ModuleId);
	static class FText GetModuleNextTimeMessage(int32 ModuleId);
	static class FText GetModuleTimeLockMessage(int32 ModuleId);
	static bool IsModuleAllowed(int32 ModuleId, bool bIsAlert, bool bIsToast);
	static bool IsModuleBanned(int32 ModuleId, bool bIsAlert, bool bIsToast);
	static bool IsModuleGlobalForbid(int32 ModuleId, bool bIsAlert, bool bIsToast);
	static bool IsModuleLock(int32 ModuleId, bool bIsAlert, bool bIsToast);
	static bool IsModuleTimeLock(int32 ModuleId, bool bIsAlert, bool bIsToast);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UnlockBlueprintLibrary">();
	}
	static class UUnlockBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnlockBlueprintLibrary>();
	}
};
static_assert(alignof(UUnlockBlueprintLibrary) == 0x000008, "Wrong alignment on UUnlockBlueprintLibrary");
static_assert(sizeof(UUnlockBlueprintLibrary) == 0x000028, "Wrong size on UUnlockBlueprintLibrary");

// Class TGFGame.MoonPhaseChangeEvent
// 0x0008 (0x0030 - 0x0028)
class UMoonPhaseChangeEvent final : public UTGFEventArgs
{
public:
	int32                                         Phase;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoonPhaseChangeEvent">();
	}
	static class UMoonPhaseChangeEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoonPhaseChangeEvent>();
	}
};
static_assert(alignof(UMoonPhaseChangeEvent) == 0x000008, "Wrong alignment on UMoonPhaseChangeEvent");
static_assert(sizeof(UMoonPhaseChangeEvent) == 0x000030, "Wrong size on UMoonPhaseChangeEvent");
static_assert(offsetof(UMoonPhaseChangeEvent, Phase) == 0x000028, "Member 'UMoonPhaseChangeEvent::Phase' has a wrong offset!");

// Class TGFGame.BattleService
// 0x0030 (0x0060 - 0x0030)
class UBattleService final : public UTGFService
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           MoonPhaseTimer;                                    // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
