#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGFGame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LyraGame_structs.hpp"
#include "TGFGame_structs.hpp"
#include "InputCore_structs.hpp"
#include "TGFBattleProtocol_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Niagara_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TGFGame.ACEReportService.Lua_ACEReportPlayerInBattle
// 0x0028 (0x0028 - 0x0000)
struct ACEReportService_Lua_ACEReportPlayerInBattle final
{
public:
	int64                                         TargetOpenId;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetZoneId;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetPlayerName;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      SourcePC;                                          // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ACEReportService_Lua_ACEReportPlayerInBattle) == 0x000008, "Wrong alignment on ACEReportService_Lua_ACEReportPlayerInBattle");
static_assert(sizeof(ACEReportService_Lua_ACEReportPlayerInBattle) == 0x000028, "Wrong size on ACEReportService_Lua_ACEReportPlayerInBattle");
static_assert(offsetof(ACEReportService_Lua_ACEReportPlayerInBattle, TargetOpenId) == 0x000000, "Member 'ACEReportService_Lua_ACEReportPlayerInBattle::TargetOpenId' has a wrong offset!");
static_assert(offsetof(ACEReportService_Lua_ACEReportPlayerInBattle, TargetZoneId) == 0x000008, "Member 'ACEReportService_Lua_ACEReportPlayerInBattle::TargetZoneId' has a wrong offset!");
static_assert(offsetof(ACEReportService_Lua_ACEReportPlayerInBattle, TargetPlayerName) == 0x000010, "Member 'ACEReportService_Lua_ACEReportPlayerInBattle::TargetPlayerName' has a wrong offset!");
static_assert(offsetof(ACEReportService_Lua_ACEReportPlayerInBattle, SourcePC) == 0x000020, "Member 'ACEReportService_Lua_ACEReportPlayerInBattle::SourcePC' has a wrong offset!");

// Function TGFGame.ACEReportService.SendACEReportRequest
// 0x0008 (0x0008 - 0x0000)
struct ACEReportService_SendACEReportRequest final
{
public:
	class UTGFProtoTgfCSReportActionReqReportBodyPublic* Body;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ACEReportService_SendACEReportRequest) == 0x000008, "Wrong alignment on ACEReportService_SendACEReportRequest");
static_assert(sizeof(ACEReportService_SendACEReportRequest) == 0x000008, "Wrong size on ACEReportService_SendACEReportRequest");
static_assert(offsetof(ACEReportService_SendACEReportRequest, Body) == 0x000000, "Member 'ACEReportService_SendACEReportRequest::Body' has a wrong offset!");

// Function TGFGame.ACEService.OnGameLoginSuccess
// 0x0008 (0x0008 - 0x0000)
struct ACEService_OnGameLoginSuccess final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ACEService_OnGameLoginSuccess) == 0x000008, "Wrong alignment on ACEService_OnGameLoginSuccess");
static_assert(sizeof(ACEService_OnGameLoginSuccess) == 0x000008, "Wrong size on ACEService_OnGameLoginSuccess");
static_assert(offsetof(ACEService_OnGameLoginSuccess, Args) == 0x000000, "Member 'ACEService_OnGameLoginSuccess::Args' has a wrong offset!");

// Function TGFGame.ACEService.OnGameLogout
// 0x0008 (0x0008 - 0x0000)
struct ACEService_OnGameLogout final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ACEService_OnGameLogout) == 0x000008, "Wrong alignment on ACEService_OnGameLogout");
static_assert(sizeof(ACEService_OnGameLogout) == 0x000008, "Wrong size on ACEService_OnGameLogout");
static_assert(offsetof(ACEService_OnGameLogout, Args) == 0x000000, "Member 'ACEService_OnGameLogout::Args' has a wrong offset!");

// Function TGFGame.ACEService.OnNetworkManagerEnterState
// 0x0008 (0x0008 - 0x0000)
struct ACEService_OnNetworkManagerEnterState final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ACEService_OnNetworkManagerEnterState) == 0x000008, "Wrong alignment on ACEService_OnNetworkManagerEnterState");
static_assert(sizeof(ACEService_OnNetworkManagerEnterState) == 0x000008, "Wrong size on ACEService_OnNetworkManagerEnterState");
static_assert(offsetof(ACEService_OnNetworkManagerEnterState, Args) == 0x000000, "Member 'ACEService_OnNetworkManagerEnterState::Args' has a wrong offset!");

// Function TGFGame.ACEService.OnNetworkManagerExitState
// 0x0008 (0x0008 - 0x0000)
struct ACEService_OnNetworkManagerExitState final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ACEService_OnNetworkManagerExitState) == 0x000008, "Wrong alignment on ACEService_OnNetworkManagerExitState");
static_assert(sizeof(ACEService_OnNetworkManagerExitState) == 0x000008, "Wrong size on ACEService_OnNetworkManagerExitState");
static_assert(offsetof(ACEService_OnNetworkManagerExitState, Args) == 0x000000, "Member 'ACEService_OnNetworkManagerExitState::Args' has a wrong offset!");

// Function TGFGame.ActivityCenterService.GetActivityCenterData
// 0x0008 (0x0008 - 0x0000)
struct ActivityCenterService_GetActivityCenterData final
{
public:
	class UTGFProtoTgfDUserActivityDataList*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActivityCenterService_GetActivityCenterData) == 0x000008, "Wrong alignment on ActivityCenterService_GetActivityCenterData");
static_assert(sizeof(ActivityCenterService_GetActivityCenterData) == 0x000008, "Wrong size on ActivityCenterService_GetActivityCenterData");
static_assert(offsetof(ActivityCenterService_GetActivityCenterData, ReturnValue) == 0x000000, "Member 'ActivityCenterService_GetActivityCenterData::ReturnValue' has a wrong offset!");

// Function TGFGame.ActivityCenterService.IsActivityListEmpty
// 0x0001 (0x0001 - 0x0000)
struct ActivityCenterService_IsActivityListEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActivityCenterService_IsActivityListEmpty) == 0x000001, "Wrong alignment on ActivityCenterService_IsActivityListEmpty");
static_assert(sizeof(ActivityCenterService_IsActivityListEmpty) == 0x000001, "Wrong size on ActivityCenterService_IsActivityListEmpty");
static_assert(offsetof(ActivityCenterService_IsActivityListEmpty, ReturnValue) == 0x000000, "Member 'ActivityCenterService_IsActivityListEmpty::ReturnValue' has a wrong offset!");

// Function TGFGame.ActivityRewardService.GetActivityRandomReward
// 0x0004 (0x0004 - 0x0000)
struct ActivityRewardService_GetActivityRandomReward final
{
public:
	int32                                         ActivityId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActivityRewardService_GetActivityRandomReward) == 0x000004, "Wrong alignment on ActivityRewardService_GetActivityRandomReward");
static_assert(sizeof(ActivityRewardService_GetActivityRandomReward) == 0x000004, "Wrong size on ActivityRewardService_GetActivityRandomReward");
static_assert(offsetof(ActivityRewardService_GetActivityRandomReward, ActivityId) == 0x000000, "Member 'ActivityRewardService_GetActivityRandomReward::ActivityId' has a wrong offset!");

// Function TGFGame.AppService.ChangeHallState
// 0x0001 (0x0001 - 0x0000)
struct AppService_ChangeHallState final
{
public:
	EHallState                                    InHallState;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_ChangeHallState) == 0x000001, "Wrong alignment on AppService_ChangeHallState");
static_assert(sizeof(AppService_ChangeHallState) == 0x000001, "Wrong size on AppService_ChangeHallState");
static_assert(offsetof(AppService_ChangeHallState, InHallState) == 0x000000, "Member 'AppService_ChangeHallState::InHallState' has a wrong offset!");

// Function TGFGame.AppService.GetWardrobeAvatarFromPool
// 0x0008 (0x0008 - 0x0000)
struct AppService_GetWardrobeAvatarFromPool final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_GetWardrobeAvatarFromPool) == 0x000008, "Wrong alignment on AppService_GetWardrobeAvatarFromPool");
static_assert(sizeof(AppService_GetWardrobeAvatarFromPool) == 0x000008, "Wrong size on AppService_GetWardrobeAvatarFromPool");
static_assert(offsetof(AppService_GetWardrobeAvatarFromPool, ReturnValue) == 0x000000, "Member 'AppService_GetWardrobeAvatarFromPool::ReturnValue' has a wrong offset!");

// Function TGFGame.AppService.OnNetworkManagerEnterState
// 0x0008 (0x0008 - 0x0000)
struct AppService_OnNetworkManagerEnterState final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_OnNetworkManagerEnterState) == 0x000008, "Wrong alignment on AppService_OnNetworkManagerEnterState");
static_assert(sizeof(AppService_OnNetworkManagerEnterState) == 0x000008, "Wrong size on AppService_OnNetworkManagerEnterState");
static_assert(offsetof(AppService_OnNetworkManagerEnterState, Args) == 0x000000, "Member 'AppService_OnNetworkManagerEnterState::Args' has a wrong offset!");

// Function TGFGame.AppService.OpenWindow
// 0x0028 (0x0028 - 0x0000)
struct AppService_OpenWindow final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTGFWindowArgs*                         Args;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUnique;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ReturnValue;                                       // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_OpenWindow) == 0x000008, "Wrong alignment on AppService_OpenWindow");
static_assert(sizeof(AppService_OpenWindow) == 0x000028, "Wrong size on AppService_OpenWindow");
static_assert(offsetof(AppService_OpenWindow, Path) == 0x000000, "Member 'AppService_OpenWindow::Path' has a wrong offset!");
static_assert(offsetof(AppService_OpenWindow, Args) == 0x000010, "Member 'AppService_OpenWindow::Args' has a wrong offset!");
static_assert(offsetof(AppService_OpenWindow, bIsUnique) == 0x000018, "Member 'AppService_OpenWindow::bIsUnique' has a wrong offset!");
static_assert(offsetof(AppService_OpenWindow, ReturnValue) == 0x000020, "Member 'AppService_OpenWindow::ReturnValue' has a wrong offset!");

// Function TGFGame.AppService.RecycleWardrobeAvatar
// 0x0008 (0x0008 - 0x0000)
struct AppService_RecycleWardrobeAvatar final
{
public:
	class AActor*                                 InRecycleActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_RecycleWardrobeAvatar) == 0x000008, "Wrong alignment on AppService_RecycleWardrobeAvatar");
static_assert(sizeof(AppService_RecycleWardrobeAvatar) == 0x000008, "Wrong size on AppService_RecycleWardrobeAvatar");
static_assert(offsetof(AppService_RecycleWardrobeAvatar, InRecycleActor) == 0x000000, "Member 'AppService_RecycleWardrobeAvatar::InRecycleActor' has a wrong offset!");

// Function TGFGame.AppService.SetCreateRoleLevelVisible
// 0x0001 (0x0001 - 0x0000)
struct AppService_SetCreateRoleLevelVisible final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_SetCreateRoleLevelVisible) == 0x000001, "Wrong alignment on AppService_SetCreateRoleLevelVisible");
static_assert(sizeof(AppService_SetCreateRoleLevelVisible) == 0x000001, "Wrong size on AppService_SetCreateRoleLevelVisible");
static_assert(offsetof(AppService_SetCreateRoleLevelVisible, bValue) == 0x000000, "Member 'AppService_SetCreateRoleLevelVisible::bValue' has a wrong offset!");

// Function TGFGame.AppService.SetWardrobeLevelVisible
// 0x0001 (0x0001 - 0x0000)
struct AppService_SetWardrobeLevelVisible final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_SetWardrobeLevelVisible) == 0x000001, "Wrong alignment on AppService_SetWardrobeLevelVisible");
static_assert(sizeof(AppService_SetWardrobeLevelVisible) == 0x000001, "Wrong size on AppService_SetWardrobeLevelVisible");
static_assert(offsetof(AppService_SetWardrobeLevelVisible, bValue) == 0x000000, "Member 'AppService_SetWardrobeLevelVisible::bValue' has a wrong offset!");

// Function TGFGame.AppService.ShouldShutDownHallGlobalEffects
// 0x0001 (0x0001 - 0x0000)
struct AppService_ShouldShutDownHallGlobalEffects final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_ShouldShutDownHallGlobalEffects) == 0x000001, "Wrong alignment on AppService_ShouldShutDownHallGlobalEffects");
static_assert(sizeof(AppService_ShouldShutDownHallGlobalEffects) == 0x000001, "Wrong size on AppService_ShouldShutDownHallGlobalEffects");
static_assert(offsetof(AppService_ShouldShutDownHallGlobalEffects, bIsOpen) == 0x000000, "Member 'AppService_ShouldShutDownHallGlobalEffects::bIsOpen' has a wrong offset!");

// Function TGFGame.AppService.SpawnActorToWardrobeLevel
// 0x0040 (0x0040 - 0x0000)
struct AppService_SpawnActorToWardrobeLevel final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_SpawnActorToWardrobeLevel) == 0x000008, "Wrong alignment on AppService_SpawnActorToWardrobeLevel");
static_assert(sizeof(AppService_SpawnActorToWardrobeLevel) == 0x000040, "Wrong size on AppService_SpawnActorToWardrobeLevel");
static_assert(offsetof(AppService_SpawnActorToWardrobeLevel, Param_Class) == 0x000000, "Member 'AppService_SpawnActorToWardrobeLevel::Param_Class' has a wrong offset!");
static_assert(offsetof(AppService_SpawnActorToWardrobeLevel, Location) == 0x000008, "Member 'AppService_SpawnActorToWardrobeLevel::Location' has a wrong offset!");
static_assert(offsetof(AppService_SpawnActorToWardrobeLevel, Rotation) == 0x000020, "Member 'AppService_SpawnActorToWardrobeLevel::Rotation' has a wrong offset!");
static_assert(offsetof(AppService_SpawnActorToWardrobeLevel, ReturnValue) == 0x000038, "Member 'AppService_SpawnActorToWardrobeLevel::ReturnValue' has a wrong offset!");

// Function TGFGame.AppService.ToggleCurrentLevelCompRegistration
// 0x0001 (0x0001 - 0x0000)
struct AppService_ToggleCurrentLevelCompRegistration final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_ToggleCurrentLevelCompRegistration) == 0x000001, "Wrong alignment on AppService_ToggleCurrentLevelCompRegistration");
static_assert(sizeof(AppService_ToggleCurrentLevelCompRegistration) == 0x000001, "Wrong size on AppService_ToggleCurrentLevelCompRegistration");
static_assert(offsetof(AppService_ToggleCurrentLevelCompRegistration, bValue) == 0x000000, "Member 'AppService_ToggleCurrentLevelCompRegistration::bValue' has a wrong offset!");

// Function TGFGame.AppService.ToggleOptimizationForSceneCapture
// 0x0001 (0x0001 - 0x0000)
struct AppService_ToggleOptimizationForSceneCapture final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_ToggleOptimizationForSceneCapture) == 0x000001, "Wrong alignment on AppService_ToggleOptimizationForSceneCapture");
static_assert(sizeof(AppService_ToggleOptimizationForSceneCapture) == 0x000001, "Wrong size on AppService_ToggleOptimizationForSceneCapture");
static_assert(offsetof(AppService_ToggleOptimizationForSceneCapture, bIsOpen) == 0x000000, "Member 'AppService_ToggleOptimizationForSceneCapture::bIsOpen' has a wrong offset!");

// Function TGFGame.AppService.CheckAboutToQuit
// 0x0001 (0x0001 - 0x0000)
struct AppService_CheckAboutToQuit final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_CheckAboutToQuit) == 0x000001, "Wrong alignment on AppService_CheckAboutToQuit");
static_assert(sizeof(AppService_CheckAboutToQuit) == 0x000001, "Wrong size on AppService_CheckAboutToQuit");
static_assert(offsetof(AppService_CheckAboutToQuit, ReturnValue) == 0x000000, "Member 'AppService_CheckAboutToQuit::ReturnValue' has a wrong offset!");

// Function TGFGame.AppService.GetAppState
// 0x0001 (0x0001 - 0x0000)
struct AppService_GetAppState final
{
public:
	EAppState                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_GetAppState) == 0x000001, "Wrong alignment on AppService_GetAppState");
static_assert(sizeof(AppService_GetAppState) == 0x000001, "Wrong size on AppService_GetAppState");
static_assert(offsetof(AppService_GetAppState, ReturnValue) == 0x000000, "Member 'AppService_GetAppState::ReturnValue' has a wrong offset!");

// Function TGFGame.AppService.GetHallState
// 0x0001 (0x0001 - 0x0000)
struct AppService_GetHallState final
{
public:
	EHallState                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppService_GetHallState) == 0x000001, "Wrong alignment on AppService_GetHallState");
static_assert(sizeof(AppService_GetHallState) == 0x000001, "Wrong size on AppService_GetHallState");
static_assert(offsetof(AppService_GetHallState, ReturnValue) == 0x000000, "Member 'AppService_GetHallState::ReturnValue' has a wrong offset!");

// Function TGFGame.TGFNetworkManager.OnGameLoginFailed
// 0x0008 (0x0008 - 0x0000)
struct TGFNetworkManager_OnGameLoginFailed final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGFNetworkManager_OnGameLoginFailed) == 0x000008, "Wrong alignment on TGFNetworkManager_OnGameLoginFailed");
static_assert(sizeof(TGFNetworkManager_OnGameLoginFailed) == 0x000008, "Wrong size on TGFNetworkManager_OnGameLoginFailed");
static_assert(offsetof(TGFNetworkManager_OnGameLoginFailed, Args) == 0x000000, "Member 'TGFNetworkManager_OnGameLoginFailed::Args' has a wrong offset!");

// Function TGFGame.TGFNetworkManager.OnGameLoginSuccess
// 0x0008 (0x0008 - 0x0000)
struct TGFNetworkManager_OnGameLoginSuccess final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGFNetworkManager_OnGameLoginSuccess) == 0x000008, "Wrong alignment on TGFNetworkManager_OnGameLoginSuccess");
static_assert(sizeof(TGFNetworkManager_OnGameLoginSuccess) == 0x000008, "Wrong size on TGFNetworkManager_OnGameLoginSuccess");
static_assert(offsetof(TGFNetworkManager_OnGameLoginSuccess, Args) == 0x000000, "Member 'TGFNetworkManager_OnGameLoginSuccess::Args' has a wrong offset!");

// Function TGFGame.TGFNetworkManager.OnGameLogout
// 0x0008 (0x0008 - 0x0000)
struct TGFNetworkManager_OnGameLogout final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGFNetworkManager_OnGameLogout) == 0x000008, "Wrong alignment on TGFNetworkManager_OnGameLogout");
static_assert(sizeof(TGFNetworkManager_OnGameLogout) == 0x000008, "Wrong size on TGFNetworkManager_OnGameLogout");
static_assert(offsetof(TGFNetworkManager_OnGameLogout, Args) == 0x000000, "Member 'TGFNetworkManager_OnGameLogout::Args' has a wrong offset!");

// Function TGFGame.TGFNetworkManager.OnGamePreLoginFailed
// 0x0008 (0x0008 - 0x0000)
struct TGFNetworkManager_OnGamePreLoginFailed final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGFNetworkManager_OnGamePreLoginFailed) == 0x000008, "Wrong alignment on TGFNetworkManager_OnGamePreLoginFailed");
static_assert(sizeof(TGFNetworkManager_OnGamePreLoginFailed) == 0x000008, "Wrong size on TGFNetworkManager_OnGamePreLoginFailed");
static_assert(offsetof(TGFNetworkManager_OnGamePreLoginFailed, Args) == 0x000000, "Member 'TGFNetworkManager_OnGamePreLoginFailed::Args' has a wrong offset!");

// Function TGFGame.TGFNetworkManager.OnGamePreLoginSuccess
// 0x0008 (0x0008 - 0x0000)
struct TGFNetworkManager_OnGamePreLoginSuccess final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGFNetworkManager_OnGamePreLoginSuccess) == 0x000008, "Wrong alignment on TGFNetworkManager_OnGamePreLoginSuccess");
static_assert(sizeof(TGFNetworkManager_OnGamePreLoginSuccess) == 0x000008, "Wrong size on TGFNetworkManager_OnGamePreLoginSuccess");
static_assert(offsetof(TGFNetworkManager_OnGamePreLoginSuccess, Args) == 0x000000, "Member 'TGFNetworkManager_OnGamePreLoginSuccess::Args' has a wrong offset!");

// Function TGFGame.TGFNetworkManager.OnSyncPlayerInfoSuccess
// 0x0008 (0x0008 - 0x0000)
struct TGFNetworkManager_OnSyncPlayerInfoSuccess final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TGFNetworkManager_OnSyncPlayerInfoSuccess) == 0x000008, "Wrong alignment on TGFNetworkManager_OnSyncPlayerInfoSuccess");
static_assert(sizeof(TGFNetworkManager_OnSyncPlayerInfoSuccess) == 0x000008, "Wrong size on TGFNetworkManager_OnSyncPlayerInfoSuccess");
static_assert(offsetof(TGFNetworkManager_OnSyncPlayerInfoSuccess, Args) == 0x000000, "Member 'TGFNetworkManager_OnSyncPlayerInfoSuccess::Args' has a wrong offset!");

// Function TGFGame.AsyncAction_ShowAlert.ShowAlert
// 0x0040 (0x0040 - 0x0000)
struct AsyncAction_ShowAlert_ShowAlert final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   ConfirmText;                                       // 0x0020(0x0018)(Parm, NativeAccessSpecifierPublic)
	class UAsyncAction_ShowAlert*                 ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_ShowAlert_ShowAlert) == 0x000008, "Wrong alignment on AsyncAction_ShowAlert_ShowAlert");
static_assert(sizeof(AsyncAction_ShowAlert_ShowAlert) == 0x000040, "Wrong size on AsyncAction_ShowAlert_ShowAlert");
static_assert(offsetof(AsyncAction_ShowAlert_ShowAlert, InWorldContextObject) == 0x000000, "Member 'AsyncAction_ShowAlert_ShowAlert::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowAlert_ShowAlert, Message) == 0x000008, "Member 'AsyncAction_ShowAlert_ShowAlert::Message' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowAlert_ShowAlert, ConfirmText) == 0x000020, "Member 'AsyncAction_ShowAlert_ShowAlert::ConfirmText' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowAlert_ShowAlert, ReturnValue) == 0x000038, "Member 'AsyncAction_ShowAlert_ShowAlert::ReturnValue' has a wrong offset!");

// Function TGFGame.AsyncAction_ShowConfirm.ShowConfirm
// 0x0060 (0x0060 - 0x0000)
struct AsyncAction_ShowConfirm_ShowConfirm final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   ConfirmText;                                       // 0x0020(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   CancelText;                                        // 0x0038(0x0018)(Parm, NativeAccessSpecifierPublic)
	class UObject*                                Context;                                           // 0x0050(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_ShowConfirm*               ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_ShowConfirm_ShowConfirm) == 0x000008, "Wrong alignment on AsyncAction_ShowConfirm_ShowConfirm");
static_assert(sizeof(AsyncAction_ShowConfirm_ShowConfirm) == 0x000060, "Wrong size on AsyncAction_ShowConfirm_ShowConfirm");
static_assert(offsetof(AsyncAction_ShowConfirm_ShowConfirm, InWorldContextObject) == 0x000000, "Member 'AsyncAction_ShowConfirm_ShowConfirm::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowConfirm_ShowConfirm, Message) == 0x000008, "Member 'AsyncAction_ShowConfirm_ShowConfirm::Message' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowConfirm_ShowConfirm, ConfirmText) == 0x000020, "Member 'AsyncAction_ShowConfirm_ShowConfirm::ConfirmText' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowConfirm_ShowConfirm, CancelText) == 0x000038, "Member 'AsyncAction_ShowConfirm_ShowConfirm::CancelText' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowConfirm_ShowConfirm, Context) == 0x000050, "Member 'AsyncAction_ShowConfirm_ShowConfirm::Context' has a wrong offset!");
static_assert(offsetof(AsyncAction_ShowConfirm_ShowConfirm, ReturnValue) == 0x000058, "Member 'AsyncAction_ShowConfirm_ShowConfirm::ReturnValue' has a wrong offset!");

// Function TGFGame.BannerSubsystem.GetBannerConfigList
// 0x0018 (0x0018 - 0x0000)
struct BannerSubsystem_GetBannerConfigList final
{
public:
	TArray<struct FBannerConfig>                  BannerConfigList;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BannerSubsystem_GetBannerConfigList) == 0x000008, "Wrong alignment on BannerSubsystem_GetBannerConfigList");
static_assert(sizeof(BannerSubsystem_GetBannerConfigList) == 0x000018, "Wrong size on BannerSubsystem_GetBannerConfigList");
static_assert(offsetof(BannerSubsystem_GetBannerConfigList, BannerConfigList) == 0x000000, "Member 'BannerSubsystem_GetBannerConfigList::BannerConfigList' has a wrong offset!");
static_assert(offsetof(BannerSubsystem_GetBannerConfigList, ReturnValue) == 0x000010, "Member 'BannerSubsystem_GetBannerConfigList::ReturnValue' has a wrong offset!");

// Function TGFGame.TradeSaleService.GetSaleableItems
// 0x0030 (0x0030 - 0x0000)
struct TradeSaleService_GetSaleableItems final
{
public:
	int32                                         MarketId;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETGFProtoTgfEnGearEquipSubType>        Types;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	ETGFProtoTgfEnItemRarity                      Rarity;                                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SortByPriceUp;                                     // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTradeSaleItem*>                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TradeSaleService_GetSaleableItems) == 0x000008, "Wrong alignment on TradeSaleService_GetSaleableItems");
static_assert(sizeof(TradeSaleService_GetSaleableItems) == 0x000030, "Wrong size on TradeSaleService_GetSaleableItems");
static_assert(offsetof(TradeSaleService_GetSaleableItems, MarketId) == 0x000000, "Member 'TradeSaleService_GetSaleableItems::MarketId' has a wrong offset!");
static_assert(offsetof(TradeSaleService_GetSaleableItems, Types) == 0x000008, "Member 'TradeSaleService_GetSaleableItems::Types' has a wrong offset!");
static_assert(offsetof(TradeSaleService_GetSaleableItems, Rarity) == 0x000018, "Member 'TradeSaleService_GetSaleableItems::Rarity' has a wrong offset!");
static_assert(offsetof(TradeSaleService_GetSaleableItems, SortByPriceUp) == 0x000019, "Member 'TradeSaleService_GetSaleableItems::SortByPriceUp' has a wrong offset!");
static_assert(offsetof(TradeSaleService_GetSaleableItems, ReturnValue) == 0x000020, "Member 'TradeSaleService_GetSaleableItems::ReturnValue' has a wrong offset!");

// Function TGFGame.TradeSaleService.OnGameLogout
// 0x0008 (0x0008 - 0x0000)
struct TradeSaleService_OnGameLogout final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TradeSaleService_OnGameLogout) == 0x000008, "Wrong alignment on TradeSaleService_OnGameLogout");
static_assert(sizeof(TradeSaleService_OnGameLogout) == 0x000008, "Wrong size on TradeSaleService_OnGameLogout");
static_assert(offsetof(TradeSaleService_OnGameLogout, Args) == 0x000000, "Member 'TradeSaleService_OnGameLogout::Args' has a wrong offset!");

// Function TGFGame.TradeSaleService.PublishAuctionOrder
// 0x0070 (0x0070 - 0x0000)
struct TradeSaleService_PublishAuctionOrder final
{
public:
	int32                                         MarketId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTGFItem                               SaleItem;                                          // 0x0008(0x0058)(Parm, NativeAccessSpecifierPublic)
	int32                                         Price;                                             // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CostType;                                          // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FixedPrice;                                        // 0x0068(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TradeSaleService_PublishAuctionOrder) == 0x000008, "Wrong alignment on TradeSaleService_PublishAuctionOrder");
static_assert(sizeof(TradeSaleService_PublishAuctionOrder) == 0x000070, "Wrong size on TradeSaleService_PublishAuctionOrder");
static_assert(offsetof(TradeSaleService_PublishAuctionOrder, MarketId) == 0x000000, "Member 'TradeSaleService_PublishAuctionOrder::MarketId' has a wrong offset!");
static_assert(offsetof(TradeSaleService_PublishAuctionOrder, SaleItem) == 0x000008, "Member 'TradeSaleService_PublishAuctionOrder::SaleItem' has a wrong offset!");
static_assert(offsetof(TradeSaleService_PublishAuctionOrder, Price) == 0x000060, "Member 'TradeSaleService_PublishAuctionOrder::Price' has a wrong offset!");
static_assert(offsetof(TradeSaleService_PublishAuctionOrder, CostType) == 0x000064, "Member 'TradeSaleService_PublishAuctionOrder::CostType' has a wrong offset!");
static_assert(offsetof(TradeSaleService_PublishAuctionOrder, FixedPrice) == 0x000068, "Member 'TradeSaleService_PublishAuctionOrder::FixedPrice' has a wrong offset!");

// Function TGFGame.UnlockService.GetModuleBannedMessage
// 0x0020 (0x0020 - 0x0000)
struct UnlockService_GetModuleBannedMessage final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnlockService_GetModuleBannedMessage) == 0x000008, "Wrong alignment on UnlockService_GetModuleBannedMessage");
static_assert(sizeof(UnlockService_GetModuleBannedMessage) == 0x000020, "Wrong size on UnlockService_GetModuleBannedMessage");
static_assert(offsetof(UnlockService_GetModuleBannedMessage, InModuleId) == 0x000000, "Member 'UnlockService_GetModuleBannedMessage::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_GetModuleBannedMessage, ReturnValue) == 0x000008, "Member 'UnlockService_GetModuleBannedMessage::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.GetModuleCircularLockMessage
// 0x0020 (0x0020 - 0x0000)
struct UnlockService_GetModuleCircularLockMessage final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnlockService_GetModuleCircularLockMessage) == 0x000008, "Wrong alignment on UnlockService_GetModuleCircularLockMessage");
static_assert(sizeof(UnlockService_GetModuleCircularLockMessage) == 0x000020, "Wrong size on UnlockService_GetModuleCircularLockMessage");
static_assert(offsetof(UnlockService_GetModuleCircularLockMessage, InModuleId) == 0x000000, "Member 'UnlockService_GetModuleCircularLockMessage::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_GetModuleCircularLockMessage, ReturnValue) == 0x000008, "Member 'UnlockService_GetModuleCircularLockMessage::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.GetModuleCircularNextTimeMessage
// 0x0020 (0x0020 - 0x0000)
struct UnlockService_GetModuleCircularNextTimeMessage final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnlockService_GetModuleCircularNextTimeMessage) == 0x000008, "Wrong alignment on UnlockService_GetModuleCircularNextTimeMessage");
static_assert(sizeof(UnlockService_GetModuleCircularNextTimeMessage) == 0x000020, "Wrong size on UnlockService_GetModuleCircularNextTimeMessage");
static_assert(offsetof(UnlockService_GetModuleCircularNextTimeMessage, InModuleId) == 0x000000, "Member 'UnlockService_GetModuleCircularNextTimeMessage::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_GetModuleCircularNextTimeMessage, ReturnValue) == 0x000008, "Member 'UnlockService_GetModuleCircularNextTimeMessage::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.GetModuleGlobalForbidMessage
// 0x0020 (0x0020 - 0x0000)
struct UnlockService_GetModuleGlobalForbidMessage final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnlockService_GetModuleGlobalForbidMessage) == 0x000008, "Wrong alignment on UnlockService_GetModuleGlobalForbidMessage");
static_assert(sizeof(UnlockService_GetModuleGlobalForbidMessage) == 0x000020, "Wrong size on UnlockService_GetModuleGlobalForbidMessage");
static_assert(offsetof(UnlockService_GetModuleGlobalForbidMessage, InModuleId) == 0x000000, "Member 'UnlockService_GetModuleGlobalForbidMessage::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_GetModuleGlobalForbidMessage, ReturnValue) == 0x000008, "Member 'UnlockService_GetModuleGlobalForbidMessage::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.GetModuleLockMessage
// 0x0020 (0x0020 - 0x0000)
struct UnlockService_GetModuleLockMessage final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnlockService_GetModuleLockMessage) == 0x000008, "Wrong alignment on UnlockService_GetModuleLockMessage");
static_assert(sizeof(UnlockService_GetModuleLockMessage) == 0x000020, "Wrong size on UnlockService_GetModuleLockMessage");
static_assert(offsetof(UnlockService_GetModuleLockMessage, InModuleId) == 0x000000, "Member 'UnlockService_GetModuleLockMessage::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_GetModuleLockMessage, ReturnValue) == 0x000008, "Member 'UnlockService_GetModuleLockMessage::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.GetModuleNextTimeMessage
// 0x0020 (0x0020 - 0x0000)
struct UnlockService_GetModuleNextTimeMessage final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnlockService_GetModuleNextTimeMessage) == 0x000008, "Wrong alignment on UnlockService_GetModuleNextTimeMessage");
static_assert(sizeof(UnlockService_GetModuleNextTimeMessage) == 0x000020, "Wrong size on UnlockService_GetModuleNextTimeMessage");
static_assert(offsetof(UnlockService_GetModuleNextTimeMessage, InModuleId) == 0x000000, "Member 'UnlockService_GetModuleNextTimeMessage::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_GetModuleNextTimeMessage, ReturnValue) == 0x000008, "Member 'UnlockService_GetModuleNextTimeMessage::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.GetModuleTimeLockMessage
// 0x0020 (0x0020 - 0x0000)
struct UnlockService_GetModuleTimeLockMessage final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnlockService_GetModuleTimeLockMessage) == 0x000008, "Wrong alignment on UnlockService_GetModuleTimeLockMessage");
static_assert(sizeof(UnlockService_GetModuleTimeLockMessage) == 0x000020, "Wrong size on UnlockService_GetModuleTimeLockMessage");
static_assert(offsetof(UnlockService_GetModuleTimeLockMessage, InModuleId) == 0x000000, "Member 'UnlockService_GetModuleTimeLockMessage::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_GetModuleTimeLockMessage, ReturnValue) == 0x000008, "Member 'UnlockService_GetModuleTimeLockMessage::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.IsModuleAllowed
// 0x0008 (0x0008 - 0x0000)
struct UnlockService_IsModuleAllowed final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlert;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToast;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnlockService_IsModuleAllowed) == 0x000004, "Wrong alignment on UnlockService_IsModuleAllowed");
static_assert(sizeof(UnlockService_IsModuleAllowed) == 0x000008, "Wrong size on UnlockService_IsModuleAllowed");
static_assert(offsetof(UnlockService_IsModuleAllowed, InModuleId) == 0x000000, "Member 'UnlockService_IsModuleAllowed::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleAllowed, bIsAlert) == 0x000004, "Member 'UnlockService_IsModuleAllowed::bIsAlert' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleAllowed, bIsToast) == 0x000005, "Member 'UnlockService_IsModuleAllowed::bIsToast' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleAllowed, ReturnValue) == 0x000006, "Member 'UnlockService_IsModuleAllowed::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.IsModuleBanned
// 0x0008 (0x0008 - 0x0000)
struct UnlockService_IsModuleBanned final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlert;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToast;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnlockService_IsModuleBanned) == 0x000004, "Wrong alignment on UnlockService_IsModuleBanned");
static_assert(sizeof(UnlockService_IsModuleBanned) == 0x000008, "Wrong size on UnlockService_IsModuleBanned");
static_assert(offsetof(UnlockService_IsModuleBanned, InModuleId) == 0x000000, "Member 'UnlockService_IsModuleBanned::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleBanned, bIsAlert) == 0x000004, "Member 'UnlockService_IsModuleBanned::bIsAlert' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleBanned, bIsToast) == 0x000005, "Member 'UnlockService_IsModuleBanned::bIsToast' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleBanned, ReturnValue) == 0x000006, "Member 'UnlockService_IsModuleBanned::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.IsModuleCircularLock
// 0x0008 (0x0008 - 0x0000)
struct UnlockService_IsModuleCircularLock final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlert;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToast;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnlockService_IsModuleCircularLock) == 0x000004, "Wrong alignment on UnlockService_IsModuleCircularLock");
static_assert(sizeof(UnlockService_IsModuleCircularLock) == 0x000008, "Wrong size on UnlockService_IsModuleCircularLock");
static_assert(offsetof(UnlockService_IsModuleCircularLock, InModuleId) == 0x000000, "Member 'UnlockService_IsModuleCircularLock::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleCircularLock, bIsAlert) == 0x000004, "Member 'UnlockService_IsModuleCircularLock::bIsAlert' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleCircularLock, bIsToast) == 0x000005, "Member 'UnlockService_IsModuleCircularLock::bIsToast' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleCircularLock, ReturnValue) == 0x000006, "Member 'UnlockService_IsModuleCircularLock::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.IsModuleGlobalForbid
// 0x0008 (0x0008 - 0x0000)
struct UnlockService_IsModuleGlobalForbid final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlert;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToast;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnlockService_IsModuleGlobalForbid) == 0x000004, "Wrong alignment on UnlockService_IsModuleGlobalForbid");
static_assert(sizeof(UnlockService_IsModuleGlobalForbid) == 0x000008, "Wrong size on UnlockService_IsModuleGlobalForbid");
static_assert(offsetof(UnlockService_IsModuleGlobalForbid, InModuleId) == 0x000000, "Member 'UnlockService_IsModuleGlobalForbid::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleGlobalForbid, bIsAlert) == 0x000004, "Member 'UnlockService_IsModuleGlobalForbid::bIsAlert' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleGlobalForbid, bIsToast) == 0x000005, "Member 'UnlockService_IsModuleGlobalForbid::bIsToast' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleGlobalForbid, ReturnValue) == 0x000006, "Member 'UnlockService_IsModuleGlobalForbid::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.IsModuleLock
// 0x0008 (0x0008 - 0x0000)
struct UnlockService_IsModuleLock final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlert;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToast;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnlockService_IsModuleLock) == 0x000004, "Wrong alignment on UnlockService_IsModuleLock");
static_assert(sizeof(UnlockService_IsModuleLock) == 0x000008, "Wrong size on UnlockService_IsModuleLock");
static_assert(offsetof(UnlockService_IsModuleLock, InModuleId) == 0x000000, "Member 'UnlockService_IsModuleLock::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleLock, bIsAlert) == 0x000004, "Member 'UnlockService_IsModuleLock::bIsAlert' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleLock, bIsToast) == 0x000005, "Member 'UnlockService_IsModuleLock::bIsToast' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleLock, ReturnValue) == 0x000006, "Member 'UnlockService_IsModuleLock::ReturnValue' has a wrong offset!");

// Function TGFGame.UnlockService.IsModuleTimeLock
// 0x0008 (0x0008 - 0x0000)
struct UnlockService_IsModuleTimeLock final
{
public:
	int32                                         InModuleId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlert;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToast;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UnlockService_IsModuleTimeLock) == 0x000004, "Wrong alignment on UnlockService_IsModuleTimeLock");
static_assert(sizeof(UnlockService_IsModuleTimeLock) == 0x000008, "Wrong size on UnlockService_IsModuleTimeLock");
static_assert(offsetof(UnlockService_IsModuleTimeLock, InModuleId) == 0x000000, "Member 'UnlockService_IsModuleTimeLock::InModuleId' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleTimeLock, bIsAlert) == 0x000004, "Member 'UnlockService_IsModuleTimeLock::bIsAlert' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleTimeLock, bIsToast) == 0x000005, "Member 'UnlockService_IsModuleTimeLock::bIsToast' has a wrong offset!");
static_assert(offsetof(UnlockService_IsModuleTimeLock, ReturnValue) == 0x000006, "Member 'UnlockService_IsModuleTimeLock::ReturnValue' has a wrong offset!");

// Function TGFGame.VelocityService.CdnHTTPRequest
// 0x0010 (0x0010 - 0x0000)
