#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TgfGraphics

#include "Basic.hpp"


namespace SDK::Params
{

// Function TgfGraphics.TgfInteractableLightSubsystem.GetLightState
// 0x0010 (0x0010 - 0x0000)
struct TgfInteractableLightSubsystem_GetLightState final
{
public:
	class ATgfStaticInteraction*                  StaticInteraction;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfInteractableLightSubsystem_GetLightState) == 0x000008, "Wrong alignment on TgfInteractableLightSubsystem_GetLightState");
static_assert(sizeof(TgfInteractableLightSubsystem_GetLightState) == 0x000010, "Wrong size on TgfInteractableLightSubsystem_GetLightState");
static_assert(offsetof(TgfInteractableLightSubsystem_GetLightState, StaticInteraction) == 0x000000, "Member 'TgfInteractableLightSubsystem_GetLightState::StaticInteraction' has a wrong offset!");
static_assert(offsetof(TgfInteractableLightSubsystem_GetLightState, ReturnValue) == 0x000008, "Member 'TgfInteractableLightSubsystem_GetLightState::ReturnValue' has a wrong offset!");

// Function TgfGraphics.TgfInteractableLightSubsystem.ToggleInteractableLight
// 0x0010 (0x0010 - 0x0000)
struct TgfInteractableLightSubsystem_ToggleInteractableLight final
{
public:
	class ATgfStaticInteraction*                  StaticInteraction;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLightOn;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TgfInteractableLightSubsystem_ToggleInteractableLight) == 0x000008, "Wrong alignment on TgfInteractableLightSubsystem_ToggleInteractableLight");
static_assert(sizeof(TgfInteractableLightSubsystem_ToggleInteractableLight) == 0x000010, "Wrong size on TgfInteractableLightSubsystem_ToggleInteractableLight");
static_assert(offsetof(TgfInteractableLightSubsystem_ToggleInteractableLight, StaticInteraction) == 0x000000, "Member 'TgfInteractableLightSubsystem_ToggleInteractableLight::StaticInteraction' has a wrong offset!");
static_assert(offsetof(TgfInteractableLightSubsystem_ToggleInteractableLight, bLightOn) == 0x000008, "Member 'TgfInteractableLightSubsystem_ToggleInteractableLight::bLightOn' has a wrong offset!");

}

