#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "TGFGame_structs.hpp"
#include "LyraGame_structs.hpp"
#include "UnLua_classes.hpp"
#include "TGFBattleProtocol_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// LuaOverridesClass Transient.LUA_OVERRIDES_BattlePassTaskService_2147482455
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_BattlePassTaskService_2147482455 final : public ULuaOverridesClass
{
public:
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_BattlePassTaskService_2147482455">();
	}
	static class ULUA_OVERRIDES_BattlePassTaskService_2147482455* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_BattlePassTaskService_2147482455>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_BattlePassTaskService_2147482455) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_BattlePassTaskService_2147482455");
static_assert(sizeof(ULUA_OVERRIDES_BattlePassTaskService_2147482455) == 0x000238, "Wrong size on ULUA_OVERRIDES_BattlePassTaskService_2147482455");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467 final : public ULuaOverridesClass
{
public:
	void GetInventoryContext(class UTgfInventoryWrapper** InventoryContextNew);
	void UpdateDetailAttributes();
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void Construct();
	void Destruct();
	void BP_InternalTick(float InDeltaTime);
	void OnAttributeChanged();
	void DropItem(class UDragDropOperation* Operation);
	void GetAttributeValue(EnRoleDisplayAttribueID Attribute_id, double* Value, double* Base, double* Max);
	void SetUp(class AController* _Controller, class ALyraCharacter* Character, class ULyraInventoryManagerComponent* Loot_Inventory, class ULyraEquipmentManagerComponent* Loot_Equipment, class ALyraCharacter* MyCharacter);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_InventoryMenu_C_2147481467");

// LuaOverridesClass Transient.LUA_OVERRIDES_JumpManager_2147482481
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_JumpManager_2147482481 final : public ULuaOverridesClass
{
public:
	void Lua_HyperlinkJump(const class FString& Href);
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_JumpManager_2147482481">();
	}
	static class ULUA_OVERRIDES_JumpManager_2147482481* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_JumpManager_2147482481>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_JumpManager_2147482481) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_JumpManager_2147482481");
static_assert(sizeof(ULUA_OVERRIDES_JumpManager_2147482481) == 0x000238, "Wrong size on ULUA_OVERRIDES_JumpManager_2147482481");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491">();
	}
	static class ULUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491");
static_assert(sizeof(ULUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_ItemGearSetLine_C_2147481491");

// LuaOverridesClass Transient.LUA_OVERRIDES_TimerSubsystem_2147482470
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_TimerSubsystem_2147482470 final : public ULuaOverridesClass
{
public:
	void Lua_Tick(float DeltaTime);
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_TimerSubsystem_2147482470">();
	}
	static class ULUA_OVERRIDES_TimerSubsystem_2147482470* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_TimerSubsystem_2147482470>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_TimerSubsystem_2147482470) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_TimerSubsystem_2147482470");
static_assert(sizeof(ULUA_OVERRIDES_TimerSubsystem_2147482470) == 0x000238, "Wrong size on ULUA_OVERRIDES_TimerSubsystem_2147482470");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494 final : public ULuaOverridesClass
{
public:
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void Construct();
	void Destruct();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494">();
	}
	static class ULUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494");
static_assert(sizeof(ULUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_InventorySoulBoundInspector_C_2147481494");

// LuaOverridesClass Transient.LUA_OVERRIDES_BlacksmithService_2147482452
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_BlacksmithService_2147482452 final : public ULuaOverridesClass
{
public:
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_BlacksmithService_2147482452">();
	}
	static class ULUA_OVERRIDES_BlacksmithService_2147482452* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_BlacksmithService_2147482452>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_BlacksmithService_2147482452) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_BlacksmithService_2147482452");
static_assert(sizeof(ULUA_OVERRIDES_BlacksmithService_2147482452) == 0x000238, "Wrong size on ULUA_OVERRIDES_BlacksmithService_2147482452");

// LuaOverridesClass Transient.LUA_OVERRIDES_ACEReportService_2147482468
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_ACEReportService_2147482468 final : public ULuaOverridesClass
{
public:
	void Lua_ACEReportPlayerInBattle(int64 TargetOpenId, int32 TargetZoneId, const class FString& TargetPlayerName, class APlayerController* SourcePC);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_ACEReportService_2147482468">();
	}
	static class ULUA_OVERRIDES_ACEReportService_2147482468* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_ACEReportService_2147482468>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_ACEReportService_2147482468) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_ACEReportService_2147482468");
static_assert(sizeof(ULUA_OVERRIDES_ACEReportService_2147482468) == 0x000238, "Wrong size on ULUA_OVERRIDES_ACEReportService_2147482468");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490">();
	}
	static class ULUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Tooltip_GemItem_C_2147481490");

// LuaOverridesClass Transient.LUA_OVERRIDES_AppService_2147482461
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_AppService_2147482461 final : public ULuaOverridesClass
{
public:
	void Lua_OnEnterStateHall();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_AppService_2147482461">();
	}
	static class ULUA_OVERRIDES_AppService_2147482461* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_AppService_2147482461>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_AppService_2147482461) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_AppService_2147482461");
static_assert(sizeof(ULUA_OVERRIDES_AppService_2147482461) == 0x000238, "Wrong size on ULUA_OVERRIDES_AppService_2147482461");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485">();
	}
	static class ULUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Common_ItemTooltip_Detail_C_2147481485");

// LuaOverridesClass Transient.LUA_OVERRIDES_SocialService_2147482396
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_SocialService_2147482396 final : public ULuaOverridesClass
{
public:
	void Lua_SetToggleRedDot(ESocialToggleType ToggleType, bool bRedTips);
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_SocialService_2147482396">();
	}
	static class ULUA_OVERRIDES_SocialService_2147482396* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_SocialService_2147482396>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_SocialService_2147482396) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_SocialService_2147482396");
static_assert(sizeof(ULUA_OVERRIDES_SocialService_2147482396) == 0x000238, "Wrong size on ULUA_OVERRIDES_SocialService_2147482396");

// LuaOverridesClass Transient.LUA_OVERRIDES_BattlePassRewardService_2147482459
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_BattlePassRewardService_2147482459 final : public ULuaOverridesClass
{
public:
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_BattlePassRewardService_2147482459">();
	}
	static class ULUA_OVERRIDES_BattlePassRewardService_2147482459* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_BattlePassRewardService_2147482459>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_BattlePassRewardService_2147482459) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_BattlePassRewardService_2147482459");
static_assert(sizeof(ULUA_OVERRIDES_BattlePassRewardService_2147482459) == 0x000238, "Wrong size on ULUA_OVERRIDES_BattlePassRewardService_2147482459");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482 final : public ULuaOverridesClass
{
public:
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void Construct();
	void Destruct();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();
	void OnInventoryDragInitiated(class UTgfInventoryDragDropOperation* DragOperation);
	void OnItemDragEnded(class UDragDropOperation* Operation);
	void UpdateDropAreaBasedOnDraggedWeapon(class UDragDropOperation* DragDropOperation);
	void ShouldNotShowTooltip(bool* bNoShow);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482">();
	}
	static class ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Weapon_C_2147481482");

// LuaOverridesClass Transient.LUA_OVERRIDES_GamePreLoginService_2147482442
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_GamePreLoginService_2147482442 final : public ULuaOverridesClass
{
public:
	void Lua_OnEnterLoginQueue();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_GamePreLoginService_2147482442">();
	}
	static class ULUA_OVERRIDES_GamePreLoginService_2147482442* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_GamePreLoginService_2147482442>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_GamePreLoginService_2147482442) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_GamePreLoginService_2147482442");
static_assert(sizeof(ULUA_OVERRIDES_GamePreLoginService_2147482442) == 0x000238, "Wrong size on ULUA_OVERRIDES_GamePreLoginService_2147482442");

// LuaOverridesClass Transient.LUA_OVERRIDES_GuideService_2147482438
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_GuideService_2147482438 final : public ULuaOverridesClass
{
public:
	void Lua_ShowGuideChoose();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_GuideService_2147482438">();
	}
	static class ULUA_OVERRIDES_GuideService_2147482438* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_GuideService_2147482438>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_GuideService_2147482438) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_GuideService_2147482438");
static_assert(sizeof(ULUA_OVERRIDES_GuideService_2147482438) == 0x000238, "Wrong size on ULUA_OVERRIDES_GuideService_2147482438");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481 final : public ULuaOverridesClass
{
public:
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Construct();
	void Destruct();
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ShouldNotShowTooltip(bool* bNoShow);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481">();
	}
	static class ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Inventory_EquipmentSlot_Clothing_C_2147481481");

// LuaOverridesClass Transient.LUA_OVERRIDES_HeirloomService_2147482435
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_HeirloomService_2147482435 final : public ULuaOverridesClass
{
public:
	void Lua_Deinitialize();
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_HeirloomService_2147482435">();
	}
	static class ULUA_OVERRIDES_HeirloomService_2147482435* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_HeirloomService_2147482435>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_HeirloomService_2147482435) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_HeirloomService_2147482435");
static_assert(sizeof(ULUA_OVERRIDES_HeirloomService_2147482435) == 0x000238, "Wrong size on ULUA_OVERRIDES_HeirloomService_2147482435");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void MakeSkillDescribeText(const class FText& Description, class FText* Result);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_Skill_C_2147481464");

// LuaOverridesClass Transient.LUA_OVERRIDES_InventoryService_2147482430
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_InventoryService_2147482430 final : public ULuaOverridesClass
{
public:
	float Lua_GetRoleAttributeValue(EnRoleDisplayAttribueID AttributeID);
	void Lua_Initialized();
	void Lua_OnPreLoadMap(const class FString& MapName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_InventoryService_2147482430">();
	}
	static class ULUA_OVERRIDES_InventoryService_2147482430* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_InventoryService_2147482430>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_InventoryService_2147482430) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_InventoryService_2147482430");
static_assert(sizeof(ULUA_OVERRIDES_InventoryService_2147482430) == 0x000238, "Wrong size on ULUA_OVERRIDES_InventoryService_2147482430");

// LuaOverridesClass Transient.LUA_OVERRIDES_MithrilService_2147482421
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_MithrilService_2147482421 final : public ULuaOverridesClass
{
public:
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_MithrilService_2147482421">();
	}
	static class ULUA_OVERRIDES_MithrilService_2147482421* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_MithrilService_2147482421>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_MithrilService_2147482421) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_MithrilService_2147482421");
static_assert(sizeof(ULUA_OVERRIDES_MithrilService_2147482421) == 0x000238, "Wrong size on ULUA_OVERRIDES_MithrilService_2147482421");

// LuaOverridesClass Transient.LUA_OVERRIDES_SettingService_2147482409
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_SettingService_2147482409 final : public ULuaOverridesClass
{
public:
	void Lua_OpenAccountDeletion();
	void Lua_OpenPrivacyProtocol();
	void Lua_OpenUserProtocol();
	void Lua_OpenCustomerService();
	void Lua_OpenProtocolDescription();
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_SettingService_2147482409">();
	}
	static class ULUA_OVERRIDES_SettingService_2147482409* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_SettingService_2147482409>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_SettingService_2147482409) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_SettingService_2147482409");
static_assert(sizeof(ULUA_OVERRIDES_SettingService_2147482409) == 0x000238, "Wrong size on ULUA_OVERRIDES_SettingService_2147482409");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554">();
	}
	static class ULUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Common_Tooltip_C_2147481554");

// LuaOverridesClass Transient.LUA_OVERRIDES_SDKWebviewService_2147482399
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_SDKWebviewService_2147482399 final : public ULuaOverridesClass
{
public:
	void Lua_OnWebViewResult(int32 MsgType, const class FString& MsgJsonData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_SDKWebviewService_2147482399">();
	}
	static class ULUA_OVERRIDES_SDKWebviewService_2147482399* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_SDKWebviewService_2147482399>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_SDKWebviewService_2147482399) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_SDKWebviewService_2147482399");
static_assert(sizeof(ULUA_OVERRIDES_SDKWebviewService_2147482399) == 0x000238, "Wrong size on ULUA_OVERRIDES_SDKWebviewService_2147482399");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465">();
	}
	static class ULUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Attribute_Skill_DropDown_C_2147481465");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486">();
	}
	static class ULUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Item_PriceTrend_C_2147481486");

// LuaOverridesClass Transient.LUA_OVERRIDES_TaskService_2147482394
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_TaskService_2147482394 final : public ULuaOverridesClass
{
public:
	void Lua_NotifyTaskDataReady(bool bIsReady);
	void Lua_Initialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_TaskService_2147482394">();
	}
	static class ULUA_OVERRIDES_TaskService_2147482394* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_TaskService_2147482394>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_TaskService_2147482394) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_TaskService_2147482394");
static_assert(sizeof(ULUA_OVERRIDES_TaskService_2147482394) == 0x000238, "Wrong size on ULUA_OVERRIDES_TaskService_2147482394");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475 final : public ULuaOverridesClass
{
public:
	void Destruct();
	void OnInitialized();
	void RefreshEntries();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Equipments_C_2147481475");

// LuaOverridesClass Transient.LUA_OVERRIDES_UserRoleCacheService_2147482370
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_UserRoleCacheService_2147482370 final : public ULuaOverridesClass
{
public:
	void Lua_AppearanceCaptureFinish(int64 RoleGuid, class UObject* AppearanceTexture);
	void Lua_Initialized();
	void Lua_ExecuteUpdateEvent(int64 UpdateHandler);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_UserRoleCacheService_2147482370">();
	}
	static class ULUA_OVERRIDES_UserRoleCacheService_2147482370* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_UserRoleCacheService_2147482370>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_UserRoleCacheService_2147482370) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_UserRoleCacheService_2147482370");
static_assert(sizeof(ULUA_OVERRIDES_UserRoleCacheService_2147482370) == 0x000238, "Wrong size on ULUA_OVERRIDES_UserRoleCacheService_2147482370");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_LoginWindow_C_2147482197
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_LoginWindow_C_2147482197 final : public ULuaOverridesClass
{
public:
	void CheckInputText(bool* Valid);
	void Construct();
	void Destruct();
	void SetCustomerServiceButton();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_LoginWindow_C_2147482197">();
	}
	static class ULUA_OVERRIDES_WBP_LoginWindow_C_2147482197* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_LoginWindow_C_2147482197>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_LoginWindow_C_2147482197) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_LoginWindow_C_2147482197");
static_assert(sizeof(ULUA_OVERRIDES_WBP_LoginWindow_C_2147482197) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_LoginWindow_C_2147482197");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484 final : public ULuaOverridesClass
{
public:
	void UpdateAttrsBase(TArray<struct FAffixDisplayConfig>& Attrs);
	void Construct();
	void Destruct();
	void UpdateTopAffixes(TArray<struct FAffixDisplayConfig>& Attrs);
	void UpdateDurability(bool* Ret);
	void GetRightClickText(class FText* Operation);
	void SetUp(class UTgfInventoryItemWrapper* Item, class UTgfInventoryWrapper* InventoryContext, const class UTgfInventoryWrapper*& RootInventoryContext, ETGFProtoTgfEnItemStorageType Pos_type, bool bAttributeAsRange, bool ShowUnkonw);
	void OnInitialized();
	void UpdateAttackLevel(TArray<struct FAffixDisplayConfig>& Attrs);
	void UpdateAttributesIn();
	void UpdateButtonInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484">();
	}
	static class ULUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484");
static_assert(sizeof(ULUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_ItemTooltip_Battle_C_2147481484");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553 final : public ULuaOverridesClass
{
public:
	void SetTips(int32 TypeId);
	void SetTypeIcon(int32 Type);
	void Construct();
	void Destruct();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553">();
	}
	static class ULUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Trade_PriceEntry_C_2147481553");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470">();
	}
	static class ULUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470");
static_assert(sizeof(ULUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_UI_Inventory_Aux_AlmightyGod_C_2147481470");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552 final : public ULuaOverridesClass
{
public:
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void Construct();
	void Destruct();
	void OnInventoryDragInitiated(class UTgfInventoryDragDropOperation* DragOperation);
	void BP_OnActivated();
	void OnInitialized();
	void OnItemDragEnded(class UDragDropOperation* Operation);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552">();
	}
	static class ULUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Inventory_Equipment_DropArea_C_2147481552");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479 final : public ULuaOverridesClass
{
public:
	void SetupGrid(int32 Rows, int32 Columns);
	void RefreshEntries();
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void Construct();
	void Destruct();
	void SetDropIndicatorVisibility(bool bVisible);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnInitialized();
	void OnInventoryUpdated();
	void UpdateHover(const struct FPointerEvent& MouseEvent, struct FEventReply* Ret);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_InventorySlots_C_2147481479");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493 final : public ULuaOverridesClass
{
public:
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Destruct();
	void OnInitialized();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem2_C_2147481493");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_SettingPopup_C_2147481492
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_SettingPopup_C_2147481492 final : public ULuaOverridesClass
{
public:
	void OnInitialized();
	void Construct();
	void Destruct();
	void SetCustomerServiceButton();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_SettingPopup_C_2147481492">();
	}
	static class ULUA_OVERRIDES_WBP_SettingPopup_C_2147481492* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_SettingPopup_C_2147481492>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_SettingPopup_C_2147481492) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_SettingPopup_C_2147481492");
static_assert(sizeof(ULUA_OVERRIDES_WBP_SettingPopup_C_2147481492) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_SettingPopup_C_2147481492");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();
	void ReplaceSkillName(const class FText& Text, class FText* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_2147481489");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476 final : public ULuaOverridesClass
{
public:
	struct FEventReply ProcessMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Construct();
	void Destruct();
	void BP_InternalTick(float InDeltaTime);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply ProcessMouseButtonDown(class UWidget* DetectingDragOnWidget, const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void SetupWithItem(class UTgfInventoryItemWrapper* Item, class UTgfInventoryWrapper* Context, bool IsEquipment);
	void SetIconScale(double Scale);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void OnInitialized();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476">();
	}
	static class ULUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Common_ItemEntry_C_2147481476");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488">();
	}
	static class ULUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488");
static_assert(sizeof(ULUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_ItemGearSetSlot_C_2147481488");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487">();
	}
	static class ULUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Tgf_Inventory_Attribute_Tips_Talent_C_2147481487");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483 final : public ULuaOverridesClass
{
public:
	void OnInitialized();
	void Destruct();
	void Construct();
	void HaveOwnerList(bool* Ret);
	void UpdatePos();
	void OnToggleUserListMode(bool bCompareModeOn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483">();
	}
	static class ULUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483");
static_assert(sizeof(ULUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_ItemToolTips_CompareBattle_C_2147481483");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480">();
	}
	static class ULUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Inventory_DivideItem_C_2147481480");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void SetupWithContext(class UTgfInventoryItemWrapper* Item, class UTgfInventoryWrapper* Context);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_DragItem_C_2147481478");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_NoticeItem_C_2147481462
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_NoticeItem_C_2147481462 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_NoticeItem_C_2147481462">();
	}
	static class ULUA_OVERRIDES_WBP_NoticeItem_C_2147481462* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_NoticeItem_C_2147481462>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_NoticeItem_C_2147481462) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_NoticeItem_C_2147481462");
static_assert(sizeof(ULUA_OVERRIDES_WBP_NoticeItem_C_2147481462) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_NoticeItem_C_2147481462");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477 final : public ULuaOverridesClass
{
public:
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Construct();
	void OnQuickEquip(class UWBP_Common_ItemEntry_C* ItemEntry);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();
	void Destruct();
	void OnQuickDiscard(class UWBP_Common_ItemEntry_C* Item_Entry);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_InventoryEntry_C_2147481477");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474 final : public ULuaOverridesClass
{
public:
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetupByCareer(ETgfActorCareer Career);
	void OnInitialized();
	void Construct();
	void Destruct();
	void SetUp(class ULyraInventoryManagerComponent* Inventory, class ULyraEquipmentManagerComponent* Equipment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_LootSection_C_2147481474");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473">();
	}
	static class ULUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473");
static_assert(sizeof(ULUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_Inventory_CharacterSection_C_2147481473");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472 final : public ULuaOverridesClass
{
public:
	void OnInitialized();
	void Construct();
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472">();
	}
	static class ULUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472");
static_assert(sizeof(ULUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_UI_Inventory_Aux_SwordMaster_C_2147481472");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471">();
	}
	static class ULUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471");
static_assert(sizeof(ULUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_UI_Inventory_Aux_Rogue_C_2147481471");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();
	void CheckRedpoint();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_ListItem1_C_2147481469");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	struct FEventReply OnArrowEClicked(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnArrowQClicked(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_Inventory_Attribute_C_2147481468");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();
	void GetRoleWrapper(class UTgfInventoryRoleWrapper** RoleWrapper);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466">();
	}
	static class ULUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466");
static_assert(sizeof(ULUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_TgfGame_SkillIcon_C_2147481466");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_GuideWindow_C_2147481463
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_GuideWindow_C_2147481463 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_GuideWindow_C_2147481463">();
	}
	static class ULUA_OVERRIDES_WBP_GuideWindow_C_2147481463* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_GuideWindow_C_2147481463>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_GuideWindow_C_2147481463) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_GuideWindow_C_2147481463");
static_assert(sizeof(ULUA_OVERRIDES_WBP_GuideWindow_C_2147481463) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_GuideWindow_C_2147481463");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_NoticeWindow_C_2147481461
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_NoticeWindow_C_2147481461 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_NoticeWindow_C_2147481461">();
	}
	static class ULUA_OVERRIDES_WBP_NoticeWindow_C_2147481461* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_NoticeWindow_C_2147481461>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_NoticeWindow_C_2147481461) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_NoticeWindow_C_2147481461");
static_assert(sizeof(ULUA_OVERRIDES_WBP_NoticeWindow_C_2147481461) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_NoticeWindow_C_2147481461");

// LuaOverridesClass Transient.LUA_OVERRIDES_WBP_NoticeInfo_C_2147481460
// 0x0000 (0x0238 - 0x0238)
class ULUA_OVERRIDES_WBP_NoticeInfo_C_2147481460 final : public ULuaOverridesClass
{
public:
	void Construct();
	void Destruct();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LUA_OVERRIDES_WBP_NoticeInfo_C_2147481460">();
	}
	static class ULUA_OVERRIDES_WBP_NoticeInfo_C_2147481460* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULUA_OVERRIDES_WBP_NoticeInfo_C_2147481460>();
	}
};
static_assert(alignof(ULUA_OVERRIDES_WBP_NoticeInfo_C_2147481460) == 0x000008, "Wrong alignment on ULUA_OVERRIDES_WBP_NoticeInfo_C_2147481460");
static_assert(sizeof(ULUA_OVERRIDES_WBP_NoticeInfo_C_2147481460) == 0x000238, "Wrong size on ULUA_OVERRIDES_WBP_NoticeInfo_C_2147481460");

}

