#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Undead0001_T_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Undead0001_T_AnimBlueprint.Undead0001_T_AnimBlueprint_C
// 0x1060 (0x13B0 - 0x0350)
class UUndead0001_T_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0388(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03C8(0x00C8)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x0490(0x0790)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0C20(0x0790)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_Undead0001_T_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Undead0001_T_AnimBlueprint_C">();
	}
	static class UUndead0001_T_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUndead0001_T_AnimBlueprint_C>();
	}
};
static_assert(alignof(UUndead0001_T_AnimBlueprint_C) == 0x000010, "Wrong alignment on UUndead0001_T_AnimBlueprint_C");
static_assert(sizeof(UUndead0001_T_AnimBlueprint_C) == 0x0013B0, "Wrong size on UUndead0001_T_AnimBlueprint_C");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, UberGraphFrame) == 0x000350, "Member 'UUndead0001_T_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UUndead0001_T_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UUndead0001_T_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimGraphNode_Root) == 0x000368, "Member 'UUndead0001_T_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000388, "Member 'UUndead0001_T_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003A8, "Member 'UUndead0001_T_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimGraphNode_LinkedInputPose) == 0x0003C8, "Member 'UUndead0001_T_AnimBlueprint_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics_1) == 0x000490, "Member 'UUndead0001_T_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UUndead0001_T_AnimBlueprint_C, AnimGraphNode_KawaiiPhysics) == 0x000C20, "Member 'UUndead0001_T_AnimBlueprint_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

