#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UnLua.UnLuaFunctionLibrary.GetFileLastModifiedTimestamp
// 0x0018 (0x0018 - 0x0000)
struct UnLuaFunctionLibrary_GetFileLastModifiedTimestamp final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaFunctionLibrary_GetFileLastModifiedTimestamp) == 0x000008, "Wrong alignment on UnLuaFunctionLibrary_GetFileLastModifiedTimestamp");
static_assert(sizeof(UnLuaFunctionLibrary_GetFileLastModifiedTimestamp) == 0x000018, "Wrong size on UnLuaFunctionLibrary_GetFileLastModifiedTimestamp");
static_assert(offsetof(UnLuaFunctionLibrary_GetFileLastModifiedTimestamp, Path) == 0x000000, "Member 'UnLuaFunctionLibrary_GetFileLastModifiedTimestamp::Path' has a wrong offset!");
static_assert(offsetof(UnLuaFunctionLibrary_GetFileLastModifiedTimestamp, ReturnValue) == 0x000010, "Member 'UnLuaFunctionLibrary_GetFileLastModifiedTimestamp::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaFunctionLibrary.GetScriptRootPath
// 0x0010 (0x0010 - 0x0000)
struct UnLuaFunctionLibrary_GetScriptRootPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaFunctionLibrary_GetScriptRootPath) == 0x000008, "Wrong alignment on UnLuaFunctionLibrary_GetScriptRootPath");
static_assert(sizeof(UnLuaFunctionLibrary_GetScriptRootPath) == 0x000010, "Wrong size on UnLuaFunctionLibrary_GetScriptRootPath");
static_assert(offsetof(UnLuaFunctionLibrary_GetScriptRootPath, ReturnValue) == 0x000000, "Member 'UnLuaFunctionLibrary_GetScriptRootPath::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaInterface.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct UnLuaInterface_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaInterface_GetModuleName) == 0x000008, "Wrong alignment on UnLuaInterface_GetModuleName");
static_assert(sizeof(UnLuaInterface_GetModuleName) == 0x000010, "Wrong size on UnLuaInterface_GetModuleName");
static_assert(offsetof(UnLuaInterface_GetModuleName, ReturnValue) == 0x000000, "Member 'UnLuaInterface_GetModuleName::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaLatentAction.GetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct UnLuaLatentAction_GetTickableWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaLatentAction_GetTickableWhenPaused) == 0x000001, "Wrong alignment on UnLuaLatentAction_GetTickableWhenPaused");
static_assert(sizeof(UnLuaLatentAction_GetTickableWhenPaused) == 0x000001, "Wrong size on UnLuaLatentAction_GetTickableWhenPaused");
static_assert(offsetof(UnLuaLatentAction_GetTickableWhenPaused, ReturnValue) == 0x000000, "Member 'UnLuaLatentAction_GetTickableWhenPaused::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaLatentAction.OnLegacyCallback
// 0x0004 (0x0004 - 0x0000)
struct UnLuaLatentAction_OnLegacyCallback final
{
public:
	int32                                         InLinkage;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaLatentAction_OnLegacyCallback) == 0x000004, "Wrong alignment on UnLuaLatentAction_OnLegacyCallback");
static_assert(sizeof(UnLuaLatentAction_OnLegacyCallback) == 0x000004, "Wrong size on UnLuaLatentAction_OnLegacyCallback");
static_assert(offsetof(UnLuaLatentAction_OnLegacyCallback, InLinkage) == 0x000000, "Member 'UnLuaLatentAction_OnLegacyCallback::InLinkage' has a wrong offset!");

// Function UnLua.UnLuaLatentAction.SetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct UnLuaLatentAction_SetTickableWhenPaused final
{
public:
	bool                                          bTickableWhenPaused;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaLatentAction_SetTickableWhenPaused) == 0x000001, "Wrong alignment on UnLuaLatentAction_SetTickableWhenPaused");
static_assert(sizeof(UnLuaLatentAction_SetTickableWhenPaused) == 0x000001, "Wrong size on UnLuaLatentAction_SetTickableWhenPaused");
static_assert(offsetof(UnLuaLatentAction_SetTickableWhenPaused, bTickableWhenPaused) == 0x000000, "Member 'UnLuaLatentAction_SetTickableWhenPaused::bTickableWhenPaused' has a wrong offset!");

// Function UnLua.UnLuaLatentAction.OnCompleted
// 0x0004 (0x0004 - 0x0000)
struct UnLuaLatentAction_OnCompleted final
{
public:
	int32                                         InLinkage;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaLatentAction_OnCompleted) == 0x000004, "Wrong alignment on UnLuaLatentAction_OnCompleted");
static_assert(sizeof(UnLuaLatentAction_OnCompleted) == 0x000004, "Wrong size on UnLuaLatentAction_OnCompleted");
static_assert(offsetof(UnLuaLatentAction_OnCompleted, InLinkage) == 0x000000, "Member 'UnLuaLatentAction_OnCompleted::InLinkage' has a wrong offset!");

// Function UnLua.UnLuaManager.EnhancedInputActionAxis1D
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis1D final
{
public:
	float                                         ActionValue;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_EnhancedInputActionAxis1D) == 0x000004, "Wrong alignment on UnLuaManager_EnhancedInputActionAxis1D");
static_assert(sizeof(UnLuaManager_EnhancedInputActionAxis1D) == 0x00000C, "Wrong size on UnLuaManager_EnhancedInputActionAxis1D");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis1D, ActionValue) == 0x000000, "Member 'UnLuaManager_EnhancedInputActionAxis1D::ActionValue' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis1D, ElapsedSeconds) == 0x000004, "Member 'UnLuaManager_EnhancedInputActionAxis1D::ElapsedSeconds' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis1D, TriggeredSeconds) == 0x000008, "Member 'UnLuaManager_EnhancedInputActionAxis1D::TriggeredSeconds' has a wrong offset!");

// Function UnLua.UnLuaManager.EnhancedInputActionAxis2D
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis2D final
{
public:
	struct FVector2D                              ActionValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_EnhancedInputActionAxis2D) == 0x000008, "Wrong alignment on UnLuaManager_EnhancedInputActionAxis2D");
static_assert(sizeof(UnLuaManager_EnhancedInputActionAxis2D) == 0x000018, "Wrong size on UnLuaManager_EnhancedInputActionAxis2D");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis2D, ActionValue) == 0x000000, "Member 'UnLuaManager_EnhancedInputActionAxis2D::ActionValue' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis2D, ElapsedSeconds) == 0x000010, "Member 'UnLuaManager_EnhancedInputActionAxis2D::ElapsedSeconds' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis2D, TriggeredSeconds) == 0x000014, "Member 'UnLuaManager_EnhancedInputActionAxis2D::TriggeredSeconds' has a wrong offset!");

// Function UnLua.UnLuaManager.EnhancedInputActionAxis3D
// 0x0020 (0x0020 - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis3D final
{
public:
	struct FVector                                ActionValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_EnhancedInputActionAxis3D) == 0x000008, "Wrong alignment on UnLuaManager_EnhancedInputActionAxis3D");
static_assert(sizeof(UnLuaManager_EnhancedInputActionAxis3D) == 0x000020, "Wrong size on UnLuaManager_EnhancedInputActionAxis3D");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis3D, ActionValue) == 0x000000, "Member 'UnLuaManager_EnhancedInputActionAxis3D::ActionValue' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis3D, ElapsedSeconds) == 0x000018, "Member 'UnLuaManager_EnhancedInputActionAxis3D::ElapsedSeconds' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionAxis3D, TriggeredSeconds) == 0x00001C, "Member 'UnLuaManager_EnhancedInputActionAxis3D::TriggeredSeconds' has a wrong offset!");

// Function UnLua.UnLuaManager.EnhancedInputActionDigital
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_EnhancedInputActionDigital final
{
public:
	bool                                          ActionValue;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedSeconds;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_EnhancedInputActionDigital) == 0x000004, "Wrong alignment on UnLuaManager_EnhancedInputActionDigital");
static_assert(sizeof(UnLuaManager_EnhancedInputActionDigital) == 0x00000C, "Wrong size on UnLuaManager_EnhancedInputActionDigital");
static_assert(offsetof(UnLuaManager_EnhancedInputActionDigital, ActionValue) == 0x000000, "Member 'UnLuaManager_EnhancedInputActionDigital::ActionValue' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionDigital, ElapsedSeconds) == 0x000004, "Member 'UnLuaManager_EnhancedInputActionDigital::ElapsedSeconds' has a wrong offset!");
static_assert(offsetof(UnLuaManager_EnhancedInputActionDigital, TriggeredSeconds) == 0x000008, "Member 'UnLuaManager_EnhancedInputActionDigital::TriggeredSeconds' has a wrong offset!");

// Function UnLua.UnLuaManager.GetOrAddBindingObject
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_GetOrAddBindingObject final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 BindingClass;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicBlueprintBinding*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_GetOrAddBindingObject) == 0x000008, "Wrong alignment on UnLuaManager_GetOrAddBindingObject");
static_assert(sizeof(UnLuaManager_GetOrAddBindingObject) == 0x000018, "Wrong size on UnLuaManager_GetOrAddBindingObject");
static_assert(offsetof(UnLuaManager_GetOrAddBindingObject, Param_Class) == 0x000000, "Member 'UnLuaManager_GetOrAddBindingObject::Param_Class' has a wrong offset!");
static_assert(offsetof(UnLuaManager_GetOrAddBindingObject, BindingClass) == 0x000008, "Member 'UnLuaManager_GetOrAddBindingObject::BindingClass' has a wrong offset!");
static_assert(offsetof(UnLuaManager_GetOrAddBindingObject, ReturnValue) == 0x000010, "Member 'UnLuaManager_GetOrAddBindingObject::ReturnValue' has a wrong offset!");

// Function UnLua.UnLuaManager.InputAction
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_InputAction final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputAction) == 0x000008, "Wrong alignment on UnLuaManager_InputAction");
static_assert(sizeof(UnLuaManager_InputAction) == 0x000018, "Wrong size on UnLuaManager_InputAction");
static_assert(offsetof(UnLuaManager_InputAction, Key) == 0x000000, "Member 'UnLuaManager_InputAction::Key' has a wrong offset!");

// Function UnLua.UnLuaManager.InputAxis
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputAxis final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputAxis) == 0x000004, "Wrong alignment on UnLuaManager_InputAxis");
static_assert(sizeof(UnLuaManager_InputAxis) == 0x000004, "Wrong size on UnLuaManager_InputAxis");
static_assert(offsetof(UnLuaManager_InputAxis, AxisValue) == 0x000000, "Member 'UnLuaManager_InputAxis::AxisValue' has a wrong offset!");

// Function UnLua.UnLuaManager.InputGesture
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputGesture final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputGesture) == 0x000004, "Wrong alignment on UnLuaManager_InputGesture");
static_assert(sizeof(UnLuaManager_InputGesture) == 0x000004, "Wrong size on UnLuaManager_InputGesture");
static_assert(offsetof(UnLuaManager_InputGesture, Value) == 0x000000, "Member 'UnLuaManager_InputGesture::Value' has a wrong offset!");

// Function UnLua.UnLuaManager.InputTouch
// 0x0020 (0x0020 - 0x0000)
struct UnLuaManager_InputTouch final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputTouch) == 0x000008, "Wrong alignment on UnLuaManager_InputTouch");
static_assert(sizeof(UnLuaManager_InputTouch) == 0x000020, "Wrong size on UnLuaManager_InputTouch");
static_assert(offsetof(UnLuaManager_InputTouch, FingerIndex) == 0x000000, "Member 'UnLuaManager_InputTouch::FingerIndex' has a wrong offset!");
static_assert(offsetof(UnLuaManager_InputTouch, Location) == 0x000008, "Member 'UnLuaManager_InputTouch::Location' has a wrong offset!");

// Function UnLua.UnLuaManager.InputVectorAxis
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_InputVectorAxis final
{
public:
	struct FVector                                AxisValue;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_InputVectorAxis) == 0x000008, "Wrong alignment on UnLuaManager_InputVectorAxis");
static_assert(sizeof(UnLuaManager_InputVectorAxis) == 0x000018, "Wrong size on UnLuaManager_InputVectorAxis");
static_assert(offsetof(UnLuaManager_InputVectorAxis, AxisValue) == 0x000000, "Member 'UnLuaManager_InputVectorAxis::AxisValue' has a wrong offset!");

// Function UnLua.UnLuaManager.OnLatentActionCompleted
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_OnLatentActionCompleted final
{
public:
	int32                                         LinkID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_OnLatentActionCompleted) == 0x000004, "Wrong alignment on UnLuaManager_OnLatentActionCompleted");
static_assert(sizeof(UnLuaManager_OnLatentActionCompleted) == 0x000004, "Wrong size on UnLuaManager_OnLatentActionCompleted");
static_assert(offsetof(UnLuaManager_OnLatentActionCompleted, LinkID) == 0x000000, "Member 'UnLuaManager_OnLatentActionCompleted::LinkID' has a wrong offset!");

// Function UnLua.UnLuaManager.Override
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_Override final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LuaFunctionName;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UnLuaManager_Override) == 0x000008, "Wrong alignment on UnLuaManager_Override");
static_assert(sizeof(UnLuaManager_Override) == 0x000018, "Wrong size on UnLuaManager_Override");
static_assert(offsetof(UnLuaManager_Override, Param_Class) == 0x000000, "Member 'UnLuaManager_Override::Param_Class' has a wrong offset!");
static_assert(offsetof(UnLuaManager_Override, FunctionName) == 0x000008, "Member 'UnLuaManager_Override::FunctionName' has a wrong offset!");
static_assert(offsetof(UnLuaManager_Override, LuaFunctionName) == 0x000010, "Member 'UnLuaManager_Override::LuaFunctionName' has a wrong offset!");

}

