#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UtilGEFunctionLibrary

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UtilGEFunctionLibrary.UtilGEFunctionLibrary_C.Full Recover Self
// 0x0028 (0x0028 - 0x0000)
struct UtilGEFunctionLibrary_C_Full_Recover_Self final
{
public:
	class ALyraCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilGEFunctionLibrary_C_Full_Recover_Self) == 0x000008, "Wrong alignment on UtilGEFunctionLibrary_C_Full_Recover_Self");
static_assert(sizeof(UtilGEFunctionLibrary_C_Full_Recover_Self) == 0x000028, "Wrong size on UtilGEFunctionLibrary_C_Full_Recover_Self");
static_assert(offsetof(UtilGEFunctionLibrary_C_Full_Recover_Self, Character) == 0x000000, "Member 'UtilGEFunctionLibrary_C_Full_Recover_Self::Character' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Full_Recover_Self, __WorldContext) == 0x000008, "Member 'UtilGEFunctionLibrary_C_Full_Recover_Self::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Full_Recover_Self, CallFunc_GetLyraAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'UtilGEFunctionLibrary_C_Full_Recover_Self::CallFunc_GetLyraAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Full_Recover_Self, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UtilGEFunctionLibrary_C_Full_Recover_Self::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Full_Recover_Self, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'UtilGEFunctionLibrary_C_Full_Recover_Self::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Full_Recover_Self, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00001C, "Member 'UtilGEFunctionLibrary_C_Full_Recover_Self::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function UtilGEFunctionLibrary.UtilGEFunctionLibrary_C.Kill Self
// 0x00F0 (0x00F0 - 0x0000)
struct UtilGEFunctionLibrary_C_Kill_Self final
{
public:
	class ALyraCharacter*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NoRebirth;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Times;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0070(0x0020)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveLooseGameplayTags_ReturnValue;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00B8(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UtilGEFunctionLibrary_C_Kill_Self) == 0x000008, "Wrong alignment on UtilGEFunctionLibrary_C_Kill_Self");
static_assert(sizeof(UtilGEFunctionLibrary_C_Kill_Self) == 0x0000F0, "Wrong size on UtilGEFunctionLibrary_C_Kill_Self");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, Character) == 0x000000, "Member 'UtilGEFunctionLibrary_C_Kill_Self::Character' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, NoRebirth) == 0x000008, "Member 'UtilGEFunctionLibrary_C_Kill_Self::NoRebirth' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, __WorldContext) == 0x000010, "Member 'UtilGEFunctionLibrary_C_Kill_Self::__WorldContext' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, Times) == 0x000018, "Member 'UtilGEFunctionLibrary_C_Kill_Self::Times' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_GetGameState_ReturnValue) == 0x000020, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, K2Node_DynamicCast_AsLyra_Game_State) == 0x000030, "Member 'UtilGEFunctionLibrary_C_Kill_Self::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UtilGEFunctionLibrary_C_Kill_Self::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_GetLyraAbilitySystemComponent_ReturnValue) == 0x000040, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_GetLyraAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_GetLyraAbilitySystemComponent_ReturnValue_1) == 0x000048, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_GetLyraAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_IsValid_ReturnValue_3) == 0x000051, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000054, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, K2Node_MakeArray_Array) == 0x000060, "Member 'UtilGEFunctionLibrary_C_Kill_Self::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000070, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_RemoveLooseGameplayTags_ReturnValue) == 0x000091, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_RemoveLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000098, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0000A8, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, Temp_int_Variable) == 0x0000B0, "Member 'UtilGEFunctionLibrary_C_Kill_Self::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000B8, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x0000D8, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0000E8, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_AddLooseGameplayTags_ReturnValue) == 0x0000E9, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_AddLooseGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_Not_PreBool_ReturnValue) == 0x0000EA, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UtilGEFunctionLibrary_C_Kill_Self, CallFunc_BooleanAND_ReturnValue_1) == 0x0000EB, "Member 'UtilGEFunctionLibrary_C_Kill_Self::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

