#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OverallUILayout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OverallUILayout.W_OverallUILayout_C
// 0x0040 (0x0368 - 0x0328)
class UW_OverallUILayout_C final : public UPrimaryGameLayout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActivatableWidgetStack*          GameLayer0_Stack;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          GameLayer1_Stack;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          GameLayer2_Stack;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          GameLayer_Stack;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          GameMenu_Stack;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          Menu_Stack;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          Modal_Stack;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_OverallUILayout(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_OverallUILayout_C">();
	}
	static class UW_OverallUILayout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_OverallUILayout_C>();
	}
};
static_assert(alignof(UW_OverallUILayout_C) == 0x000008, "Wrong alignment on UW_OverallUILayout_C");
static_assert(sizeof(UW_OverallUILayout_C) == 0x000368, "Wrong size on UW_OverallUILayout_C");
static_assert(offsetof(UW_OverallUILayout_C, UberGraphFrame) == 0x000328, "Member 'UW_OverallUILayout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OverallUILayout_C, GameLayer0_Stack) == 0x000330, "Member 'UW_OverallUILayout_C::GameLayer0_Stack' has a wrong offset!");
static_assert(offsetof(UW_OverallUILayout_C, GameLayer1_Stack) == 0x000338, "Member 'UW_OverallUILayout_C::GameLayer1_Stack' has a wrong offset!");
static_assert(offsetof(UW_OverallUILayout_C, GameLayer2_Stack) == 0x000340, "Member 'UW_OverallUILayout_C::GameLayer2_Stack' has a wrong offset!");
static_assert(offsetof(UW_OverallUILayout_C, GameLayer_Stack) == 0x000348, "Member 'UW_OverallUILayout_C::GameLayer_Stack' has a wrong offset!");
static_assert(offsetof(UW_OverallUILayout_C, GameMenu_Stack) == 0x000350, "Member 'UW_OverallUILayout_C::GameMenu_Stack' has a wrong offset!");
static_assert(offsetof(UW_OverallUILayout_C, Menu_Stack) == 0x000358, "Member 'UW_OverallUILayout_C::Menu_Stack' has a wrong offset!");
static_assert(offsetof(UW_OverallUILayout_C, Modal_Stack) == 0x000360, "Member 'UW_OverallUILayout_C::Modal_Stack' has a wrong offset!");

}

