#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_Attribute_Tips_Talent

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_Inventory_Attribute_Tips_Talent.WBP_TgfGame_Inventory_Attribute_Tips_Talent_C
// 0x00A0 (0x0318 - 0x0278)
class UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg;                                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DescPanel;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   NameText;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_157;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ValueText;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_66;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemTooltips_Talentline_C*         WBP_ItemTooltips_Talentline;                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C* WBP_TgfGame_Inventory_Attribute_Tips_TalentItem0;  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C* WBP_TgfGame_Inventory_Attribute_Tips_TalentItem1;  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            Parent_Cell;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tgf_Skill_Base_C*                  Skill;                                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Skill_Id;                                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_TGF_Skill_Base_C*                   Skill_Base;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_ItemTooltips_Talentline_C*> DescribeLines;                                     // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C*> TalentLines;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         OffsetX;                                           // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Talent(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetUp(class UUserWidget* Parent_cell, const struct FRoleDisplayAttribute& Attr_config, double Value, TArray<struct FTgfCareerTalentCfgItem>& Talents);
	void SetupBySkillBase(class UWBP_Tgf_Skill_Base_C* Param_Skill, class UUserWidget* Parent_cell, class UGA_TGF_Skill_Base_C* Skill_base);
	void ShowTooltip();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePos();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_Inventory_Attribute_Tips_Talent_C">();
	}
	static class UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C");
static_assert(sizeof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C) == 0x000318, "Wrong size on UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, UberGraphFrame) == 0x000278, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, Bg) == 0x000280, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, DescPanel) == 0x000288, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::DescPanel' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, Line) == 0x000290, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, NameText) == 0x000298, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, SizeBox_157) == 0x0002A0, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::SizeBox_157' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, ValueText) == 0x0002A8, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::ValueText' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, VerticalBox_66) == 0x0002B0, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::VerticalBox_66' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, WBP_ItemTooltips_Talentline) == 0x0002B8, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::WBP_ItemTooltips_Talentline' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, WBP_TgfGame_Inventory_Attribute_Tips_TalentItem0) == 0x0002C0, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::WBP_TgfGame_Inventory_Attribute_Tips_TalentItem0' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, WBP_TgfGame_Inventory_Attribute_Tips_TalentItem1) == 0x0002C8, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::WBP_TgfGame_Inventory_Attribute_Tips_TalentItem1' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, Parent_Cell) == 0x0002D0, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::Parent_Cell' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, Skill) == 0x0002D8, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::Skill' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, Skill_Id) == 0x0002E0, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::Skill_Id' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, Skill_Base) == 0x0002E8, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::Skill_Base' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, DescribeLines) == 0x0002F0, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::DescribeLines' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, TalentLines) == 0x000300, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::TalentLines' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C, OffsetX) == 0x000310, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C::OffsetX' has a wrong offset!");

}

