#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_CommonKey

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_CommonKey.WBP_TgfGame_CommonKey_C.ExecuteUbergraph_WBP_TgfGame_CommonKey
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FKeyBindingChangeMessage               Temp_struct_Variable;                              // 0x0018(0x0018)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyBindingChangeMessage               Temp_struct_Variable_2;                            // 0x0060(0x0018)()
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputAction*                     CallFunc_FindInputActionForTag_ReturnValue;        // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetCommonInputSubsystem_ReturnValue;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GameWidgetGetAbilitySystemComponentFromActor_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey) == 0x000008, "Wrong alignment on WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey");
static_assert(sizeof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey) == 0x0000C8, "Wrong size on WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, K2Node_CustomEvent_ProxyObject) == 0x000008, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, K2Node_CustomEvent_ActualChannel) == 0x000010, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, Temp_struct_Variable) == 0x000018, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, Temp_struct_Variable_1) == 0x000030, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, Temp_object_Variable) == 0x000038, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000040, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, Temp_struct_Variable_2) == 0x000060, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_GetPayload_ReturnValue) == 0x000078, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_FindInputActionForTag_ReturnValue) == 0x000090, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_FindInputActionForTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, K2Node_CustomEvent_bNewInputType) == 0x000098, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_GetCommonInputSubsystem_ReturnValue) == 0x0000A0, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_GetCommonInputSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A8, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_K2_GetPawn_ReturnValue) == 0x0000B0, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_GameWidgetGetAbilitySystemComponentFromActor_ReturnValue) == 0x0000B8, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_GameWidgetGetAbilitySystemComponentFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey, CallFunc_IsValid_ReturnValue_2) == 0x0000C1, "Member 'WBP_TgfGame_CommonKey_C_ExecuteUbergraph_WBP_TgfGame_CommonKey::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_TgfGame_CommonKey.WBP_TgfGame_CommonKey_C.InputMethodChange
// 0x0001 (0x0001 - 0x0000)
struct WBP_TgfGame_CommonKey_C_InputMethodChange final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_CommonKey_C_InputMethodChange) == 0x000001, "Wrong alignment on WBP_TgfGame_CommonKey_C_InputMethodChange");
static_assert(sizeof(WBP_TgfGame_CommonKey_C_InputMethodChange) == 0x000001, "Wrong size on WBP_TgfGame_CommonKey_C_InputMethodChange");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_InputMethodChange, bNewInputType) == 0x000000, "Member 'WBP_TgfGame_CommonKey_C_InputMethodChange::bNewInputType' has a wrong offset!");

// Function WBP_TgfGame_CommonKey.WBP_TgfGame_CommonKey_C.OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E
// 0x0010 (0x0010 - 0x0000)
struct WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E) == 0x000008, "Wrong alignment on WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E");
static_assert(sizeof(WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E) == 0x000010, "Wrong size on WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E, ProxyObject) == 0x000000, "Member 'WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E::ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E, ActualChannel) == 0x000008, "Member 'WBP_TgfGame_CommonKey_C_OnMessageReceived_3C45226D4FD71D23B5532DAA8815BB6E::ActualChannel' has a wrong offset!");

// Function WBP_TgfGame_CommonKey.WBP_TgfGame_CommonKey_C.SetKey
// 0x0038 (0x0038 - 0x0000)
struct WBP_TgfGame_CommonKey_C_SetKey final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraLocalPlayer*                       K2Node_DynamicCast_AsLyra_Local_Player;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetInputKeyByInputAction_ReturnValue;     // 0x0020(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_CommonKey_C_SetKey) == 0x000008, "Wrong alignment on WBP_TgfGame_CommonKey_C_SetKey");
static_assert(sizeof(WBP_TgfGame_CommonKey_C_SetKey) == 0x000038, "Wrong size on WBP_TgfGame_CommonKey_C_SetKey");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_SetKey, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_TgfGame_CommonKey_C_SetKey::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_SetKey, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000008, "Member 'WBP_TgfGame_CommonKey_C_SetKey::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_SetKey, K2Node_DynamicCast_AsLyra_Local_Player) == 0x000010, "Member 'WBP_TgfGame_CommonKey_C_SetKey::K2Node_DynamicCast_AsLyra_Local_Player' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_SetKey, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TgfGame_CommonKey_C_SetKey::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_CommonKey_C_SetKey, CallFunc_GetInputKeyByInputAction_ReturnValue) == 0x000020, "Member 'WBP_TgfGame_CommonKey_C_SetKey::CallFunc_GetInputKeyByInputAction_ReturnValue' has a wrong offset!");

}

