#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuideSubItem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "TGFGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuideSubItem.WBP_GuideSubItem_C
// 0x00B0 (0x0328 - 0x0278)
class UWBP_GuideSubItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Tgf_Button_C*                      Click;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SheetName;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   RawName;                                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuideConfigRow                        MyGuideConfig;                                     // 0x02A8(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_GuideWindow_C*                     Wbp;                                               // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GuideSubItem_Click_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_GuideSubItem(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Set_Data(class FName Param_RawName, class UWBP_GuideWindow_C* Param_Wbp);
	void SetSelectState(class FName SelectId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuideSubItem_C">();
	}
	static class UWBP_GuideSubItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuideSubItem_C>();
	}
};
static_assert(alignof(UWBP_GuideSubItem_C) == 0x000008, "Wrong alignment on UWBP_GuideSubItem_C");
static_assert(sizeof(UWBP_GuideSubItem_C) == 0x000328, "Wrong size on UWBP_GuideSubItem_C");
static_assert(offsetof(UWBP_GuideSubItem_C, UberGraphFrame) == 0x000278, "Member 'UWBP_GuideSubItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GuideSubItem_C, Click) == 0x000280, "Member 'UWBP_GuideSubItem_C::Click' has a wrong offset!");
static_assert(offsetof(UWBP_GuideSubItem_C, Hover) == 0x000288, "Member 'UWBP_GuideSubItem_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_GuideSubItem_C, Select) == 0x000290, "Member 'UWBP_GuideSubItem_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_GuideSubItem_C, SheetName) == 0x000298, "Member 'UWBP_GuideSubItem_C::SheetName' has a wrong offset!");
static_assert(offsetof(UWBP_GuideSubItem_C, RawName) == 0x0002A0, "Member 'UWBP_GuideSubItem_C::RawName' has a wrong offset!");
static_assert(offsetof(UWBP_GuideSubItem_C, MyGuideConfig) == 0x0002A8, "Member 'UWBP_GuideSubItem_C::MyGuideConfig' has a wrong offset!");
static_assert(offsetof(UWBP_GuideSubItem_C, Wbp) == 0x000320, "Member 'UWBP_GuideSubItem_C::Wbp' has a wrong offset!");

}

