#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemTooltips_Buffline

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ItemTooltips_Buffline.WBP_ItemTooltips_Buffline_C.ExecuteUbergraph_WBP_ItemTooltips_Buffline
// 0x0008 (0x0008 - 0x0000)
struct WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline) == 0x000004, "Wrong alignment on WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline");
static_assert(sizeof(WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline) == 0x000008, "Wrong size on WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline");
static_assert(offsetof(WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline, EntryPoint) == 0x000000, "Member 'WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_ItemTooltips_Buffline_C_ExecuteUbergraph_WBP_ItemTooltips_Buffline::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ItemTooltips_Buffline.WBP_ItemTooltips_Buffline_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ItemTooltips_Buffline_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemTooltips_Buffline_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ItemTooltips_Buffline_C_PreConstruct");
static_assert(sizeof(WBP_ItemTooltips_Buffline_C_PreConstruct) == 0x000001, "Wrong size on WBP_ItemTooltips_Buffline_C_PreConstruct");
static_assert(offsetof(WBP_ItemTooltips_Buffline_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ItemTooltips_Buffline_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

