#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGameMenu

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.ExecuteUbergraph_WBP_TgfGameMenu
// 0x0130 (0x0130 - 0x0000)
struct WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_OpenGuideWindow_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_OpenSettingWindow_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSpectatorMode_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPVPMatchType_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_1;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_2;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputAction*>                   K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_3;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x00A8(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_Vector2DVector2D_ReturnValue;    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawnFromObject_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraPlayerState*                       CallFunc_GetLyraPlayerState_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEscapeQuit_ReturnValue;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu");
static_assert(sizeof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu) == 0x000130, "Wrong size on WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, EntryPoint) == 0x000000, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_OpenGuideWindow_ReturnValue) == 0x000008, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_OpenGuideWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_OpenSettingWindow_ReturnValue) == 0x000010, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_OpenSettingWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_AsLyra_Player_Controller) == 0x000020, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_AsLyra_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetSpectatorMode_ReturnValue) == 0x000029, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetSpectatorMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_AsLyra_Game_State) == 0x000038, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_IsPVPMatchType_ReturnValue) == 0x000041, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_IsPVPMatchType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000042, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000048, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_AsLyra_Player_Controller_1) == 0x000058, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_AsLyra_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000068, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_AsLyra_Player_Controller_2) == 0x000070, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_AsLyra_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x000080, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_AsLyra_Player_Controller_3) == 0x000098, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_AsLyra_Player_Controller_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_Event_IsDesignTime) == 0x0000A1, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x0000A8, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetAbsoluteSize_ReturnValue) == 0x0000E8, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_NotEqual_Vector2DVector2D_ReturnValue) == 0x0000F8, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_NotEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetOwningPlayer_ReturnValue_4) == 0x000100, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetOwningPlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetPawnFromObject_ReturnValue) == 0x000108, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetPawnFromObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_AsLyra_Character) == 0x000110, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, K2Node_DynamicCast_bSuccess_5) == 0x000118, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_IsDeadOrDying_ReturnValue) == 0x000119, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetLyraPlayerState_ReturnValue) == 0x000120, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetLyraPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_GetIsEscapeQuit_ReturnValue) == 0x000128, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_GetIsEscapeQuit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu, CallFunc_BooleanOR_ReturnValue_1) == 0x000129, "Member 'WBP_TgfGameMenu_C_ExecuteUbergraph_WBP_TgfGameMenu::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.InitButtons
// 0x0020 (0x0020 - 0x0000)
struct WBP_TgfGameMenu_C_InitButtons final
{
public:
	TArray<class UWBP_Common_Button_Long_C*>      K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_Common_Button_Long_C*>      K2Node_MakeArray_Array_1;                          // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_TgfGameMenu_C_InitButtons) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_InitButtons");
static_assert(sizeof(WBP_TgfGameMenu_C_InitButtons) == 0x000020, "Wrong size on WBP_TgfGameMenu_C_InitButtons");
static_assert(offsetof(WBP_TgfGameMenu_C_InitButtons, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_TgfGameMenu_C_InitButtons::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_InitButtons, K2Node_MakeArray_Array_1) == 0x000010, "Member 'WBP_TgfGameMenu_C_InitButtons::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.On_Mask_MouseButtonDown
// 0x0248 (0x0248 - 0x0000)
struct WBP_TgfGameMenu_C_On_Mask_MouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0190(0x00B8)()
};
static_assert(alignof(WBP_TgfGameMenu_C_On_Mask_MouseButtonDown) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_On_Mask_MouseButtonDown");
static_assert(sizeof(WBP_TgfGameMenu_C_On_Mask_MouseButtonDown) == 0x000248, "Wrong size on WBP_TgfGameMenu_C_On_Mask_MouseButtonDown");
static_assert(offsetof(WBP_TgfGameMenu_C_On_Mask_MouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_TgfGameMenu_C_On_Mask_MouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_On_Mask_MouseButtonDown, MouseEvent) == 0x000040, "Member 'WBP_TgfGameMenu_C_On_Mask_MouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_On_Mask_MouseButtonDown, ReturnValue) == 0x0000D8, "Member 'WBP_TgfGameMenu_C_On_Mask_MouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_On_Mask_MouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000190, "Member 'WBP_TgfGameMenu_C_On_Mask_MouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.OnKeyDown
// 0x0388 (0x0388 - 0x0000)
struct WBP_TgfGameMenu_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0218(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02D0(0x00B8)()
};
static_assert(alignof(WBP_TgfGameMenu_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_OnKeyDown");
static_assert(sizeof(WBP_TgfGameMenu_C_OnKeyDown) == 0x000388, "Wrong size on WBP_TgfGameMenu_C_OnKeyDown");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_TgfGameMenu_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, InKeyEvent) == 0x000040, "Member 'WBP_TgfGameMenu_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, ReturnValue) == 0x000080, "Member 'WBP_TgfGameMenu_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, Temp_bool_Variable) == 0x000138, "Member 'WBP_TgfGameMenu_C_OnKeyDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'WBP_TgfGameMenu_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000158, "Member 'WBP_TgfGameMenu_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'WBP_TgfGameMenu_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000218, "Member 'WBP_TgfGameMenu_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyDown, K2Node_Select_Default) == 0x0002D0, "Member 'WBP_TgfGameMenu_C_OnKeyDown::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.OnKeyUp
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_TgfGameMenu_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0138(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0158(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0210(0x00B8)()
};
static_assert(alignof(WBP_TgfGameMenu_C_OnKeyUp) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_OnKeyUp");
static_assert(sizeof(WBP_TgfGameMenu_C_OnKeyUp) == 0x0002C8, "Wrong size on WBP_TgfGameMenu_C_OnKeyUp");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'WBP_TgfGameMenu_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, InKeyEvent) == 0x000040, "Member 'WBP_TgfGameMenu_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, ReturnValue) == 0x000080, "Member 'WBP_TgfGameMenu_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000138, "Member 'WBP_TgfGameMenu_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000150, "Member 'WBP_TgfGameMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000151, "Member 'WBP_TgfGameMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue) == 0x000152, "Member 'WBP_TgfGameMenu_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000158, "Member 'WBP_TgfGameMenu_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000210, "Member 'WBP_TgfGameMenu_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TgfGameMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGameMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TgfGameMenu_C_PreConstruct");
static_assert(sizeof(WBP_TgfGameMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_TgfGameMenu_C_PreConstruct");
static_assert(offsetof(WBP_TgfGameMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TgfGameMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.SendSelfQuitReport
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_TgfGameMenu_C_SendSelfQuitReport final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraGameState*                         K2Node_DynamicCast_AsLyra_Game_State;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfNpcStateManagerComponent*           CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfNpcState*                           CallFunc_GetCurrentState_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FReportRecord                          K2Node_MakeStruct_ReportRecord;                    // 0x0058(0x0090)()
};
static_assert(alignof(WBP_TgfGameMenu_C_SendSelfQuitReport) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_SendSelfQuitReport");
static_assert(sizeof(WBP_TgfGameMenu_C_SendSelfQuitReport) == 0x0000E8, "Wrong size on WBP_TgfGameMenu_C_SendSelfQuitReport");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, K2Node_DynamicCast_AsLyra_Game_State) == 0x000008, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::K2Node_DynamicCast_AsLyra_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_GetCurrentState_ReturnValue) == 0x000028, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_GetObjectClass_ReturnValue) == 0x000040, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, CallFunc_GetClassDisplayName_ReturnValue) == 0x000048, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SendSelfQuitReport, K2Node_MakeStruct_ReportRecord) == 0x000058, "Member 'WBP_TgfGameMenu_C_SendSelfQuitReport::K2Node_MakeStruct_ReportRecord' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.SetAppVersion
// 0x0028 (0x0028 - 0x0000)
struct WBP_TgfGameMenu_C_SetAppVersion final
{
public:
	class FString                                 CallFunc_GetAppVersion_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_TgfGameMenu_C_SetAppVersion) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_SetAppVersion");
static_assert(sizeof(WBP_TgfGameMenu_C_SetAppVersion) == 0x000028, "Wrong size on WBP_TgfGameMenu_C_SetAppVersion");
static_assert(offsetof(WBP_TgfGameMenu_C_SetAppVersion, CallFunc_GetAppVersion_ReturnValue) == 0x000000, "Member 'WBP_TgfGameMenu_C_SetAppVersion::CallFunc_GetAppVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_SetAppVersion, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_TgfGameMenu_C_SetAppVersion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.SetTriggerBySpectate
// 0x0001 (0x0001 - 0x0000)
struct WBP_TgfGameMenu_C_SetTriggerBySpectate final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGameMenu_C_SetTriggerBySpectate) == 0x000001, "Wrong alignment on WBP_TgfGameMenu_C_SetTriggerBySpectate");
static_assert(sizeof(WBP_TgfGameMenu_C_SetTriggerBySpectate) == 0x000001, "Wrong size on WBP_TgfGameMenu_C_SetTriggerBySpectate");
static_assert(offsetof(WBP_TgfGameMenu_C_SetTriggerBySpectate, Value) == 0x000000, "Member 'WBP_TgfGameMenu_C_SetTriggerBySpectate::Value' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.SetVisility
// 0x0001 (0x0001 - 0x0000)
struct WBP_TgfGameMenu_C_SetVisility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGameMenu_C_SetVisility) == 0x000001, "Wrong alignment on WBP_TgfGameMenu_C_SetVisility");
static_assert(sizeof(WBP_TgfGameMenu_C_SetVisility) == 0x000001, "Wrong size on WBP_TgfGameMenu_C_SetVisility");
static_assert(offsetof(WBP_TgfGameMenu_C_SetVisility, Visible) == 0x000000, "Member 'WBP_TgfGameMenu_C_SetVisility::Visible' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.UpdateState
// 0x0088 (0x0088 - 0x0000)
struct WBP_TgfGameMenu_C_UpdateState final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Common_Button_Long_C*              CallFunc_Array_Get_Item_2;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              CallFunc_Array_Get_Item_3;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AB_TGF_GameMode_Onboarding_C*           K2Node_DynamicCast_AsB_TGF_Game_Mode_Onboarding;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGameMenu_C_UpdateState) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_UpdateState");
static_assert(sizeof(WBP_TgfGameMenu_C_UpdateState) == 0x000088, "Wrong size on WBP_TgfGameMenu_C_UpdateState");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Loop_Counter_Variable_2) == 0x000010, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Loop_Counter_Variable_3) == 0x000024, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Add_IntInt_ReturnValue_3) == 0x000028, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'WBP_TgfGameMenu_C_UpdateState::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Less_IntInt_ReturnValue_1) == 0x000049, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Get_Item_2) == 0x000050, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Get_Item_3) == 0x000058, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Length_ReturnValue_2) == 0x000060, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Array_Length_ReturnValue_3) == 0x000064, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Less_IntInt_ReturnValue_2) == 0x000068, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_Less_IntInt_ReturnValue_3) == 0x000069, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, CallFunc_GetGameMode_ReturnValue) == 0x000070, "Member 'WBP_TgfGameMenu_C_UpdateState::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, K2Node_DynamicCast_AsB_TGF_Game_Mode_Onboarding) == 0x000078, "Member 'WBP_TgfGameMenu_C_UpdateState::K2Node_DynamicCast_AsB_TGF_Game_Mode_Onboarding' has a wrong offset!");
static_assert(offsetof(WBP_TgfGameMenu_C_UpdateState, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_TgfGameMenu_C_UpdateState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TgfGameMenu.WBP_TgfGameMenu_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGameMenu_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGameMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_TgfGameMenu_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_TgfGameMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_TgfGameMenu_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_TgfGameMenu_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_TgfGameMenu_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

