#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_Attribute_ListItem2

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_Inventory_Attribute_ListItem2.WBP_TgfGame_Inventory_Attribute_ListItem2_C.ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2
// 0x0508 (0x0508 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_AttrName;                       // 0x0008(0x0018)()
	double                                        K2Node_CustomEvent_curValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_baseValue;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_precent;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_int;                            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_maxValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnRoleDisplayAttribueID                       K2Node_CustomEvent_attribut_id;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0118(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0168(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F0(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0208(0x0018)()
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0228(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0240(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0290(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02A0(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x02B8(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x02F8(0x0098)(ConstParm)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRoleDisplayAttribute                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x03B8(0x00B0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0470(0x0098)(ConstParm)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2) == 0x000508, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_CustomEvent_AttrName) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_CustomEvent_AttrName' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_CustomEvent_curValue) == 0x000020, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_CustomEvent_curValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_CustomEvent_baseValue) == 0x000028, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_CustomEvent_baseValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_CustomEvent_precent) == 0x000030, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_CustomEvent_precent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_CustomEvent_int) == 0x000031, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_CustomEvent_int' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_CustomEvent_maxValue) == 0x000038, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_CustomEvent_maxValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_CustomEvent_attribut_id) == 0x000040, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_CustomEvent_attribut_id' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Round_ReturnValue) == 0x0000B0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000110, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeStruct_FormatArgumentData_2) == 0x000118, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeStruct_FormatArgumentData_3) == 0x000168, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeArray_Array) == 0x0001B8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeArray_Array_1) == 0x0001C8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Format_ReturnValue) == 0x0001D8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Format_ReturnValue_1) == 0x0001F0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000208, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Round_ReturnValue_1) == 0x000220, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Conv_IntToText_ReturnValue) == 0x000228, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeStruct_FormatArgumentData_4) == 0x000240, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_MakeArray_Array_2) == 0x000290, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Format_ReturnValue_2) == 0x0002A0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_Event_MyGeometry) == 0x0002B8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_Event_MouseEvent_1) == 0x0002F8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_MakeLiteralString_ReturnValue) == 0x000390, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Concat_StrStr_ReturnValue) == 0x0003A0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_Conv_StringToName_ReturnValue) == 0x0003B0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_GetDataTableRowFromName_OutRow) == 0x0003B8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000468, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2, K2Node_Event_MouseEvent) == 0x000470, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem2::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem2.WBP_TgfGame_Inventory_Attribute_ListItem2_C.InitTooltips
// 0x0038 (0x0038 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips final
{
public:
	class FText                                   Attr_name;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Total_value;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        base_value;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_Attribute_Tips_Status_C* CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips) == 0x000038, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, Attr_name) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::Attr_name' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, Total_value) == 0x000018, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::Total_value' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, base_value) == 0x000020, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::base_value' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_Array_IsEmpty_ReturnValue) == 0x000030, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000032, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000033, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_BooleanOR_ReturnValue) == 0x000034, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_BooleanOR_ReturnValue_1) == 0x000035, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips, CallFunc_BooleanOR_ReturnValue_2) == 0x000036, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_InitTooltips::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem2.WBP_TgfGame_Inventory_Attribute_ListItem2_C.OnMouseEnter
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter) == 0x0000D8, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem2.WBP_TgfGame_Inventory_Attribute_ListItem2_C.OnMouseLeave
// 0x0098 (0x0098 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseLeave");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseLeave) == 0x000098, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseLeave");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem2.WBP_TgfGame_Inventory_Attribute_ListItem2_C.SetUp
// 0x0040 (0x0040 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp final
{
public:
	class FText                                   Param_AttrName;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Param_CurValue;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_BaseValue;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Precent;                                           // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Int;                                               // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxValue;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnRoleDisplayAttribueID                       Attribut_id;                                       // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp) == 0x000040, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp, Param_AttrName) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp::Param_AttrName' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp, Param_CurValue) == 0x000018, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp::Param_CurValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp, Param_BaseValue) == 0x000020, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp::Param_BaseValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp, Precent) == 0x000028, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp::Precent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp, Int) == 0x000029, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp::Int' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp, MaxValue) == 0x000030, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp::MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp, Attribut_id) == 0x000038, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_SetUp::Attribut_id' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem2.WBP_TgfGame_Inventory_Attribute_ListItem2_C.Setup By Cofnig
// 0x0348 (0x0348 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig final
{
public:
	struct FRoleDisplayAttribute                  Attr_config;                                       // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Param_CurValue;                                    // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_BaseValue;                                   // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxValue;                                          // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0168(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0218(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0230(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0280(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02D0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02F0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0308(0x0018)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x0330(0x0018)()
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig) == 0x000348, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, Attr_config) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::Attr_config' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, Param_CurValue) == 0x0000B0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::Param_CurValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, Param_BaseValue) == 0x0000B8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::Param_BaseValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, MaxValue) == 0x0000C0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000168, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeArray_Array) == 0x000180, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Format_ReturnValue) == 0x000190, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Round_ReturnValue) == 0x0001AC, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001B0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001B8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Round_ReturnValue_1) == 0x000208, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000210, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Conv_IntToText_ReturnValue) == 0x000218, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeStruct_FormatArgumentData_3) == 0x000230, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeStruct_FormatArgumentData_4) == 0x000280, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeArray_Array_1) == 0x0002D0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, K2Node_MakeArray_Array_2) == 0x0002E0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Format_ReturnValue_1) == 0x0002F0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Format_ReturnValue_2) == 0x000308, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_Conv_NameToString_ReturnValue) == 0x000320, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig, CallFunc_TextFromStringTable_ReturnValue) == 0x000330, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_Setup_By_Cofnig::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem2.WBP_TgfGame_Inventory_Attribute_ListItem2_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem2_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem2_C_GetModuleName");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_GetModuleName) == 0x000010, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem2_C_GetModuleName");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem2_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem2_C_GetModuleName::ReturnValue' has a wrong offset!");

}

