#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_InventoryMenu

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.CreateCaptureIn
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_CreateCaptureIn final
{
public:
	class UTextureRenderTarget2D*                 Temp_wildcard_Variable;                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0010(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0100(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Conv_Vector2DToIntPoint_ReturnValue;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SceneCaptureRig_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01D0(0x0050)(HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0230(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0288(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0298(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn) == 0x000010, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_CreateCaptureIn");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn) == 0x0002C0, "Wrong size on WBP_TgfGame_InventoryMenu_C_CreateCaptureIn");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, Temp_wildcard_Variable) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000010, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x0000F8, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_GetCachedGeometry_ReturnValue) == 0x000100, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_GetLocalSize_ReturnValue) == 0x0001A0, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_Conv_Vector2DToIntPoint_ReturnValue) == 0x0001B8, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_Conv_Vector2DToIntPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C0, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001C8, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, K2Node_MakeStruct_FormatArgumentData) == 0x0001D0, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000220, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000228, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, K2Node_MakeStruct_FormatArgumentData_1) == 0x000230, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_IsValid_ReturnValue) == 0x000280, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, K2Node_MakeArray_Array) == 0x000288, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_Format_ReturnValue) == 0x000298, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_CreateCaptureIn, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0002B0, "Member 'WBP_TgfGame_InventoryMenu_C_CreateCaptureIn::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.DropItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_DropItem final
{
public:
	class UDragDropOperation*                     Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_DropItem) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_DropItem");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_DropItem) == 0x000008, "Wrong size on WBP_TgfGame_InventoryMenu_C_DropItem");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_DropItem, Operation) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_DropItem::Operation' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.ExecuteUbergraph_WBP_TgfGame_InventoryMenu
// 0x0130 (0x0130 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetCharacterSectionPositon_LeftTop;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetCharacterSectionPositon_Size;          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent__Controller;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_CustomEvent_Character;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULyraInventoryManagerComponent*         K2Node_CustomEvent_Loot_Inventory;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULyraEquipmentManagerComponent*         K2Node_CustomEvent_Loot_Equipment;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         K2Node_CustomEvent_MyCharacter;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDragDropOperation*                     K2Node_CustomEvent_Operation;                      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x00A0(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              K2Node_MakeStruct_IntPoint_1;                      // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equal_IntPointIntPoint_ReturnValue;       // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TgfGame_SkillIcon_C*               CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu) == 0x000130, "Wrong size on WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_GetCharacterSectionPositon_LeftTop) == 0x000008, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_GetCharacterSectionPositon_LeftTop' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_GetCharacterSectionPositon_Size) == 0x000018, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_GetCharacterSectionPositon_Size' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_CustomEvent__Controller) == 0x000028, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_CustomEvent__Controller' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_CustomEvent_Character) == 0x000030, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_CustomEvent_Loot_Inventory) == 0x000038, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_CustomEvent_Loot_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_CustomEvent_Loot_Equipment) == 0x000040, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_CustomEvent_Loot_Equipment' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_CustomEvent_MyCharacter) == 0x000048, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_CustomEvent_MyCharacter' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_CustomEvent_Operation) == 0x000050, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_CustomEvent_Operation' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_Event_MyGeometry) == 0x000058, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_Event_InDeltaTime) == 0x000098, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x0000A0, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_GetAbsoluteSize_ReturnValue) == 0x0000E8, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_BreakVector2D_X) == 0x0000F8, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_BreakVector2D_Y) == 0x000100, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_FTrunc_ReturnValue) == 0x000108, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_IsValid_ReturnValue_1) == 0x00010C, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_IsValid_ReturnValue_2) == 0x00010D, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_FTrunc_ReturnValue_1) == 0x000110, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_MakeStruct_IntPoint) == 0x000114, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_MakeStruct_IntPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, K2Node_MakeStruct_IntPoint_1) == 0x00011C, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::K2Node_MakeStruct_IntPoint_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_Equal_IntPointIntPoint_ReturnValue) == 0x000124, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_Equal_IntPointIntPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu, CallFunc_Create_ReturnValue) == 0x000128, "Member 'WBP_TgfGame_InventoryMenu_C_ExecuteUbergraph_WBP_TgfGame_InventoryMenu::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.GetAttributeValue
// 0x0048 (0x0048 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_GetAttributeValue final
{
public:
	EnRoleDisplayAttribueID                       Attribute_id;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Base;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfRecoverAttributeSet*                RecoverAttrSet;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfSpeedAttributeSet*                  SpeedAttrSet;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfAttackAttributeSet*                 AttackAttrSet;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfFirstLevelAttributeSet*             LevelAttrSet;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTgfDefendAttributeSet*                 DefendAttrSet;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_GetAttributeValue");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue) == 0x000048, "Wrong size on WBP_TgfGame_InventoryMenu_C_GetAttributeValue");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, Attribute_id) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::Attribute_id' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, Value) == 0x000008, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, Base) == 0x000010, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::Base' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, Max) == 0x000018, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::Max' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, RecoverAttrSet) == 0x000020, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::RecoverAttrSet' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, SpeedAttrSet) == 0x000028, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::SpeedAttrSet' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, AttackAttrSet) == 0x000030, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::AttackAttrSet' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, LevelAttrSet) == 0x000038, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::LevelAttrSet' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetAttributeValue, DefendAttrSet) == 0x000040, "Member 'WBP_TgfGame_InventoryMenu_C_GetAttributeValue::DefendAttrSet' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.GetCharacterSectionPositon
// 0x0090 (0x0090 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon final
{
public:
	struct FVector2D                              LeftTop;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0020(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon) == 0x000090, "Wrong size on WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon, LeftTop) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon::LeftTop' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon, Size) == 0x000010, "Member 'WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon::Size' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon, CallFunc_GetCachedGeometry_ReturnValue) == 0x000020, "Member 'WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon, CallFunc_LocalToViewport_PixelPosition) == 0x000060, "Member 'WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon, CallFunc_LocalToViewport_ViewportPosition) == 0x000070, "Member 'WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon, CallFunc_GetAbsoluteSize_ReturnValue) == 0x000080, "Member 'WBP_TgfGame_InventoryMenu_C_GetCharacterSectionPositon::CallFunc_GetAbsoluteSize_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.GetInventoryContext
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_GetInventoryContext final
{
public:
	class UTgfInventoryWrapper*                   InventoryContextNew;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_GetInventoryContext) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_GetInventoryContext");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_GetInventoryContext) == 0x000008, "Wrong size on WBP_TgfGame_InventoryMenu_C_GetInventoryContext");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_GetInventoryContext, InventoryContextNew) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_GetInventoryContext::InventoryContextNew' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.IsCloseKey
// 0x0048 (0x0048 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_IsCloseKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetInputKey_Key;                          // 0x0028(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_IsCloseKey) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_IsCloseKey");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_IsCloseKey) == 0x000048, "Wrong size on WBP_TgfGame_InventoryMenu_C_IsCloseKey");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, Key) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::Key' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, Result) == 0x000018, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::Result' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x00001C, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000024, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000025, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_GetInputKey_Key) == 0x000028, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_GetInputKey_Key' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x000040, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_GetCurrentInputType_ReturnValue) == 0x000041, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_BooleanOR_ReturnValue) == 0x000042, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_IsCloseKey, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000043, "Member 'WBP_TgfGame_InventoryMenu_C_IsCloseKey::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.OnDragEnter
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0040(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_OnDragEnter) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_OnDragEnter");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_OnDragEnter) == 0x0000E0, "Wrong size on WBP_TgfGame_InventoryMenu_C_OnDragEnter");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnDragEnter, PointerEvent) == 0x000040, "Member 'WBP_TgfGame_InventoryMenu_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnDragEnter, Operation) == 0x0000D8, "Member 'WBP_TgfGame_InventoryMenu_C_OnDragEnter::Operation' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.OnDrop
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0040(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_OnDrop) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_OnDrop");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_OnDrop) == 0x0000E8, "Wrong size on WBP_TgfGame_InventoryMenu_C_OnDrop");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnDrop, MyGeometry) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnDrop, PointerEvent) == 0x000040, "Member 'WBP_TgfGame_InventoryMenu_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnDrop, Operation) == 0x0000D8, "Member 'WBP_TgfGame_InventoryMenu_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnDrop, ReturnValue) == 0x0000E0, "Member 'WBP_TgfGame_InventoryMenu_C_OnDrop::ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.OnKeyDown
// 0x05B8 (0x05B8 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0140(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloseKey_Result;                        // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0218(0x00B8)()
	bool                                          Temp_bool_Variable_1;                              // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x02D8(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0390(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x0448(0x00B8)()
	struct FEventReply                            K2Node_Select_Default_1;                           // 0x0500(0x00B8)()
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_OnKeyDown");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_OnKeyDown) == 0x0005B8, "Wrong size on WBP_TgfGame_InventoryMenu_C_OnKeyDown");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, InKeyEvent) == 0x000040, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, ReturnValue) == 0x000080, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, Temp_bool_Variable) == 0x000138, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000140, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000158, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_IsValid_ReturnValue) == 0x000159, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_IsCloseKey_Result) == 0x00015A, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_IsCloseKey_Result' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000218, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, Temp_bool_Variable_1) == 0x0002D0, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_Unhandled_ReturnValue_1) == 0x0002D8, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x000390, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, K2Node_Select_Default) == 0x000448, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyDown, K2Node_Select_Default_1) == 0x000500, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyDown::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.OnKeyUp
// 0x0578 (0x0578 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0138(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01F0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue_1;                     // 0x0210(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_4;          // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloseKey_Result;                        // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0230(0x00B8)()
	TScriptInterface<class ITooltipWidget>        CallFunc_GetItemTooltipWidget_ReturnValue;         // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_ItemToolTips_CompareBattle_C*      K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HaveOwnerList_Ret;                        // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_303[0x1];                                      // 0x0303(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0304(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0314(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0330(0x00B8)()
	TScriptInterface<class ITooltipWidget>        CallFunc_GetItemTooltipWidget_ReturnValue_1;       // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_ItemToolTips_CompareBattle_C*      K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle_1; // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ItemCanCompare_ret;                       // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0403(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_2;                    // 0x0408(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x04C0(0x00B8)()
};
static_assert(alignof(WBP_TgfGame_InventoryMenu_C_OnKeyUp) == 0x000008, "Wrong alignment on WBP_TgfGame_InventoryMenu_C_OnKeyUp");
static_assert(sizeof(WBP_TgfGame_InventoryMenu_C_OnKeyUp) == 0x000578, "Wrong size on WBP_TgfGame_InventoryMenu_C_OnKeyUp");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, InKeyEvent) == 0x000040, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, ReturnValue) == 0x000080, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000138, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x0001F0, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000208, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000209, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x00020A, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_GetKey_ReturnValue_1) == 0x000210, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_GetKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue) == 0x000228, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x000229, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue_1) == 0x00022A, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue_4) == 0x00022B, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue_2) == 0x00022C, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_IsCloseKey_Result) == 0x00022D, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_IsCloseKey_Result' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000230, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_GetItemTooltipWidget_ReturnValue) == 0x0002E8, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_GetItemTooltipWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle) == 0x0002F8, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, K2Node_DynamicCast_bSuccess) == 0x000300, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_HaveOwnerList_Ret) == 0x000301, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_HaveOwnerList_Ret' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_IsVisible_ReturnValue) == 0x000302, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, Temp_delegate_Variable) == 0x000304, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, Temp_delegate_Variable_1) == 0x000314, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_PostEvent_ReturnValue) == 0x000324, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_PostEvent_ReturnValue_1) == 0x000328, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_Handled_ReturnValue_1) == 0x000330, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_GetItemTooltipWidget_ReturnValue_1) == 0x0003E8, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_GetItemTooltipWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle_1) == 0x0003F8, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, K2Node_DynamicCast_bSuccess_1) == 0x000400, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_IsActivated_ReturnValue) == 0x000401, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_ItemCanCompare_ret) == 0x000402, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_ItemCanCompare_ret' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_IsVisible_ReturnValue_1) == 0x000403, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_BooleanAND_ReturnValue) == 0x000404, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_Handled_ReturnValue_2) == 0x000408, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_Handled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_InventoryMenu_C_OnKeyUp, CallFunc_Unhandled_ReturnValue_1) == 0x0004C0, "Member 'WBP_TgfGame_InventoryMenu_C_OnKeyUp::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");

// Function WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C.Set Detail Attribute
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_TgfGame_InventoryMenu_C_Set_Detail_Attribute final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_TgfGame_Inventory_Attribute_ListItem2_C*> AttributeItems;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
