#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginWindow

#include "Basic.hpp"

#include "TGFGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoginWindow.WBP_LoginWindow_C.CheckInputText
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoginWindow_C_CheckInputText final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_CheckInputText) == 0x000001, "Wrong alignment on WBP_LoginWindow_C_CheckInputText");
static_assert(sizeof(WBP_LoginWindow_C_CheckInputText) == 0x000001, "Wrong size on WBP_LoginWindow_C_CheckInputText");
static_assert(offsetof(WBP_LoginWindow_C_CheckInputText, Valid) == 0x000000, "Member 'WBP_LoginWindow_C_CheckInputText::Valid' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.ExecuteUbergraph_WBP_LoginWindow
// 0x0250 (0x0250 - 0x0000)
struct WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USDKAccountService*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOpenId_ReturnValue;                    // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInputText_Valid;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTGFReportRecord                       K2Node_MakeStruct_TGFReportRecord;                 // 0x0028(0x0090)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTGFWindowManager*                      CallFunc_GetWindowManager_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGFWindow*                             CallFunc_OpenWindow_ReturnValue;                   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSavedOpenId_OpenId;                    // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGFEventHandler*                       CallFunc_GetEventHandler_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTGFEventArgs* Args)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTGFWindowManager*                      CallFunc_GetWindowManager_ReturnValue_1;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGFWindow*                             CallFunc_OpenWindow_ReturnValue_1;                 // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x0150(0x0018)()
	class FString                                 CallFunc_GetOpenId_ReturnValue_1;                  // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOpenId_ReturnValue_2;                  // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0188(0x0018)()
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue_1;            // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHttpReportService*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USettingService*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGFWindowManager*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGFWindow*                             CallFunc_OpenWindow_ReturnValue_2;                 // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USDKNoticeService*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSDKNoticeInfo>                 CallFunc_GetNoticeList_NoticeList;                 // 0x01F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetNoticeList_ReturnValue;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTGFWindowManager*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTGFWindow*                             CallFunc_OpenWindow_ReturnValue_3;                 // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USDKNoticeService*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSDKNoticeInfo>                 CallFunc_GetNoticeList_NoticeList_1;               // 0x0230(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetNoticeList_ReturnValue_1;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow");
static_assert(sizeof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow) == 0x000250, "Wrong size on WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, EntryPoint) == 0x000000, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetOpenId_ReturnValue) == 0x000010, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetOpenId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_CheckInputText_Valid) == 0x000020, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_CheckInputText_Valid' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, K2Node_MakeStruct_TGFReportRecord) == 0x000028, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::K2Node_MakeStruct_TGFReportRecord' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetText_ReturnValue) == 0x0000B8, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetWindowManager_ReturnValue) == 0x0000E0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetWindowManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_OpenWindow_ReturnValue) == 0x0000E8, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_OpenWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetSavedOpenId_OpenId) == 0x0000F0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetSavedOpenId_OpenId' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000118, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetEventHandler_ReturnValue) == 0x000120, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetEventHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetWindowManager_ReturnValue_1) == 0x000140, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetWindowManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_OpenWindow_ReturnValue_1) == 0x000148, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_OpenWindow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_TextFromStringTable_ReturnValue) == 0x000150, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetOpenId_ReturnValue_1) == 0x000168, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetOpenId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetOpenId_ReturnValue_2) == 0x000178, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetOpenId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000188, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetPlatformName_ReturnValue) == 0x0001A0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0001B0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetPlatformName_ReturnValue_1) == 0x0001B8, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetPlatformName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0001C8, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_BooleanOR_ReturnValue) == 0x0001C9, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001D0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0001D8, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0001E0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_OpenWindow_ReturnValue_2) == 0x0001E8, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_OpenWindow_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0001F0, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetNoticeList_NoticeList) == 0x0001F8, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetNoticeList_NoticeList' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetNoticeList_ReturnValue) == 0x000208, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetNoticeList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_Array_Length_ReturnValue) == 0x00020C, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000210, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_Greater_IntInt_ReturnValue) == 0x000218, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_OpenWindow_ReturnValue_3) == 0x000220, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_OpenWindow_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000228, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetNoticeList_NoticeList_1) == 0x000230, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetNoticeList_NoticeList_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_GetNoticeList_ReturnValue_1) == 0x000240, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_GetNoticeList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_Array_Length_ReturnValue_1) == 0x000244, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000248, "Member 'WBP_LoginWindow_C_ExecuteUbergraph_WBP_LoginWindow::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.GetDefaultServerItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_LoginWindow_C_GetDefaultServerItem final
{
public:
	class UServerItem*                            ServerItem;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UServerItem*                            CallFunc_GetSavedServerItem_ServerItem;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USelectServerService*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UServerItem*                            CallFunc_GetDefaultServerItem_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_GetDefaultServerItem) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_GetDefaultServerItem");
static_assert(sizeof(WBP_LoginWindow_C_GetDefaultServerItem) == 0x000028, "Wrong size on WBP_LoginWindow_C_GetDefaultServerItem");
static_assert(offsetof(WBP_LoginWindow_C_GetDefaultServerItem, ServerItem) == 0x000000, "Member 'WBP_LoginWindow_C_GetDefaultServerItem::ServerItem' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetDefaultServerItem, CallFunc_GetSavedServerItem_ServerItem) == 0x000008, "Member 'WBP_LoginWindow_C_GetDefaultServerItem::CallFunc_GetSavedServerItem_ServerItem' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetDefaultServerItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_LoginWindow_C_GetDefaultServerItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetDefaultServerItem, CallFunc_GetDefaultServerItem_ReturnValue) == 0x000018, "Member 'WBP_LoginWindow_C_GetDefaultServerItem::CallFunc_GetDefaultServerItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetDefaultServerItem, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_LoginWindow_C_GetDefaultServerItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.GetSavedOpenId
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginWindow_C_GetSavedOpenId final
{
public:
	class FString                                 OpenID;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_GetSavedOpenId) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_GetSavedOpenId");
static_assert(sizeof(WBP_LoginWindow_C_GetSavedOpenId) == 0x000010, "Wrong size on WBP_LoginWindow_C_GetSavedOpenId");
static_assert(offsetof(WBP_LoginWindow_C_GetSavedOpenId, OpenID) == 0x000000, "Member 'WBP_LoginWindow_C_GetSavedOpenId::OpenID' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.GetSavedServerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_LoginWindow_C_GetSavedServerId final
{
public:
	int32                                         ServerId;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_GetSavedServerId) == 0x000004, "Wrong alignment on WBP_LoginWindow_C_GetSavedServerId");
static_assert(sizeof(WBP_LoginWindow_C_GetSavedServerId) == 0x000004, "Wrong size on WBP_LoginWindow_C_GetSavedServerId");
static_assert(offsetof(WBP_LoginWindow_C_GetSavedServerId, ServerId) == 0x000000, "Member 'WBP_LoginWindow_C_GetSavedServerId::ServerId' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.GetSavedServerItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoginWindow_C_GetSavedServerItem final
{
public:
	class UServerItem*                            ServerItem;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USelectServerService*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSavedServerId_ServerId;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UServerItem*                            CallFunc_GetServerItem_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_GetSavedServerItem) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_GetSavedServerItem");
static_assert(sizeof(WBP_LoginWindow_C_GetSavedServerItem) == 0x000020, "Wrong size on WBP_LoginWindow_C_GetSavedServerItem");
static_assert(offsetof(WBP_LoginWindow_C_GetSavedServerItem, ServerItem) == 0x000000, "Member 'WBP_LoginWindow_C_GetSavedServerItem::ServerItem' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetSavedServerItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_LoginWindow_C_GetSavedServerItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetSavedServerItem, CallFunc_GetSavedServerId_ServerId) == 0x000010, "Member 'WBP_LoginWindow_C_GetSavedServerItem::CallFunc_GetSavedServerId_ServerId' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetSavedServerItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_LoginWindow_C_GetSavedServerItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetSavedServerItem, CallFunc_GetServerItem_ReturnValue) == 0x000018, "Member 'WBP_LoginWindow_C_GetSavedServerItem::CallFunc_GetServerItem_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.GetServerUnavailableMessage
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoginWindow_C_GetServerUnavailableMessage final
{
public:
	class FString                                 UserData;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_GetServerUnavailableMessage) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_GetServerUnavailableMessage");
static_assert(sizeof(WBP_LoginWindow_C_GetServerUnavailableMessage) == 0x000020, "Wrong size on WBP_LoginWindow_C_GetServerUnavailableMessage");
static_assert(offsetof(WBP_LoginWindow_C_GetServerUnavailableMessage, UserData) == 0x000000, "Member 'WBP_LoginWindow_C_GetServerUnavailableMessage::UserData' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_GetServerUnavailableMessage, ReturnValue) == 0x000010, "Member 'WBP_LoginWindow_C_GetServerUnavailableMessage::ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.LoadOrCreateSaveGame
// 0x0020 (0x0020 - 0x0000)
struct WBP_LoginWindow_C_LoadOrCreateSaveGame final
{
public:
	class UBP_SaveGame_C*                         CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveGame_C*                         K2Node_DynamicCast_AsBP_Save_Game;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_LoadOrCreateSaveGame) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_LoadOrCreateSaveGame");
static_assert(sizeof(WBP_LoginWindow_C_LoadOrCreateSaveGame) == 0x000020, "Wrong size on WBP_LoginWindow_C_LoadOrCreateSaveGame");
static_assert(offsetof(WBP_LoginWindow_C_LoadOrCreateSaveGame, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000000, "Member 'WBP_LoginWindow_C_LoadOrCreateSaveGame::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_LoadOrCreateSaveGame, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000008, "Member 'WBP_LoginWindow_C_LoadOrCreateSaveGame::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_LoadOrCreateSaveGame, K2Node_DynamicCast_AsBP_Save_Game) == 0x000010, "Member 'WBP_LoginWindow_C_LoadOrCreateSaveGame::K2Node_DynamicCast_AsBP_Save_Game' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_LoadOrCreateSaveGame, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_LoginWindow_C_LoadOrCreateSaveGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.OnCurrentServerChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_LoginWindow_C_OnCurrentServerChanged final
{
public:
	class UTGFEventArgs*                          Args;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTGFCurrentServerChangedEvent*          K2Node_DynamicCast_AsTGFCurrent_Server_Changed_Event; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_OnCurrentServerChanged) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_OnCurrentServerChanged");
static_assert(sizeof(WBP_LoginWindow_C_OnCurrentServerChanged) == 0x000018, "Wrong size on WBP_LoginWindow_C_OnCurrentServerChanged");
static_assert(offsetof(WBP_LoginWindow_C_OnCurrentServerChanged, Args) == 0x000000, "Member 'WBP_LoginWindow_C_OnCurrentServerChanged::Args' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_OnCurrentServerChanged, K2Node_DynamicCast_AsTGFCurrent_Server_Changed_Event) == 0x000008, "Member 'WBP_LoginWindow_C_OnCurrentServerChanged::K2Node_DynamicCast_AsTGFCurrent_Server_Changed_Event' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_OnCurrentServerChanged, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_LoginWindow_C_OnCurrentServerChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SaveGameData
// 0x0001 (0x0001 - 0x0000)
struct WBP_LoginWindow_C_SaveGameData final
{
public:
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_SaveGameData) == 0x000001, "Wrong alignment on WBP_LoginWindow_C_SaveGameData");
static_assert(sizeof(WBP_LoginWindow_C_SaveGameData) == 0x000001, "Wrong size on WBP_LoginWindow_C_SaveGameData");
static_assert(offsetof(WBP_LoginWindow_C_SaveGameData, CallFunc_SaveGameToSlot_ReturnValue) == 0x000000, "Member 'WBP_LoginWindow_C_SaveGameData::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SaveOpenId
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginWindow_C_SaveOpenId final
{
public:
	class FString                                 OpenID;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_SaveOpenId) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_SaveOpenId");
static_assert(sizeof(WBP_LoginWindow_C_SaveOpenId) == 0x000010, "Wrong size on WBP_LoginWindow_C_SaveOpenId");
static_assert(offsetof(WBP_LoginWindow_C_SaveOpenId, OpenID) == 0x000000, "Member 'WBP_LoginWindow_C_SaveOpenId::OpenID' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SaveServerId
// 0x0004 (0x0004 - 0x0000)
struct WBP_LoginWindow_C_SaveServerId final
{
public:
	int32                                         ServerId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_SaveServerId) == 0x000004, "Wrong alignment on WBP_LoginWindow_C_SaveServerId");
static_assert(sizeof(WBP_LoginWindow_C_SaveServerId) == 0x000004, "Wrong size on WBP_LoginWindow_C_SaveServerId");
static_assert(offsetof(WBP_LoginWindow_C_SaveServerId, ServerId) == 0x000000, "Member 'WBP_LoginWindow_C_SaveServerId::ServerId' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SetAppVersion
// 0x0028 (0x0028 - 0x0000)
struct WBP_LoginWindow_C_SetAppVersion final
{
public:
	class FString                                 CallFunc_GetAppVersion_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_LoginWindow_C_SetAppVersion) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_SetAppVersion");
static_assert(sizeof(WBP_LoginWindow_C_SetAppVersion) == 0x000028, "Wrong size on WBP_LoginWindow_C_SetAppVersion");
static_assert(offsetof(WBP_LoginWindow_C_SetAppVersion, CallFunc_GetAppVersion_ReturnValue) == 0x000000, "Member 'WBP_LoginWindow_C_SetAppVersion::CallFunc_GetAppVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_SetAppVersion, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_LoginWindow_C_SetAppVersion::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SetLiveModeButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginWindow_C_SetLiveModeButton final
{
public:
	class USettingService*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadIsLiveMode_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_SetLiveModeButton) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_SetLiveModeButton");
static_assert(sizeof(WBP_LoginWindow_C_SetLiveModeButton) == 0x000010, "Wrong size on WBP_LoginWindow_C_SetLiveModeButton");
static_assert(offsetof(WBP_LoginWindow_C_SetLiveModeButton, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_LoginWindow_C_SetLiveModeButton::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_SetLiveModeButton, CallFunc_LoadIsLiveMode_ReturnValue) == 0x000008, "Member 'WBP_LoginWindow_C_SetLiveModeButton::CallFunc_LoadIsLiveMode_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SetSelectedServer
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginWindow_C_SetSelectedServer final
{
public:
	class USelectServerService*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_SetSelectedServer) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_SetSelectedServer");
static_assert(sizeof(WBP_LoginWindow_C_SetSelectedServer) == 0x000008, "Wrong size on WBP_LoginWindow_C_SetSelectedServer");
static_assert(offsetof(WBP_LoginWindow_C_SetSelectedServer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_LoginWindow_C_SetSelectedServer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SetSelectServerButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginWindow_C_SetSelectServerButton final
{
public:
	class USelectServerService*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetServerCount_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_SetSelectServerButton) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_SetSelectServerButton");
static_assert(sizeof(WBP_LoginWindow_C_SetSelectServerButton) == 0x000010, "Wrong size on WBP_LoginWindow_C_SetSelectServerButton");
static_assert(offsetof(WBP_LoginWindow_C_SetSelectServerButton, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_LoginWindow_C_SetSelectServerButton::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_SetSelectServerButton, CallFunc_GetServerCount_ReturnValue) == 0x000008, "Member 'WBP_LoginWindow_C_SetSelectServerButton::CallFunc_GetServerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_SetSelectServerButton, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_LoginWindow_C_SetSelectServerButton::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SetServer
// 0x0008 (0x0008 - 0x0000)
struct WBP_LoginWindow_C_SetServer final
{
public:
	class UServerItem*                            CallFunc_GetDefaultServerItem_ServerItem;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_SetServer) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_SetServer");
static_assert(sizeof(WBP_LoginWindow_C_SetServer) == 0x000008, "Wrong size on WBP_LoginWindow_C_SetServer");
static_assert(offsetof(WBP_LoginWindow_C_SetServer, CallFunc_GetDefaultServerItem_ServerItem) == 0x000000, "Member 'WBP_LoginWindow_C_SetServer::CallFunc_GetDefaultServerItem_ServerItem' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.SetServerName
// 0x0028 (0x0028 - 0x0000)
struct WBP_LoginWindow_C_SetServerName final
{
public:
	class UServerItem*                            ServerItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_LoginWindow_C_SetServerName) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_SetServerName");
static_assert(sizeof(WBP_LoginWindow_C_SetServerName) == 0x000028, "Wrong size on WBP_LoginWindow_C_SetServerName");
static_assert(offsetof(WBP_LoginWindow_C_SetServerName, ServerItem) == 0x000000, "Member 'WBP_LoginWindow_C_SetServerName::ServerItem' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_SetServerName, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_LoginWindow_C_SetServerName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LoginWindow_C_SetServerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_LoginWindow_C_SetServerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_LoginWindow.WBP_LoginWindow_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_LoginWindow_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LoginWindow_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_LoginWindow_C_GetModuleName");
static_assert(sizeof(WBP_LoginWindow_C_GetModuleName) == 0x000010, "Wrong size on WBP_LoginWindow_C_GetModuleName");
static_assert(offsetof(WBP_LoginWindow_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_LoginWindow_C_GetModuleName::ReturnValue' has a wrong offset!");

}

