#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_EquipmentSlot_Clothing

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "LyraGame_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Inventory_EquipmentSlot_Clothing.WBP_Inventory_EquipmentSlot_Clothing_C.DoTgfCustomNavigation
// 0x0050 (0x0050 - 0x0000)
struct WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetNextFocWidget_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation) == 0x000008, "Wrong alignment on WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation");
static_assert(sizeof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation) == 0x000050, "Wrong size on WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation, Result) == 0x000008, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation::Result' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation, CallFunc_Conv_ByteToString_ReturnValue) == 0x000010, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation, CallFunc_GetNextFocWidget_ReturnValue) == 0x000020, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation::CallFunc_GetNextFocWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation, CallFunc_GetObjectName_ReturnValue) == 0x000030, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_DoTgfCustomNavigation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_Inventory_EquipmentSlot_Clothing.WBP_Inventory_EquipmentSlot_Clothing_C.ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing
// 0x04C0 (0x04C0 - 0x0000)
struct WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Temp_wildcard_Variable_1;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew;  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable_1;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_2;                          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue_1;     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_1;     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_3;                          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_1; // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITooltipWidget>        CallFunc_GetItemTooltipWidget_ReturnValue;         // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_ItemToolTips_CompareBattle_C*      K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_4;                          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_2; // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew_2; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_5;                          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Temp_wildcard_Variable_6;                          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_3; // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew_3; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue_2;     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_2;     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_7;                          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable_3;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue_3;     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable_4;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_3;     // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_8;                          // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_4; // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew_4; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         CallFunc_GetOwningCharacter_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x018C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_9;                          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_5; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew_5; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01CC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x01DC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x01EC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_10;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue_4;     // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_4;     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfEquipmentWrapper*                   K2Node_CustomEvent_Equipment;                      // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Common_ItemEntry_C*                K2Node_CustomEvent_Item_Entry;                     // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Common_ItemEntry_C*                K2Node_CustomEvent_ItemEntry;                      // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInventoryFragment_Sound*         CallFunc_FindFragmentByClass_ReturnValue;          // 0x0240(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryPutOnItem_OutFailReason;               // 0x0260(0x0018)()
	bool                                          CallFunc_TryPutOnItem_ReturnValue;                 // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AddToInventoryAutoPlacement_OutFailReason; // 0x0280(0x0018)()
	bool                                          CallFunc_AddToInventoryAutoPlacement_ReturnValue;  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryAutoStack_OutFailReason;               // 0x02A0(0x0018)()
	bool                                          CallFunc_TryAutoStack_ReturnValue;                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInventoryFragment_Sound*         CallFunc_FindFragmentByClass_ReturnValue_1;        // 0x02C0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_RemoveEquipmentToInventory_OutFailReason; // 0x02D8(0x0018)()
	bool                                          CallFunc_RemoveEquipmentToInventory_ReturnValue;   // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x02F8(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0338(0x0098)(ConstParm)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0400(0x0098)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B[0x5];                                      // 0x049B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_11;                         // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue_5;     // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_5;     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable_5;                    // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing) == 0x000008, "Wrong alignment on WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing");
static_assert(sizeof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing) == 0x0004C0, "Wrong size on WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, EntryPoint) == 0x000000, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable) == 0x000008, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000018, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_1) == 0x000020, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder) == 0x000028, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetInventoryContext_InventoryContextNew) == 0x000040, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetInventoryContext_InventoryContextNew' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_DoesImplementInterface_ReturnValue) == 0x000049, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_bool_not_found_Variable) == 0x00004A, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_bool_not_found_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_bool_not_found_Variable_1) == 0x00004B, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_bool_not_found_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_2) == 0x000050, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_bool_not_found_Variable_2) == 0x000058, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_bool_not_found_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_3) == 0x000059, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_FindParentWidgetOfType_ReturnValue_1) == 0x000060, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_FindParentWidgetOfType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_DoesImplementInterface_ReturnValue_1) == 0x000068, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_DoesImplementInterface_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_3) == 0x000070, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_1) == 0x000078, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_4) == 0x000089, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetInventoryContext_InventoryContextNew_1) == 0x000090, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetInventoryContext_InventoryContextNew_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000098, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_5) == 0x000099, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetItemTooltipWidget_ReturnValue) == 0x0000A0, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetItemTooltipWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle) == 0x0000B0, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_AsWBP_Item_Tool_Tips_Compare_Battle' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_4) == 0x0000C0, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_2) == 0x0000C8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_6) == 0x0000D9, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetInventoryContext_InventoryContextNew_2) == 0x0000E0, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetInventoryContext_InventoryContextNew_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_7) == 0x0000E8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_byte_Variable) == 0x0000E9, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_byte_Variable_1) == 0x0000EA, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_5) == 0x0000F0, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_6) == 0x0000F8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_3) == 0x000100, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_8) == 0x000111, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetInventoryContext_InventoryContextNew_3) == 0x000118, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetInventoryContext_InventoryContextNew_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_FindParentWidgetOfType_ReturnValue_2) == 0x000120, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_FindParentWidgetOfType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_DoesImplementInterface_ReturnValue_2) == 0x000128, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_DoesImplementInterface_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_9) == 0x000129, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_10) == 0x00012A, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_bool_Variable) == 0x00012B, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_7) == 0x000130, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_bool_not_found_Variable_3) == 0x000138, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_bool_not_found_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_11) == 0x000139, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_FindParentWidgetOfType_ReturnValue_3) == 0x000140, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_FindParentWidgetOfType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_bool_not_found_Variable_4) == 0x000148, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_bool_not_found_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_DoesImplementInterface_ReturnValue_3) == 0x000149, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_DoesImplementInterface_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_byte_Variable_2) == 0x00014A, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_byte_Variable_3) == 0x00014B, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_8) == 0x000150, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_4) == 0x000158, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_bSuccess_5) == 0x000168, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_12) == 0x000169, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetInventoryContext_InventoryContextNew_4) == 0x000170, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetInventoryContext_InventoryContextNew_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000178, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_13) == 0x000179, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetOwningCharacter_ReturnValue) == 0x000180, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_bool_Variable_1) == 0x000188, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_delegate_Variable) == 0x00018C, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_9) == 0x0001A0, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_5) == 0x0001A8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_DynamicCast_bSuccess_6) == 0x0001B8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_14) == 0x0001B9, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_GetInventoryContext_InventoryContextNew_5) == 0x0001C0, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_GetInventoryContext_InventoryContextNew_5' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0001C8, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_15) == 0x0001C9, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_delegate_Variable_1) == 0x0001CC, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_delegate_Variable_2) == 0x0001DC, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_delegate_Variable_3) == 0x0001EC, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, Temp_wildcard_Variable_10) == 0x000200, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::Temp_wildcard_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_IsValid_ReturnValue_16) == 0x000208, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_FindParentWidgetOfType_ReturnValue_4) == 0x000210, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_FindParentWidgetOfType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, CallFunc_DoesImplementInterface_ReturnValue_4) == 0x000218, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::CallFunc_DoesImplementInterface_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_Event_IsDesignTime) == 0x000219, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_CustomEvent_Equipment) == 0x000220, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_CustomEvent_Equipment' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_CustomEvent_Item_Entry) == 0x000228, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_CustomEvent_Item_Entry' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing, K2Node_CustomEvent_ItemEntry) == 0x000230, "Member 'WBP_Inventory_EquipmentSlot_Clothing_C_ExecuteUbergraph_WBP_Inventory_EquipmentSlot_Clothing::K2Node_CustomEvent_ItemEntry' has a wrong offset!");
