#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_SkillIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_SkillIcon.WBP_TgfGame_SkillIcon_C
// 0x0068 (0x02E0 - 0x0278)
class UWBP_TgfGame_SkillIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ActiveFrame;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Blank;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBg;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                SkillSwitcher;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_Attribute_Tips_Skill_C* SkillTooltip;                                      // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tgf_Skill_Base_C*                  Skill;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Skill_Id;                                          // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGA_TGF_Skill_Base_C*                   Skill_Base;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryRoleWrapper*               RoleWrapper;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSkillClicked;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_TgfGame_SkillIcon(int32 EntryPoint);
	class UWidget* Get_Blank_ToolTipWidget();
	void GetRoleWrapper(class UTgfInventoryRoleWrapper** Param_RoleWrapper);
	struct FEventReply On_Icon_MouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnSkillClicked__DelegateSignature(int32 SkillId);
	void SetEmpty();
	void SetUp(int32 Skill_id, bool Activity);
	void SetupBySkillBase(class UGA_TGF_Skill_Base_C* Skill_base);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_SkillIcon_C">();
	}
	static class UWBP_TgfGame_SkillIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_SkillIcon_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_SkillIcon_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_SkillIcon_C");
static_assert(sizeof(UWBP_TgfGame_SkillIcon_C) == 0x0002E0, "Wrong size on UWBP_TgfGame_SkillIcon_C");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, UberGraphFrame) == 0x000278, "Member 'UWBP_TgfGame_SkillIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, ActiveFrame) == 0x000280, "Member 'UWBP_TgfGame_SkillIcon_C::ActiveFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, Blank) == 0x000288, "Member 'UWBP_TgfGame_SkillIcon_C::Blank' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, HoverBg) == 0x000290, "Member 'UWBP_TgfGame_SkillIcon_C::HoverBg' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, Icon) == 0x000298, "Member 'UWBP_TgfGame_SkillIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, SkillSwitcher) == 0x0002A0, "Member 'UWBP_TgfGame_SkillIcon_C::SkillSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, SkillTooltip) == 0x0002A8, "Member 'UWBP_TgfGame_SkillIcon_C::SkillTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, Skill) == 0x0002B0, "Member 'UWBP_TgfGame_SkillIcon_C::Skill' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, Skill_Id) == 0x0002B8, "Member 'UWBP_TgfGame_SkillIcon_C::Skill_Id' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, Skill_Base) == 0x0002C0, "Member 'UWBP_TgfGame_SkillIcon_C::Skill_Base' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, RoleWrapper) == 0x0002C8, "Member 'UWBP_TgfGame_SkillIcon_C::RoleWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_SkillIcon_C, OnSkillClicked) == 0x0002D0, "Member 'UWBP_TgfGame_SkillIcon_C::OnSkillClicked' has a wrong offset!");

}

