#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuideMainItem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "TGFGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuideMainItem.WBP_GuideMainItem_C
// 0x00D8 (0x0350 - 0x0278)
class UWBP_GuideMainItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Tgf_Button_C*                      Click;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SheetName;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SubRoot;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               SubWrapBox;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   RawName;                                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuideConfigRow                        MyGuideConfig;                                     // 0x02B8(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_GuideSubItem_C*>            SubList;                                           // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_GuideWindow_C*                     Wbp;                                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExpand;                                          // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GuideMainItem_Click_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GuideMainItem_Click_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_GuideMainItem_Click_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_GuideMainItem(int32 EntryPoint);
	void SetData(class FName Param_RawName, class UWBP_GuideWindow_C* Param_Wbp);
	void SetExpand(bool Expand);
	void SetSelectState(class FName SelectId);
	void SetSubList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuideMainItem_C">();
	}
	static class UWBP_GuideMainItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuideMainItem_C>();
	}
};
static_assert(alignof(UWBP_GuideMainItem_C) == 0x000008, "Wrong alignment on UWBP_GuideMainItem_C");
static_assert(sizeof(UWBP_GuideMainItem_C) == 0x000350, "Wrong size on UWBP_GuideMainItem_C");
static_assert(offsetof(UWBP_GuideMainItem_C, UberGraphFrame) == 0x000278, "Member 'UWBP_GuideMainItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, Click) == 0x000280, "Member 'UWBP_GuideMainItem_C::Click' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, Hover) == 0x000288, "Member 'UWBP_GuideMainItem_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, Select) == 0x000290, "Member 'UWBP_GuideMainItem_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, SheetName) == 0x000298, "Member 'UWBP_GuideMainItem_C::SheetName' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, SubRoot) == 0x0002A0, "Member 'UWBP_GuideMainItem_C::SubRoot' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, SubWrapBox) == 0x0002A8, "Member 'UWBP_GuideMainItem_C::SubWrapBox' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, RawName) == 0x0002B0, "Member 'UWBP_GuideMainItem_C::RawName' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, MyGuideConfig) == 0x0002B8, "Member 'UWBP_GuideMainItem_C::MyGuideConfig' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, SubList) == 0x000330, "Member 'UWBP_GuideMainItem_C::SubList' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, Wbp) == 0x000340, "Member 'UWBP_GuideMainItem_C::Wbp' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, IsExpand) == 0x000348, "Member 'UWBP_GuideMainItem_C::IsExpand' has a wrong offset!");
static_assert(offsetof(UWBP_GuideMainItem_C, IsSelected) == 0x000349, "Member 'UWBP_GuideMainItem_C::IsSelected' has a wrong offset!");

}

