#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeyMap_BLANK

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_KeyMap_BLANK.WBP_KeyMap_BLANK_C.ExecuteUbergraph_WBP_KeyMap_BLANK
// 0x0008 (0x0008 - 0x0000)
struct WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK) == 0x000004, "Wrong alignment on WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK");
static_assert(sizeof(WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK) == 0x000008, "Wrong size on WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK");
static_assert(offsetof(WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK, EntryPoint) == 0x000000, "Member 'WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_KeyMap_BLANK_C_ExecuteUbergraph_WBP_KeyMap_BLANK::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_KeyMap_BLANK.WBP_KeyMap_BLANK_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_KeyMap_BLANK_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_KeyMap_BLANK_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_KeyMap_BLANK_C_PreConstruct");
static_assert(sizeof(WBP_KeyMap_BLANK_C_PreConstruct) == 0x000001, "Wrong size on WBP_KeyMap_BLANK_C_PreConstruct");
static_assert(offsetof(WBP_KeyMap_BLANK_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_KeyMap_BLANK_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

