#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Reticle_Generic

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_Reticle_Generic.WBP_Reticle_Generic_C.ExecuteUbergraph_WBP_Reticle_Generic
// 0x0228 (0x0228 - 0x0000)
struct WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is0penoperationTips_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHudTimeMessage                        Temp_struct_Variable;                              // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FFloor64_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHudTimeMessage                        Temp_struct_Variable_2;                            // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHudTimeMessage                        Temp_struct_Variable_3;                            // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHudTimeMessage                        Temp_struct_Variable_5;                            // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller;       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULyraAbilitySystemComponent*            CallFunc_GetLyraAbilitySystemComponent_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x018C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x01A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x01B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x01C8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller_1;     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_OnChargeStart_CurTime_ImplicitCast;       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnChargeStart_MaxTime_ImplicitCast;       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1; // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_2; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic) == 0x000008, "Wrong alignment on WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic");
static_assert(sizeof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic) == 0x000228, "Wrong size on WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, EntryPoint) == 0x000000, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Is0penoperationTips_ReturnValue) == 0x000004, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Is0penoperationTips_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_CustomEvent_ProxyObject_1) == 0x000008, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_CustomEvent_ActualChannel_1) == 0x000010, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_struct_Variable) == 0x000018, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_struct_Variable_1) == 0x000030, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_FFloor64_ReturnValue) == 0x000050, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_FFloor64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_object_Variable) == 0x000058, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000060, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_struct_Variable_2) == 0x000068, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000084, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_CustomEvent_ProxyObject) == 0x000098, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_CustomEvent_ActualChannel) == 0x0000A0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_struct_Variable_3) == 0x0000A8, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_struct_Variable_4) == 0x0000C0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_object_Variable_1) == 0x0000C8, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x0000D0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_GetPayload_ReturnValue) == 0x0000D8, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_IsValid_ReturnValue_1) == 0x0000D9, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000DC, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000EC, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000100, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_FMin_ReturnValue) == 0x000108, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PlayAnimation_ReturnValue) == 0x000118, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_struct_Variable_5) == 0x000120, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000138, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_GetPayload_ReturnValue_1) == 0x000139, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Subtract_Int64Int64_ReturnValue) == 0x000140, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Subtract_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PlayAnimation_ReturnValue_1) == 0x000148, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_GetOwningPlayer_ReturnValue) == 0x000150, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_DynamicCast_AsLyra_Player_Controller) == 0x000158, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_DynamicCast_AsLyra_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_K2_GetPawn_ReturnValue) == 0x000168, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PlayAnimation_ReturnValue_2) == 0x000170, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000178, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000179, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_IsValid_ReturnValue_2) == 0x00017A, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_GetLyraAbilitySystemComponent_ReturnValue) == 0x000180, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_GetLyraAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_IsValid_ReturnValue_3) == 0x000188, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_delegate_Variable) == 0x00018C, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PostEvent_ReturnValue) == 0x00019C, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_delegate_Variable_1) == 0x0001A0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_delegate_Variable_2) == 0x0001B0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PostEvent_ReturnValue_1) == 0x0001C0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PostEvent_ReturnValue_2) == 0x0001C4, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, Temp_delegate_Variable_3) == 0x0001C8, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PostEvent_ReturnValue_3) == 0x0001D8, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001E0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0001E8, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_DynamicCast_AsLyra_Player_Controller_1) == 0x0001F0, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_DynamicCast_AsLyra_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_OnChargeStart_CurTime_ImplicitCast) == 0x000200, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_OnChargeStart_CurTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_OnChargeStart_MaxTime_ImplicitCast) == 0x000208, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_OnChargeStart_MaxTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000210, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x000218, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1) == 0x00021C, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_2) == 0x000220, "Member 'WBP_Reticle_Generic_C_ExecuteUbergraph_WBP_Reticle_Generic::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast_2' has a wrong offset!");

// Function WBP_Reticle_Generic.WBP_Reticle_Generic_C.OnChargeEnd
// 0x0038 (0x0038 - 0x0000)
struct WBP_Reticle_Generic_C_OnChargeEnd final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Generic_C_OnChargeEnd) == 0x000008, "Wrong alignment on WBP_Reticle_Generic_C_OnChargeEnd");
static_assert(sizeof(WBP_Reticle_Generic_C_OnChargeEnd) == 0x000038, "Wrong size on WBP_Reticle_Generic_C_OnChargeEnd");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeEnd, Temp_delegate_Variable) == 0x000000, "Member 'WBP_Reticle_Generic_C_OnChargeEnd::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeEnd, Temp_delegate_Variable_1) == 0x000010, "Member 'WBP_Reticle_Generic_C_OnChargeEnd::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeEnd, CallFunc_PostEvent_ReturnValue) == 0x000020, "Member 'WBP_Reticle_Generic_C_OnChargeEnd::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeEnd, CallFunc_PostEvent_ReturnValue_1) == 0x000024, "Member 'WBP_Reticle_Generic_C_OnChargeEnd::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeEnd, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Reticle_Generic_C_OnChargeEnd::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeEnd, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000030, "Member 'WBP_Reticle_Generic_C_OnChargeEnd::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeEnd, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000031, "Member 'WBP_Reticle_Generic_C_OnChargeEnd::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");

// Function WBP_Reticle_Generic.WBP_Reticle_Generic_C.OnChargeStart
// 0x0040 (0x0040 - 0x0000)
struct WBP_Reticle_Generic_C_OnChargeStart final
{
public:
	double                                        MaxTime;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurTime;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Generic_C_OnChargeStart) == 0x000008, "Wrong alignment on WBP_Reticle_Generic_C_OnChargeStart");
static_assert(sizeof(WBP_Reticle_Generic_C_OnChargeStart) == 0x000040, "Wrong size on WBP_Reticle_Generic_C_OnChargeStart");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, MaxTime) == 0x000000, "Member 'WBP_Reticle_Generic_C_OnChargeStart::MaxTime' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CurTime) == 0x000008, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CurTime' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CallFunc_FMax_ReturnValue) == 0x000010, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000038, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnChargeStart, CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast) == 0x00003C, "Member 'WBP_Reticle_Generic_C_OnChargeStart::CallFunc_PlayAnimation_PlaybackSpeed_ImplicitCast' has a wrong offset!");

// Function WBP_Reticle_Generic.WBP_Reticle_Generic_C.OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677
// 0x0010 (0x0010 - 0x0000)
struct WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677) == 0x000008, "Wrong alignment on WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677");
static_assert(sizeof(WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677) == 0x000010, "Wrong size on WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677");
static_assert(offsetof(WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677, ProxyObject) == 0x000000, "Member 'WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677::ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677, ActualChannel) == 0x000008, "Member 'WBP_Reticle_Generic_C_OnMessageReceived_4B7EAD2D4C7B3E1522CB9CAE2ED95677::ActualChannel' has a wrong offset!");

// Function WBP_Reticle_Generic.WBP_Reticle_Generic_C.OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18
// 0x0010 (0x0010 - 0x0000)
struct WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18) == 0x000008, "Wrong alignment on WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18");
static_assert(sizeof(WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18) == 0x000010, "Wrong size on WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18");
static_assert(offsetof(WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18, ProxyObject) == 0x000000, "Member 'WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18::ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18, ActualChannel) == 0x000008, "Member 'WBP_Reticle_Generic_C_OnMessageReceived_D0E20D604D7F6B08E40E1DAFEBCE9C18::ActualChannel' has a wrong offset!");

}

