#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Attribute_Skill_DropDown

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Attribute_Skill_DropDown.WBP_Attribute_Skill_DropDown_C.ExecuteUbergraph_WBP_Attribute_Skill_DropDown
// 0x0180 (0x0180 - 0x0000)
struct WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0010(0x0098)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A8(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E8(0x0098)(ConstParm)
};
static_assert(alignof(WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown) == 0x000008, "Wrong alignment on WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown");
static_assert(sizeof(WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown) == 0x000180, "Wrong size on WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown, EntryPoint) == 0x000000, "Member 'WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown, K2Node_Event_InFocusEvent) == 0x000004, "Member 'WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown, K2Node_Event_MouseEvent_1) == 0x000010, "Member 'WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown, K2Node_Event_MyGeometry) == 0x0000A8, "Member 'WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown, K2Node_Event_MouseEvent) == 0x0000E8, "Member 'WBP_Attribute_Skill_DropDown_C_ExecuteUbergraph_WBP_Attribute_Skill_DropDown::K2Node_Event_MouseEvent' has a wrong offset!");

// Function WBP_Attribute_Skill_DropDown.WBP_Attribute_Skill_DropDown_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Attribute_Skill_DropDown_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Attribute_Skill_DropDown_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Attribute_Skill_DropDown_C_OnFocusLost");
static_assert(sizeof(WBP_Attribute_Skill_DropDown_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Attribute_Skill_DropDown_C_OnFocusLost");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Attribute_Skill_DropDown_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Attribute_Skill_DropDown.WBP_Attribute_Skill_DropDown_C.OnMouseEnter
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Attribute_Skill_DropDown_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Attribute_Skill_DropDown_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_Attribute_Skill_DropDown_C_OnMouseEnter");
static_assert(sizeof(WBP_Attribute_Skill_DropDown_C_OnMouseEnter) == 0x0000D8, "Wrong size on WBP_Attribute_Skill_DropDown_C_OnMouseEnter");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_Attribute_Skill_DropDown_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'WBP_Attribute_Skill_DropDown_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_Attribute_Skill_DropDown.WBP_Attribute_Skill_DropDown_C.OnMouseLeave
// 0x0098 (0x0098 - 0x0000)
struct WBP_Attribute_Skill_DropDown_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Attribute_Skill_DropDown_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_Attribute_Skill_DropDown_C_OnMouseLeave");
static_assert(sizeof(WBP_Attribute_Skill_DropDown_C_OnMouseLeave) == 0x000098, "Wrong size on WBP_Attribute_Skill_DropDown_C_OnMouseLeave");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_Attribute_Skill_DropDown_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_Attribute_Skill_DropDown.WBP_Attribute_Skill_DropDown_C.OnSkillDropdownHide__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Attribute_Skill_DropDown_C_OnSkillDropdownHide__DelegateSignature final
{
public:
	int32                                         Pos;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Attribute_Skill_DropDown_C_OnSkillDropdownHide__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Attribute_Skill_DropDown_C_OnSkillDropdownHide__DelegateSignature");
static_assert(sizeof(WBP_Attribute_Skill_DropDown_C_OnSkillDropdownHide__DelegateSignature) == 0x000004, "Wrong size on WBP_Attribute_Skill_DropDown_C_OnSkillDropdownHide__DelegateSignature");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_OnSkillDropdownHide__DelegateSignature, Pos) == 0x000000, "Member 'WBP_Attribute_Skill_DropDown_C_OnSkillDropdownHide__DelegateSignature::Pos' has a wrong offset!");

// Function WBP_Attribute_Skill_DropDown.WBP_Attribute_Skill_DropDown_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Attribute_Skill_DropDown_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Attribute_Skill_DropDown_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_Attribute_Skill_DropDown_C_GetModuleName");
static_assert(sizeof(WBP_Attribute_Skill_DropDown_C_GetModuleName) == 0x000010, "Wrong size on WBP_Attribute_Skill_DropDown_C_GetModuleName");
static_assert(offsetof(WBP_Attribute_Skill_DropDown_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_Attribute_Skill_DropDown_C_GetModuleName::ReturnValue' has a wrong offset!");

}

