#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_TaskList_Entry

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu_TaskList_Entry.WBP_GameMenu_TaskList_Entry_C
// 0x0030 (0x02A8 - 0x0278)
class UWBP_GameMenu_TaskList_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CountMaxText;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CountNowText;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconType;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TaskCount;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TaskDescribeText;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Construct();
	void ExecuteUbergraph_WBP_GameMenu_TaskList_Entry(int32 EntryPoint);
	void InitUIToka();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_TaskList_Entry_C">();
	}
	static class UWBP_GameMenu_TaskList_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_TaskList_Entry_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_TaskList_Entry_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_TaskList_Entry_C");
static_assert(sizeof(UWBP_GameMenu_TaskList_Entry_C) == 0x0002A8, "Wrong size on UWBP_GameMenu_TaskList_Entry_C");
static_assert(offsetof(UWBP_GameMenu_TaskList_Entry_C, UberGraphFrame) == 0x000278, "Member 'UWBP_GameMenu_TaskList_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TaskList_Entry_C, CountMaxText) == 0x000280, "Member 'UWBP_GameMenu_TaskList_Entry_C::CountMaxText' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TaskList_Entry_C, CountNowText) == 0x000288, "Member 'UWBP_GameMenu_TaskList_Entry_C::CountNowText' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TaskList_Entry_C, IconType) == 0x000290, "Member 'UWBP_GameMenu_TaskList_Entry_C::IconType' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TaskList_Entry_C, TaskCount) == 0x000298, "Member 'UWBP_GameMenu_TaskList_Entry_C::TaskCount' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TaskList_Entry_C, TaskDescribeText) == 0x0002A0, "Member 'UWBP_GameMenu_TaskList_Entry_C::TaskDescribeText' has a wrong offset!");

}

