#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_Attribute_Tips_Status

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status
// 0x0168 (0x0168 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_total;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_base;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_name;                           // 0x0060(0x0018)()
	struct FRoleDisplayAttribute                  K2Node_CustomEvent_attr_config;                    // 0x0078(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetValueText_ret;                         // 0x0130(0x0018)()
	class UUserWidget*                            K2Node_CustomEvent_parentCell;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_offset;                         // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_force_right;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status) == 0x000168, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_CustomEvent_total) == 0x000050, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_CustomEvent_total' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_CustomEvent_base) == 0x000058, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_CustomEvent_base' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_CustomEvent_name) == 0x000060, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_CustomEvent_name' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_CustomEvent_attr_config) == 0x000078, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_CustomEvent_attr_config' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, CallFunc_IsHovered_ReturnValue) == 0x000129, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, CallFunc_GetValueText_ret) == 0x000130, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::CallFunc_GetValueText_ret' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_CustomEvent_parentCell) == 0x000148, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_CustomEvent_parentCell' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_CustomEvent_offset) == 0x000150, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_CustomEvent_offset' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, K2Node_CustomEvent_force_right) == 0x000160, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::K2Node_CustomEvent_force_right' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status, CallFunc_IsInViewport_ReturnValue) == 0x000161, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_Tips_Status::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.GetValueText
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Ret;                                               // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00A8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText) == 0x0000D8, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, Value) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::Value' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, Ret) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::Ret' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, CallFunc_Round_ReturnValue) == 0x000020, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, K2Node_MakeArray_Array) == 0x000098, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000A8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_GetValueText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.InitUI
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI final
{
public:
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI) == 0x000004, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI) == 0x000008, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI, CallFunc_Array_IsEmpty_ReturnValue) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI, CallFunc_Array_Add_ReturnValue) == 0x000004, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_InitUI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.SetUp
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp final
{
public:
	double                                        Total;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Base;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_Name;                                        // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FRoleDisplayAttribute                  Attr_config;                                       // 0x0028(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp) == 0x0000D8, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp, Total) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp::Total' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp, Base) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp::Base' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp, Param_Name) == 0x000010, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp, Attr_config) == 0x000028, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_SetUp::Attr_config' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.ShowTooltips
// 0x0020 (0x0020 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips final
{
public:
	class UUserWidget*                            ParentCell;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_Offset;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force_right;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips) == 0x000020, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips, ParentCell) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips::ParentCell' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips, Param_Offset) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips::Param_Offset' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips, Force_right) == 0x000018, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_ShowTooltips::Force_right' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick) == 0x000048, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.UpdateDesc
// 0x0130 (0x0130 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc final
{
public:
	double                                        Attr_value;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ratio_count;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Ratio;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_Attribute_Tips_Status_Desc_C* CurDesc;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         LineCount;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttrCount;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TgfGame_Inventory_Attribute_Tips_Status_Desc_C* CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable_1;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TgfGame_Inventory_Attribute_Tips_Status_Desc_C* CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TgfGame_Inventory_Attribute_Tips_Status_Desc_C* CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x00F8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	double                                        K2Node_VariableSet_ratio_ImplicitCast;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc) == 0x000130, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, Attr_value) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::Attr_value' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, Ratio_count) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::Ratio_count' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, Ratio) == 0x000010, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::Ratio' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CurDesc) == 0x000018, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CurDesc' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, LineCount) == 0x000020, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::LineCount' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, AttrCount) == 0x000024, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::AttrCount' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, Temp_int_Variable) == 0x000028, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Subtract_IntInt_ReturnValue) == 0x000098, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, K2Node_MakeArray_Array) == 0x0000A0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, Temp_int_Variable_1) == 0x0000B0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000C8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000CC, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_AddChild_ReturnValue) == 0x0000D8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Array_Add_ReturnValue) == 0x0000E0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E4, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Array_Length_ReturnValue_1) == 0x0000EC, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Array_Length_ReturnValue_2) == 0x0000F0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_TextFromStringTable_ReturnValue) == 0x0000F8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, CallFunc_Format_ReturnValue) == 0x000110, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc, K2Node_VariableSet_ratio_ImplicitCast) == 0x000128, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdateDesc::K2Node_VariableSet_ratio_ImplicitCast' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_Status.WBP_TgfGame_Inventory_Attribute_Tips_Status_C.UpdatePos
// 0x0158 (0x0158 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos final
{
public:
	struct FVector2D                              Showpos;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowAtLeft;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0078(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbsoluteSize_ReturnValue;              // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_4;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_4;                        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos) == 0x000158, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos, Showpos) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos::Showpos' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos, ShowAtLeft) == 0x000010, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_Status_C_UpdatePos::ShowAtLeft' has a wrong offset!");
