#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NoticeItem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NoticeItem.WBP_NoticeItem_C
// 0x0050 (0x02C8 - 0x0278)
class UWBP_NoticeItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Tgf_Button_C*                      Click;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_RedDot_Hall_C*              RedDot;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SheetName;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NoticeId;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NoticeWindow_C*                    Wbp;                                               // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 NoticeStableId;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GuideMainItem_Click_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GuideMainItem_Click_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_GuideMainItem_Click_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_NoticeItem(int32 EntryPoint);
	void SetData(struct FSDKNoticeInfo& NoticeInfo, class UWBP_NoticeWindow_C* Param_Wbp);
	void SetSelectState(int32 Param_NoticeId);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NoticeItem_C">();
	}
	static class UWBP_NoticeItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NoticeItem_C>();
	}
};
static_assert(alignof(UWBP_NoticeItem_C) == 0x000008, "Wrong alignment on UWBP_NoticeItem_C");
static_assert(sizeof(UWBP_NoticeItem_C) == 0x0002C8, "Wrong size on UWBP_NoticeItem_C");
static_assert(offsetof(UWBP_NoticeItem_C, UberGraphFrame) == 0x000278, "Member 'UWBP_NoticeItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, Click) == 0x000280, "Member 'UWBP_NoticeItem_C::Click' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, Hover) == 0x000288, "Member 'UWBP_NoticeItem_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, RedDot) == 0x000290, "Member 'UWBP_NoticeItem_C::RedDot' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, Select) == 0x000298, "Member 'UWBP_NoticeItem_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, SheetName) == 0x0002A0, "Member 'UWBP_NoticeItem_C::SheetName' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, NoticeId) == 0x0002A8, "Member 'UWBP_NoticeItem_C::NoticeId' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, Wbp) == 0x0002B0, "Member 'UWBP_NoticeItem_C::Wbp' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeItem_C, NoticeStableId) == 0x0002B8, "Member 'UWBP_NoticeItem_C::NoticeStableId' has a wrong offset!");

}

