#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_TeamList_Entry

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu_TeamList_Entry.WBP_GameMenu_TeamList_Entry_C
// 0x00B0 (0x0328 - 0x0278)
class UWBP_GameMenu_TeamList_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BorderLeader;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BorderMember;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Button_Simple_C*            ButtonJuBao;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasBlank;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Leader;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Member;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MemberPanel;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_CheckBox_C*                    MicCheckBox;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoleCareerIcon;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RoleCareerName;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoleImgHead;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RoleTextLevel;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RoleTextName;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RoleTextName_1;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          Slider_SettingValue;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_CheckBox_C*                    SoundCheckBox;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                SwitcherTeamMember;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SettingValue;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                UserBorderSwitcher;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UserImgCaptain;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Construct();
	void ExecuteUbergraph_WBP_GameMenu_TeamList_Entry(int32 EntryPoint);
	void InitUIToka();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_TeamList_Entry_C">();
	}
	static class UWBP_GameMenu_TeamList_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_TeamList_Entry_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_TeamList_Entry_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_TeamList_Entry_C");
static_assert(sizeof(UWBP_GameMenu_TeamList_Entry_C) == 0x000328, "Wrong size on UWBP_GameMenu_TeamList_Entry_C");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, UberGraphFrame) == 0x000278, "Member 'UWBP_GameMenu_TeamList_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, BorderLeader) == 0x000280, "Member 'UWBP_GameMenu_TeamList_Entry_C::BorderLeader' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, BorderMember) == 0x000288, "Member 'UWBP_GameMenu_TeamList_Entry_C::BorderMember' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, ButtonJuBao) == 0x000290, "Member 'UWBP_GameMenu_TeamList_Entry_C::ButtonJuBao' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, CanvasBlank) == 0x000298, "Member 'UWBP_GameMenu_TeamList_Entry_C::CanvasBlank' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, Leader) == 0x0002A0, "Member 'UWBP_GameMenu_TeamList_Entry_C::Leader' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, Member) == 0x0002A8, "Member 'UWBP_GameMenu_TeamList_Entry_C::Member' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, MemberPanel) == 0x0002B0, "Member 'UWBP_GameMenu_TeamList_Entry_C::MemberPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, MicCheckBox) == 0x0002B8, "Member 'UWBP_GameMenu_TeamList_Entry_C::MicCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, ProgressBar) == 0x0002C0, "Member 'UWBP_GameMenu_TeamList_Entry_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, RoleCareerIcon) == 0x0002C8, "Member 'UWBP_GameMenu_TeamList_Entry_C::RoleCareerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, RoleCareerName) == 0x0002D0, "Member 'UWBP_GameMenu_TeamList_Entry_C::RoleCareerName' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, RoleImgHead) == 0x0002D8, "Member 'UWBP_GameMenu_TeamList_Entry_C::RoleImgHead' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, RoleTextLevel) == 0x0002E0, "Member 'UWBP_GameMenu_TeamList_Entry_C::RoleTextLevel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, RoleTextName) == 0x0002E8, "Member 'UWBP_GameMenu_TeamList_Entry_C::RoleTextName' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, RoleTextName_1) == 0x0002F0, "Member 'UWBP_GameMenu_TeamList_Entry_C::RoleTextName_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, Slider_SettingValue) == 0x0002F8, "Member 'UWBP_GameMenu_TeamList_Entry_C::Slider_SettingValue' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, SoundCheckBox) == 0x000300, "Member 'UWBP_GameMenu_TeamList_Entry_C::SoundCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, SwitcherTeamMember) == 0x000308, "Member 'UWBP_GameMenu_TeamList_Entry_C::SwitcherTeamMember' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, Text_SettingValue) == 0x000310, "Member 'UWBP_GameMenu_TeamList_Entry_C::Text_SettingValue' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, UserBorderSwitcher) == 0x000318, "Member 'UWBP_GameMenu_TeamList_Entry_C::UserBorderSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_TeamList_Entry_C, UserImgCaptain) == 0x000320, "Member 'UWBP_GameMenu_TeamList_Entry_C::UserImgCaptain' has a wrong offset!");

}

