#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuideInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "TGFGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuideInfo.WBP_GuideInfo_C
// 0x0120 (0x0398 - 0x0278)
class UWBP_GuideInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Media_FadeIn;                                      // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasView;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Descr;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgGuide;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ImgMaskRoot;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgMedia;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      NextBtn;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySheetName;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               PointRoot;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      PreBtn;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SheetName;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimatedSwitcher*                SwitcherView;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   RawName;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_GuideWindow_C*                     MyGuideWindow;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_GuidePoint_C*>              MyPointList;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         MyTotlePage;                                       // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MyCurrentPage;                                     // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuideConfigRow                        MyGuideConfig;                                     // 0x0310(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMediaPlayer*                           MyMediaPlayer;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             MyImageTexture;                                    // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GuideInfo_NextBtn_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GuideInfo_PreBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_GuideInfo(int32 EntryPoint);
	void OnSetImageTexture();
	void OnSetMediaTexture();
	void SetData(const struct FGuideConfigRow& Config);
	void SetPage(int32 Page);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuideInfo_C">();
	}
	static class UWBP_GuideInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuideInfo_C>();
	}
};
static_assert(alignof(UWBP_GuideInfo_C) == 0x000008, "Wrong alignment on UWBP_GuideInfo_C");
static_assert(sizeof(UWBP_GuideInfo_C) == 0x000398, "Wrong size on UWBP_GuideInfo_C");
static_assert(offsetof(UWBP_GuideInfo_C, UberGraphFrame) == 0x000278, "Member 'UWBP_GuideInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, Media_FadeIn) == 0x000280, "Member 'UWBP_GuideInfo_C::Media_FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, CanvasView) == 0x000288, "Member 'UWBP_GuideInfo_C::CanvasView' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, Descr) == 0x000290, "Member 'UWBP_GuideInfo_C::Descr' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, ImgGuide) == 0x000298, "Member 'UWBP_GuideInfo_C::ImgGuide' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, ImgMaskRoot) == 0x0002A0, "Member 'UWBP_GuideInfo_C::ImgMaskRoot' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, ImgMedia) == 0x0002A8, "Member 'UWBP_GuideInfo_C::ImgMedia' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, Line) == 0x0002B0, "Member 'UWBP_GuideInfo_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, NextBtn) == 0x0002B8, "Member 'UWBP_GuideInfo_C::NextBtn' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, OverlaySheetName) == 0x0002C0, "Member 'UWBP_GuideInfo_C::OverlaySheetName' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, PointRoot) == 0x0002C8, "Member 'UWBP_GuideInfo_C::PointRoot' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, PreBtn) == 0x0002D0, "Member 'UWBP_GuideInfo_C::PreBtn' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, SheetName) == 0x0002D8, "Member 'UWBP_GuideInfo_C::SheetName' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, SwitcherView) == 0x0002E0, "Member 'UWBP_GuideInfo_C::SwitcherView' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, RawName) == 0x0002E8, "Member 'UWBP_GuideInfo_C::RawName' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, MyGuideWindow) == 0x0002F0, "Member 'UWBP_GuideInfo_C::MyGuideWindow' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, MyPointList) == 0x0002F8, "Member 'UWBP_GuideInfo_C::MyPointList' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, MyTotlePage) == 0x000308, "Member 'UWBP_GuideInfo_C::MyTotlePage' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, MyCurrentPage) == 0x00030C, "Member 'UWBP_GuideInfo_C::MyCurrentPage' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, MyGuideConfig) == 0x000310, "Member 'UWBP_GuideInfo_C::MyGuideConfig' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, MyMediaPlayer) == 0x000388, "Member 'UWBP_GuideInfo_C::MyMediaPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_GuideInfo_C, MyImageTexture) == 0x000390, "Member 'UWBP_GuideInfo_C::MyImageTexture' has a wrong offset!");

}

