#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_PriceTrend

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Item_PriceTrend.WBP_Item_PriceTrend_C
// 0x0050 (0x02C8 - 0x0278)
class UWBP_Item_PriceTrend_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Button7;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Button7Text;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleTimeSeriesPlot*                  SeriesPlot;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SeriesPlotFill;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VerticalTitle;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Trade_PriceEntry_C*                WBP_Trade_PriceEntry;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FVector2D>                      PointArray;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Item_PriceTrend(int32 EntryPoint);
	void InitUIToka();
	void PreConstruct(bool IsDesignTime);
	void SeriesPlotMaterialFill(class UImage* Target, double WidthDivisions, double HeightDivisions, int32 Resolution, TArray<struct FVector2D>& Points);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Item_PriceTrend_C">();
	}
	static class UWBP_Item_PriceTrend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Item_PriceTrend_C>();
	}
};
static_assert(alignof(UWBP_Item_PriceTrend_C) == 0x000008, "Wrong alignment on UWBP_Item_PriceTrend_C");
static_assert(sizeof(UWBP_Item_PriceTrend_C) == 0x0002C8, "Wrong size on UWBP_Item_PriceTrend_C");
static_assert(offsetof(UWBP_Item_PriceTrend_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Item_PriceTrend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, Background) == 0x000280, "Member 'UWBP_Item_PriceTrend_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, Button7) == 0x000288, "Member 'UWBP_Item_PriceTrend_C::Button7' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, Button7Text) == 0x000290, "Member 'UWBP_Item_PriceTrend_C::Button7Text' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, SeriesPlot) == 0x000298, "Member 'UWBP_Item_PriceTrend_C::SeriesPlot' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, SeriesPlotFill) == 0x0002A0, "Member 'UWBP_Item_PriceTrend_C::SeriesPlotFill' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, VerticalTitle) == 0x0002A8, "Member 'UWBP_Item_PriceTrend_C::VerticalTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, WBP_Trade_PriceEntry) == 0x0002B0, "Member 'UWBP_Item_PriceTrend_C::WBP_Trade_PriceEntry' has a wrong offset!");
static_assert(offsetof(UWBP_Item_PriceTrend_C, PointArray) == 0x0002B8, "Member 'UWBP_Item_PriceTrend_C::PointArray' has a wrong offset!");

}

