#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_DragItem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_Inventory_DragItem.WBP_TgfGame_Inventory_DragItem_C
// 0x0018 (0x0290 - 0x0278)
class UWBP_TgfGame_Inventory_DragItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               Overlay_26;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_44;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem(int32 EntryPoint);
	void SetUp(class UTgfInventoryItemWrapper* Item);
	void SetupWithContext(class UTgfInventoryItemWrapper* Item, class UTgfInventoryWrapper* Context);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_Inventory_DragItem_C">();
	}
	static class UWBP_TgfGame_Inventory_DragItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_Inventory_DragItem_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_Inventory_DragItem_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_Inventory_DragItem_C");
static_assert(sizeof(UWBP_TgfGame_Inventory_DragItem_C) == 0x000290, "Wrong size on UWBP_TgfGame_Inventory_DragItem_C");
static_assert(offsetof(UWBP_TgfGame_Inventory_DragItem_C, UberGraphFrame) == 0x000278, "Member 'UWBP_TgfGame_Inventory_DragItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_DragItem_C, Overlay_26) == 0x000280, "Member 'UWBP_TgfGame_Inventory_DragItem_C::Overlay_26' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_DragItem_C, SizeBox_44) == 0x000288, "Member 'UWBP_TgfGame_Inventory_DragItem_C::SizeBox_44' has a wrong offset!");

}

