#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemTooltips_Talentline

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemTooltips_Talentline.WBP_ItemTooltips_Talentline_C
// 0x0018 (0x0290 - 0x0278)
class UWBP_ItemTooltips_Talentline_C final : public UUserWidget
{
public:
	class UHorizontalBox*                         BuffLine;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spot;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TextDescr;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetDescribe(const class FText& Desc);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemTooltips_Talentline_C">();
	}
	static class UWBP_ItemTooltips_Talentline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemTooltips_Talentline_C>();
	}
};
static_assert(alignof(UWBP_ItemTooltips_Talentline_C) == 0x000008, "Wrong alignment on UWBP_ItemTooltips_Talentline_C");
static_assert(sizeof(UWBP_ItemTooltips_Talentline_C) == 0x000290, "Wrong size on UWBP_ItemTooltips_Talentline_C");
static_assert(offsetof(UWBP_ItemTooltips_Talentline_C, BuffLine) == 0x000278, "Member 'UWBP_ItemTooltips_Talentline_C::BuffLine' has a wrong offset!");
static_assert(offsetof(UWBP_ItemTooltips_Talentline_C, Spot) == 0x000280, "Member 'UWBP_ItemTooltips_Talentline_C::Spot' has a wrong offset!");
static_assert(offsetof(UWBP_ItemTooltips_Talentline_C, TextDescr) == 0x000288, "Member 'UWBP_ItemTooltips_Talentline_C::TextDescr' has a wrong offset!");

}

