#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_PostGame_Extraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_PostGame_Extraction.WBP_TgfGame_PostGame_Extraction_C
// 0x0018 (0x0400 - 0x03E8)
class UWBP_TgfGame_PostGame_Extraction_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Start;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_33;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction(int32 EntryPoint);
	void PlayAudio();
	void PlayAudio2();
	void SequenceEvent__ENTRYPOINTWBP_TgfGame_PostGame_Extraction();
	void SequenceEvent__ENTRYPOINTWBP_TgfGame_PostGame_Extraction_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_PostGame_Extraction_C">();
	}
	static class UWBP_TgfGame_PostGame_Extraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_PostGame_Extraction_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_PostGame_Extraction_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_PostGame_Extraction_C");
static_assert(sizeof(UWBP_TgfGame_PostGame_Extraction_C) == 0x000400, "Wrong size on UWBP_TgfGame_PostGame_Extraction_C");
static_assert(offsetof(UWBP_TgfGame_PostGame_Extraction_C, UberGraphFrame) == 0x0003E8, "Member 'UWBP_TgfGame_PostGame_Extraction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_PostGame_Extraction_C, Start) == 0x0003F0, "Member 'UWBP_TgfGame_PostGame_Extraction_C::Start' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_PostGame_Extraction_C, Image_33) == 0x0003F8, "Member 'UWBP_TgfGame_PostGame_Extraction_C::Image_33' has a wrong offset!");

}

