#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NoticeWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TGFGame_structs.hpp"
#include "TGFGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NoticeWindow.WBP_NoticeWindow_C
// 0x0070 (0x0328 - 0x02B8)
class UWBP_NoticeWindow_C final : public UGuideWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Start;                                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              ButtonClose;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               List;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               SheetWrapBox;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NoticeInfo_C*                      WBP_NoticeInfo;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NoticeItem_C*                      WBP_NoticeItem;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NoticeItem_C*                      WBP_NoticeItem_1;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FSDKNoticeInfo>                 NoticeList;                                        // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_NoticeItem_C*>              SheetItemList;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SelectId;                                          // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_NoticeWindow_WBP_Common_Button_Long_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_NoticeWindow(int32 EntryPoint);
	void InitConfigData();
	void InitUIToka();
	void OnItemSelect(int32 Select_Id);
	struct FEventReply OnUserKeyUp(const struct FKeyEvent& InKeyEvent);
	void PreConstruct(bool IsDesignTime);
	void ReceiveOnClose();
	void ReceiveOnOpen(class UTGFWindowArgs* Args);
	void SetDetail();
	void SetSheetList();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NoticeWindow_C">();
	}
	static class UWBP_NoticeWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NoticeWindow_C>();
	}
};
static_assert(alignof(UWBP_NoticeWindow_C) == 0x000008, "Wrong alignment on UWBP_NoticeWindow_C");
static_assert(sizeof(UWBP_NoticeWindow_C) == 0x000328, "Wrong size on UWBP_NoticeWindow_C");
static_assert(offsetof(UWBP_NoticeWindow_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_NoticeWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, Start) == 0x0002C0, "Member 'UWBP_NoticeWindow_C::Start' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, ButtonClose) == 0x0002C8, "Member 'UWBP_NoticeWindow_C::ButtonClose' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, Frame) == 0x0002D0, "Member 'UWBP_NoticeWindow_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, List) == 0x0002D8, "Member 'UWBP_NoticeWindow_C::List' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, SheetWrapBox) == 0x0002E0, "Member 'UWBP_NoticeWindow_C::SheetWrapBox' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, WBP_NoticeInfo) == 0x0002E8, "Member 'UWBP_NoticeWindow_C::WBP_NoticeInfo' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, WBP_NoticeItem) == 0x0002F0, "Member 'UWBP_NoticeWindow_C::WBP_NoticeItem' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, WBP_NoticeItem_1) == 0x0002F8, "Member 'UWBP_NoticeWindow_C::WBP_NoticeItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, NoticeList) == 0x000300, "Member 'UWBP_NoticeWindow_C::NoticeList' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, SheetItemList) == 0x000310, "Member 'UWBP_NoticeWindow_C::SheetItemList' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeWindow_C, SelectId) == 0x000320, "Member 'UWBP_NoticeWindow_C::SelectId' has a wrong offset!");

}

