#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Dashboard_Buff_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_Dashboard_Buff_Base.WBP_TgfGame_Dashboard_Buff_Base_C
// 0x0078 (0x0328 - 0x02B0)
class UWBP_TgfGame_Dashboard_Buff_Base_C final : public UTgfGameWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Color;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_20;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextCnt;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsDebuff;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             IconImage;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        TotalTime;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PassTime;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               IconMaterial;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ColorMaterial;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bPause;                                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_InternalTick(float InDeltaTime);
	void Create_Icon_Material();
	void CreateColorMaterial();
	void EffectStart(double Param_TotalTime, double RemainTime, int32 BuffStackCnt);
	void ExecuteUbergraph_WBP_TgfGame_Dashboard_Buff_Base(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBuffIcon(bool Param_bIsDebuff, class UTexture2D* BuffIcon);
	void SetSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_Dashboard_Buff_Base_C">();
	}
	static class UWBP_TgfGame_Dashboard_Buff_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_Dashboard_Buff_Base_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_Dashboard_Buff_Base_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_Dashboard_Buff_Base_C");
static_assert(sizeof(UWBP_TgfGame_Dashboard_Buff_Base_C) == 0x000328, "Wrong size on UWBP_TgfGame_Dashboard_Buff_Base_C");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, Color) == 0x0002B8, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::Color' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, Icon) == 0x0002C0, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, Overlay_20) == 0x0002C8, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::Overlay_20' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, Select) == 0x0002D0, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, SizeBox) == 0x0002D8, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, TextCnt) == 0x0002E0, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::TextCnt' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, bIsDebuff) == 0x0002E8, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::bIsDebuff' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, IconImage) == 0x0002F0, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::IconImage' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, TotalTime) == 0x0002F8, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::TotalTime' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, PassTime) == 0x000300, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::PassTime' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, IconMaterial) == 0x000308, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::IconMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, Value) == 0x000310, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::Value' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, ColorMaterial) == 0x000318, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::ColorMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Dashboard_Buff_Base_C, bPause) == 0x000320, "Member 'UWBP_TgfGame_Dashboard_Buff_Base_C::bPause' has a wrong offset!");

}

