#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_Attribute_ListItem1

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "LyraGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_Inventory_Attribute_ListItem1.WBP_TgfGame_Inventory_Attribute_ListItem1_C
// 0x01B0 (0x0428 - 0x0278)
class UWBP_TgfGame_Inventory_Attribute_ListItem1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Start;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ActiveBg;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX;                                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_1;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconBg;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Num;                                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_RedDot_Hall_C*              RedDot;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Talent;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TalentBg;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TalentIcon1;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TalentIcon2;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NameStr;                                           // 0x02E0(0x0018)(Edit, BlueprintVisible)
	double                                        Value;                                             // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRoleDisplayAttribute                  Attr_config;                                       // 0x0300(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     TalentTextues;                                     // 0x03B0(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture2D*>                     TalentBgTexures;                                   // 0x03C0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FTgfCareerTalentCfgItem>        Talents;                                           // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_TgfGame_Inventory_Attribute_C*     AttributePanel;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     GameplayAttribute;                                 // 0x03E8(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void CheckRedpoint();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PlayTalentFx();
	void PreConstruct(bool IsDesignTime);
	void SetValue(const class FText& Param_Name, double Param_Value, const struct FRoleDisplayAttribute& Param_Attr_config, TArray<struct FTgfCareerTalentCfgItem>& Param_Talents, class UTexture2D* Icon_texture, int32* Count, TArray<struct FTgfCareerTalentCfgItem>* OpenTalents);
	void StopAnimations();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_Inventory_Attribute_ListItem1_C">();
	}
	static class UWBP_TgfGame_Inventory_Attribute_ListItem1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_Inventory_Attribute_ListItem1_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_Inventory_Attribute_ListItem1_C");
static_assert(sizeof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C) == 0x000428, "Wrong size on UWBP_TgfGame_Inventory_Attribute_ListItem1_C");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, UberGraphFrame) == 0x000278, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, Start) == 0x000280, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::Start' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, ActiveBg) == 0x000288, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::ActiveBg' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, FX) == 0x000290, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::FX' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, FX_1) == 0x000298, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::FX_1' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, Icon) == 0x0002A0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, IconBg) == 0x0002A8, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::IconBg' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, Num) == 0x0002B0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::Num' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, RedDot) == 0x0002B8, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::RedDot' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, Talent) == 0x0002C0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::Talent' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, TalentBg) == 0x0002C8, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::TalentBg' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, TalentIcon1) == 0x0002D0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::TalentIcon1' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, TalentIcon2) == 0x0002D8, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::TalentIcon2' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, NameStr) == 0x0002E0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::NameStr' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, Value) == 0x0002F8, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::Value' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, Attr_config) == 0x000300, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::Attr_config' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, TalentTextues) == 0x0003B0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::TalentTextues' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, TalentBgTexures) == 0x0003C0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::TalentBgTexures' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, Talents) == 0x0003D0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::Talents' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, AttributePanel) == 0x0003E0, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::AttributePanel' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, GameplayAttribute) == 0x0003E8, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::GameplayAttribute' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_ListItem1_C, IconTexture) == 0x000420, "Member 'UWBP_TgfGame_Inventory_Attribute_ListItem1_C::IconTexture' has a wrong offset!");

}

