#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_SpectateQuitNotice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_SpectateQuitNotice.WBP_TgfGame_SpectateQuitNotice_C.ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice
// 0x0088 (0x0088 - 0x0000)
struct WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALyraPlayerController*                  K2Node_DynamicCast_AsLyra_Player_Controller;       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice) == 0x000008, "Wrong alignment on WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice");
static_assert(sizeof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice) == 0x000088, "Wrong size on WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, Temp_int_Variable) == 0x000004, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, Temp_delegate_Variable) == 0x000008, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_PostEvent_ReturnValue) == 0x000028, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, Temp_int_Variable_1) == 0x000038, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, K2Node_DynamicCast_AsLyra_Player_Controller) == 0x000048, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::K2Node_DynamicCast_AsLyra_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000058, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, Temp_delegate_Variable_1) == 0x000068, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_PostEvent_ReturnValue_1) == 0x000078, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00007C, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000080, "Member 'WBP_TgfGame_SpectateQuitNotice_C_ExecuteUbergraph_WBP_TgfGame_SpectateQuitNotice::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_SpectateQuitNotice.WBP_TgfGame_SpectateQuitNotice_C.InitSettings
// 0x0001 (0x0001 - 0x0000)
struct WBP_TgfGame_SpectateQuitNotice_C_InitSettings final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_SpectateQuitNotice_C_InitSettings) == 0x000001, "Wrong alignment on WBP_TgfGame_SpectateQuitNotice_C_InitSettings");
static_assert(sizeof(WBP_TgfGame_SpectateQuitNotice_C_InitSettings) == 0x000001, "Wrong size on WBP_TgfGame_SpectateQuitNotice_C_InitSettings");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_InitSettings, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_TgfGame_SpectateQuitNotice_C_InitSettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_TgfGame_SpectateQuitNotice.WBP_TgfGame_SpectateQuitNotice_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TgfGame_SpectateQuitNotice_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_SpectateQuitNotice_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TgfGame_SpectateQuitNotice_C_PreConstruct");
static_assert(sizeof(WBP_TgfGame_SpectateQuitNotice_C_PreConstruct) == 0x000001, "Wrong size on WBP_TgfGame_SpectateQuitNotice_C_PreConstruct");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TgfGame_SpectateQuitNotice_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TgfGame_SpectateQuitNotice.WBP_TgfGame_SpectateQuitNotice_C.Set Current Mode
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode final
{
public:
	ESpectatingTargetType                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RemainingTime;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode) == 0x000004, "Wrong alignment on WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode");
static_assert(sizeof(WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode) == 0x000008, "Wrong size on WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode, Mode) == 0x000000, "Member 'WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode::Mode' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode, RemainingTime) == 0x000004, "Member 'WBP_TgfGame_SpectateQuitNotice_C_Set_Current_Mode::RemainingTime' has a wrong offset!");

// Function WBP_TgfGame_SpectateQuitNotice.WBP_TgfGame_SpectateQuitNotice_C.SetText
// 0x0030 (0x0030 - 0x0000)
struct WBP_TgfGame_SpectateQuitNotice_C_SetText final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALyraCharacter*                         K2Node_DynamicCast_AsLyra_Character;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_SpectateQuitNotice_C_SetText) == 0x000008, "Wrong alignment on WBP_TgfGame_SpectateQuitNotice_C_SetText");
static_assert(sizeof(WBP_TgfGame_SpectateQuitNotice_C_SetText) == 0x000030, "Wrong size on WBP_TgfGame_SpectateQuitNotice_C_SetText");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, K2Node_DynamicCast_AsLyra_Character) == 0x000020, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::K2Node_DynamicCast_AsLyra_Character' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_SetText, CallFunc_IsDeadOrDying_ReturnValue) == 0x000029, "Member 'WBP_TgfGame_SpectateQuitNotice_C_SetText::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_SpectateQuitNotice.WBP_TgfGame_SpectateQuitNotice_C.UpdateCountDown
// 0x0088 (0x0088 - 0x0000)
struct WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
};
static_assert(alignof(WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown) == 0x000008, "Wrong alignment on WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown");
static_assert(sizeof(WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown) == 0x000088, "Wrong size on WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown, Time) == 0x000000, "Member 'WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown::Time' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_TgfGame_SpectateQuitNotice_C_UpdateCountDown::CallFunc_Format_ReturnValue' has a wrong offset!");

}

