#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_Attribute_Tips_TalentItem

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_Inventory_Attribute_Tips_TalentItem.WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C
// 0x0028 (0x02A0 - 0x0278)
class UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C final : public UUserWidget
{
public:
	class UCommonRichTextBlock*                   ActivateText;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ActivateTitle;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TextDescr;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ReplaceSkillName(const class FText& Text, class FText* Result);
	void SetUp(const struct FTgfCareerTalentCfgItem& Talent, double Value, const class FString& AttrName);
	void SetupByTalent(const struct FTgfCareerTalentCfgItem& Talent, bool bActivity);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C">();
	}
	static class UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C");
static_assert(sizeof(UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C) == 0x0002A0, "Wrong size on UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C, ActivateText) == 0x000278, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C::ActivateText' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C, ActivateTitle) == 0x000280, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C::ActivateTitle' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C, Icon) == 0x000288, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C, TextDescr) == 0x000290, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C::TextDescr' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C, TextName) == 0x000298, "Member 'UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C::TextName' has a wrong offset!");

}

