#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGameMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGameMenu.WBP_TgfGameMenu_C
// 0x0088 (0x0478 - 0x03F0)
class UWBP_TgfGameMenu_C final : public ULyraActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              CloseButton;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              GuideButton;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mask;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Notice;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              OptionsButton;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              QuickQuitGameButton;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_Button_Long_C*              QuitGameButton;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Version;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_ListPanel_C*              WBP_GameMenu_ListPanel;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bTriggerBySpectate;                                // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasActivatedBtnUp;                                 // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44A[0x6];                                      // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         BtnPressedCnt;                                     // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Common_Button_Long_C*>      ListOnboardingButton;                              // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_Common_Button_Long_C*>      ListDefaultlButton;                                // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void BndEvt__WBP_TgfGameMenu_CloseButton_K2Node_ComponentBoundEvent_6_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_TgfGameMenu_GuideButton_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_TgfGameMenu_OptionsButton_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_TgfGameMenu_QuickQuickGameButton_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_TgfGameMenu_QuitGameButton_K2Node_ComponentBoundEvent_5_ButtonClicked__DelegateSignature();
	void BP_OnActivated();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_TgfGameMenu(int32 EntryPoint);
	void InitButtons();
	struct FEventReply On_Mask_MouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnSubWindowClose();
	void PreConstruct(bool IsDesignTime);
	void ReturnFocus();
	void SendSelfQuitReport();
	void SetAppVersion();
	void SetTriggerBySpectate(bool Value);
	void SetVisility(bool Visible);
	void UpdateState();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGameMenu_C">();
	}
	static class UWBP_TgfGameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGameMenu_C>();
	}
};
static_assert(alignof(UWBP_TgfGameMenu_C) == 0x000008, "Wrong alignment on UWBP_TgfGameMenu_C");
static_assert(sizeof(UWBP_TgfGameMenu_C) == 0x000478, "Wrong size on UWBP_TgfGameMenu_C");
static_assert(offsetof(UWBP_TgfGameMenu_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_TgfGameMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, CanvasPanel_1) == 0x0003F8, "Member 'UWBP_TgfGameMenu_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, CloseButton) == 0x000400, "Member 'UWBP_TgfGameMenu_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, GuideButton) == 0x000408, "Member 'UWBP_TgfGameMenu_C::GuideButton' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, Mask) == 0x000410, "Member 'UWBP_TgfGameMenu_C::Mask' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, Notice) == 0x000418, "Member 'UWBP_TgfGameMenu_C::Notice' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, OptionsButton) == 0x000420, "Member 'UWBP_TgfGameMenu_C::OptionsButton' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, QuickQuitGameButton) == 0x000428, "Member 'UWBP_TgfGameMenu_C::QuickQuitGameButton' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, QuitGameButton) == 0x000430, "Member 'UWBP_TgfGameMenu_C::QuitGameButton' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, Version) == 0x000438, "Member 'UWBP_TgfGameMenu_C::Version' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, WBP_GameMenu_ListPanel) == 0x000440, "Member 'UWBP_TgfGameMenu_C::WBP_GameMenu_ListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, bTriggerBySpectate) == 0x000448, "Member 'UWBP_TgfGameMenu_C::bTriggerBySpectate' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, HasActivatedBtnUp) == 0x000449, "Member 'UWBP_TgfGameMenu_C::HasActivatedBtnUp' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, BtnPressedCnt) == 0x000450, "Member 'UWBP_TgfGameMenu_C::BtnPressedCnt' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, ListOnboardingButton) == 0x000458, "Member 'UWBP_TgfGameMenu_C::ListOnboardingButton' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGameMenu_C, ListDefaultlButton) == 0x000468, "Member 'UWBP_TgfGameMenu_C::ListDefaultlButton' has a wrong offset!");

}

