#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemGearSetLine

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemGearSetLine.WBP_ItemGearSetLine_C
// 0x0018 (0x0290 - 0x0278)
class UWBP_ItemGearSetLine_C final : public UUserWidget
{
public:
	class UHorizontalBox*                         GearSet;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   GearSetText;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spot;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemGearSetLine_C">();
	}
	static class UWBP_ItemGearSetLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemGearSetLine_C>();
	}
};
static_assert(alignof(UWBP_ItemGearSetLine_C) == 0x000008, "Wrong alignment on UWBP_ItemGearSetLine_C");
static_assert(sizeof(UWBP_ItemGearSetLine_C) == 0x000290, "Wrong size on UWBP_ItemGearSetLine_C");
static_assert(offsetof(UWBP_ItemGearSetLine_C, GearSet) == 0x000278, "Member 'UWBP_ItemGearSetLine_C::GearSet' has a wrong offset!");
static_assert(offsetof(UWBP_ItemGearSetLine_C, GearSetText) == 0x000280, "Member 'UWBP_ItemGearSetLine_C::GearSetText' has a wrong offset!");
static_assert(offsetof(UWBP_ItemGearSetLine_C, Spot) == 0x000288, "Member 'UWBP_ItemGearSetLine_C::Spot' has a wrong offset!");

}

