#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_Attribute_Tips_TalentItem

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_Inventory_Attribute_Tips_TalentItem.WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C.ReplaceSkillName
// 0x0030 (0x0030 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Result;                                            // 0x0018(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName) == 0x000030, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName, Text) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName::Text' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName, Result) == 0x000018, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_ReplaceSkillName::Result' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_TalentItem.WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C.SetUp
// 0x0310 (0x0310 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp final
{
public:
	struct FTgfCareerTalentCfgItem                Talent;                                            // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Value;                                             // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 AttrName;                                          // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_ReplaceSkillName_Result;                  // 0x0118(0x0018)()
	class FText                                   CallFunc_TextFromStringTable_ReturnValue_1;        // 0x0130(0x0018)()
	struct FTgfCareerTalentConditionCfgItem       CallFunc_Array_Get_Item;                           // 0x0148(0x0040)()
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0190(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0210(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0260(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0278(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02D8(0x0018)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x02F0(0x0018)()
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp) == 0x000310, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, Talent) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::Talent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, Value) == 0x000080, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::Value' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, AttrName) == 0x000088, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::AttrName' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_TextFromStringTable_ReturnValue) == 0x0000B0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_ReplaceSkillName_Result) == 0x000118, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_ReplaceSkillName_Result' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_TextFromStringTable_ReturnValue_1) == 0x000130, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_TextFromStringTable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Array_Get_Item) == 0x000148, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Array_IsEmpty_ReturnValue) == 0x000188, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, K2Node_MakeStruct_FormatArgumentData_1) == 0x000190, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, K2Node_MakeArray_Array) == 0x0001E8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Format_ReturnValue) == 0x0001F8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, K2Node_MakeStruct_FormatArgumentData_2) == 0x000210, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000260, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, K2Node_MakeStruct_FormatArgumentData_3) == 0x000278, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, K2Node_MakeArray_Array_1) == 0x0002C8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Format_ReturnValue_1) == 0x0002D8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_GetEmptyText_ReturnValue) == 0x0002F0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000308, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetUp::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_TalentItem.WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C.SetupByTalent
// 0x03B0 (0x03B0 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent final
{
public:
	struct FTgfCareerTalentCfgItem                Talent;                                            // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bActivity;                                         // 0x0080(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextFromStringTable_ReturnValue;          // 0x0088(0x0018)()
	class FText                                   CallFunc_TextFromStringTable_ReturnValue_1;        // 0x00A0(0x0018)()
	struct FTgfCareerTalentConditionCfgItem       CallFunc_Array_Get_Item;                           // 0x00B8(0x0040)()
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0100(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0150(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_ToLower_ReturnValue;                      // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01C8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0218(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0240(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextFromStringTable_ReturnValue_2;        // 0x0268(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0290(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02A8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02F8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0310(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0320(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0370(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0388(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0398(0x0018)()
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent) == 0x0003B0, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, Talent) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::Talent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, bActivity) == 0x000080, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::bActivity' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_TextFromStringTable_ReturnValue) == 0x000088, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_TextFromStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_TextFromStringTable_ReturnValue_1) == 0x0000A0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_TextFromStringTable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Array_IsEmpty_ReturnValue) == 0x0000F8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeStruct_FormatArgumentData) == 0x000100, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeStruct_FormatArgumentData_1) == 0x000150, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_ToLower_ReturnValue) == 0x0001A0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_ToLower_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B0, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001C8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_GetEmptyText_ReturnValue) == 0x000218, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeArray_Array) == 0x000230, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Format_ReturnValue) == 0x000240, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Conv_TextToString_ReturnValue) == 0x000258, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_TextFromStringTable_ReturnValue_2) == 0x000268, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_TextFromStringTable_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000280, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000290, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002A8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002F8, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeArray_Array_1) == 0x000310, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeStruct_FormatArgumentData_4) == 0x000320, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Format_ReturnValue_1) == 0x000370, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, K2Node_MakeArray_Array_2) == 0x000388, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent, CallFunc_Format_ReturnValue_2) == 0x000398, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_SetupByTalent::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_Tips_TalentItem.WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_GetModuleName");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_GetModuleName) == 0x000010, "Wrong size on WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_GetModuleName");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C_GetModuleName::ReturnValue' has a wrong offset!");

}

