#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuidePoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GuidePoint.WBP_GuidePoint_C.ExecuteUbergraph_WBP_GuidePoint
// 0x0008 (0x0008 - 0x0000)
struct WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint) == 0x000004, "Wrong alignment on WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint");
static_assert(sizeof(WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint) == 0x000008, "Wrong size on WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint");
static_assert(offsetof(WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint, EntryPoint) == 0x000000, "Member 'WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000004, "Member 'WBP_GuidePoint_C_ExecuteUbergraph_WBP_GuidePoint::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_GuidePoint.WBP_GuidePoint_C.Set Data
// 0x0010 (0x0010 - 0x0000)
struct WBP_GuidePoint_C_Set_Data final
{
public:
	int32                                         Param_ID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GuideInfo_C*                       Parent;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GuidePoint_C_Set_Data) == 0x000008, "Wrong alignment on WBP_GuidePoint_C_Set_Data");
static_assert(sizeof(WBP_GuidePoint_C_Set_Data) == 0x000010, "Wrong size on WBP_GuidePoint_C_Set_Data");
static_assert(offsetof(WBP_GuidePoint_C_Set_Data, Param_ID) == 0x000000, "Member 'WBP_GuidePoint_C_Set_Data::Param_ID' has a wrong offset!");
static_assert(offsetof(WBP_GuidePoint_C_Set_Data, Parent) == 0x000008, "Member 'WBP_GuidePoint_C_Set_Data::Parent' has a wrong offset!");

// Function WBP_GuidePoint.WBP_GuidePoint_C.Set Select State
// 0x0008 (0x0008 - 0x0000)
struct WBP_GuidePoint_C_Set_Select_State final
{
public:
	int32                                         SelectId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GuidePoint_C_Set_Select_State) == 0x000004, "Wrong alignment on WBP_GuidePoint_C_Set_Select_State");
static_assert(sizeof(WBP_GuidePoint_C_Set_Select_State) == 0x000008, "Wrong size on WBP_GuidePoint_C_Set_Select_State");
static_assert(offsetof(WBP_GuidePoint_C_Set_Select_State, SelectId) == 0x000000, "Member 'WBP_GuidePoint_C_Set_Select_State::SelectId' has a wrong offset!");
static_assert(offsetof(WBP_GuidePoint_C_Set_Select_State, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_GuidePoint_C_Set_Select_State::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

