#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_Attribute_ListItem1

#include "Basic.hpp"

#include "LyraGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_Inventory_Attribute_ListItem1.WBP_TgfGame_Inventory_Attribute_ListItem1_C.ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0048(0x0098)(ConstParm)
	class UWBP_TgfGame_Inventory_Attribute_Tips_Talent_C* CallFunc_Create_ReturnValue;                       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1) == 0x0000F0, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, K2Node_Event_MouseEvent) == 0x000048, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, CallFunc_Create_ReturnValue) == 0x0000E0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, CallFunc_IsValid_ReturnValue_1) == 0x0000E9, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1, CallFunc_IsInViewport_ReturnValue) == 0x0000EA, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_ExecuteUbergraph_WBP_TgfGame_Inventory_Attribute_ListItem1::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem1.WBP_TgfGame_Inventory_Attribute_ListItem1_C.OnMouseEnter
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter) == 0x0000D8, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter, MouseEvent) == 0x000040, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem1.WBP_TgfGame_Inventory_Attribute_ListItem1_C.PlayTalentFx
// 0x0010 (0x0010 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx final
{
public:
	class UUMGSequencePlayer*                     NewLocalVar;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx) == 0x000010, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx, NewLocalVar) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_PlayTalentFx::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem1.WBP_TgfGame_Inventory_Attribute_ListItem1_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem1_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem1_C_PreConstruct");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_PreConstruct) == 0x000001, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem1_C_PreConstruct");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem1.WBP_TgfGame_Inventory_Attribute_ListItem1_C.SetValue
// 0x0248 (0x0248 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Param_Value;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRoleDisplayAttribute                  Param_Attr_config;                                 // 0x0020(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FTgfCareerTalentCfgItem>        Param_Talents;                                     // 0x00D0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UTexture2D*                             Icon_texture;                                      // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x00E8(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTgfCareerTalentCfgItem>        OpenTalents;                                       // 0x00F0(0x0010)(Parm, OutParm)
	TArray<struct FTgfCareerTalentCfgItem>        ActiveTalents;                                     // 0x0100(0x0010)(Edit, BlueprintVisible)
	int32                                         ActiveCount;                                       // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0120(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTgfCareerTalentCfgItem                CallFunc_Array_Get_Item_2;                         // 0x0178(0x0080)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item_3;                         // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_4;                         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_4;                           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue) == 0x000248, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Param_Name) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Param_Value) == 0x000018, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Param_Value' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Param_Attr_config) == 0x000020, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Param_Attr_config' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Param_Talents) == 0x0000D0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Param_Talents' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Icon_texture) == 0x0000E0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Icon_texture' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Count) == 0x0000E8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Count' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, OpenTalents) == 0x0000F0, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::OpenTalents' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, ActiveTalents) == 0x000100, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::ActiveTalents' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, ActiveCount) == 0x000110, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::ActiveCount' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_bool_Variable) == 0x000114, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Round_ReturnValue) == 0x000118, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Conv_IntToText_ReturnValue) == 0x000120, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable) == 0x000138, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable_1) == 0x000139, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_bool_Variable_1) == 0x00013A, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_bool_Variable_2) == 0x00013B, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable_2) == 0x00013C, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable_3) == 0x00013D, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_int_Variable) == 0x000140, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_bool_Variable_3) == 0x000144, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable_4) == 0x000145, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable_5) == 0x000146, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_int_Loop_Counter_Variable) == 0x000148, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Add_IntInt_ReturnValue) == 0x00014C, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_int_Array_Index_Variable) == 0x000150, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_bool_Variable_4) == 0x000154, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Get_Item) == 0x000158, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_bool_Variable_5) == 0x000168, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Greater_IntInt_ReturnValue) == 0x000169, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00016A, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, K2Node_Select_Default) == 0x00016B, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, K2Node_Select_Default_1) == 0x00016C, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Add_IntInt_ReturnValue_1) == 0x000170, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable_6) == 0x000174, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Get_Item_2) == 0x000178, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Add_ReturnValue) == 0x0001F8, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Length_ReturnValue) == 0x0001FC, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Less_IntInt_ReturnValue) == 0x000200, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000201, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_IsEmpty_ReturnValue) == 0x000202, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Get_Item_3) == 0x000208, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Get_Item_4) == 0x000210, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, Temp_byte_Variable_7) == 0x000218, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_Length_ReturnValue_1) == 0x00021C, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, K2Node_Select_Default_2) == 0x000220, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000221, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, K2Node_Select_Default_3) == 0x000228, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, K2Node_Select_Default_4) == 0x000230, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000238, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, K2Node_Select_Default_5) == 0x000239, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000240, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_SetValue::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_TgfGame_Inventory_Attribute_ListItem1.WBP_TgfGame_Inventory_Attribute_ListItem1_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_TgfGame_Inventory_Attribute_ListItem1_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_Attribute_ListItem1_C_GetModuleName");
static_assert(sizeof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_GetModuleName) == 0x000010, "Wrong size on WBP_TgfGame_Inventory_Attribute_ListItem1_C_GetModuleName");
static_assert(offsetof(WBP_TgfGame_Inventory_Attribute_ListItem1_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_TgfGame_Inventory_Attribute_ListItem1_C_GetModuleName::ReturnValue' has a wrong offset!");

}

