#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_Inventory_DragItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_Inventory_DragItem.WBP_TgfGame_Inventory_DragItem_C.ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem
// 0x0058 (0x0058 - 0x0000)
struct WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Common_ItemEntry_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTgfInventoryItemWrapper*               K2Node_CustomEvent_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UTgfInventoryItemDefinition*      CallFunc_GetItemDefinitionObject_ReturnValue;      // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBoxSlot*                           K2Node_DynamicCast_AsSize_Box_Slot;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem");
static_assert(sizeof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem) == 0x000058, "Wrong size on WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, K2Node_MakeStruct_Margin) == 0x000010, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, K2Node_CustomEvent_Item) == 0x000020, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, CallFunc_GetItemDefinitionObject_ReturnValue) == 0x000028, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::CallFunc_GetItemDefinitionObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, K2Node_DynamicCast_AsSize_Box_Slot) == 0x000038, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::K2Node_DynamicCast_AsSize_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, CallFunc_Multiply_IntInt_ReturnValue) == 0x000044, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000048, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000050, "Member 'WBP_TgfGame_Inventory_DragItem_C_ExecuteUbergraph_WBP_TgfGame_Inventory_DragItem::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");

// Function WBP_TgfGame_Inventory_DragItem.WBP_TgfGame_Inventory_DragItem_C.SetUp
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGame_Inventory_DragItem_C_SetUp final
{
public:
	class UTgfInventoryItemWrapper*               Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_DragItem_C_SetUp) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_DragItem_C_SetUp");
static_assert(sizeof(WBP_TgfGame_Inventory_DragItem_C_SetUp) == 0x000008, "Wrong size on WBP_TgfGame_Inventory_DragItem_C_SetUp");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_SetUp, Item) == 0x000000, "Member 'WBP_TgfGame_Inventory_DragItem_C_SetUp::Item' has a wrong offset!");

// Function WBP_TgfGame_Inventory_DragItem.WBP_TgfGame_Inventory_DragItem_C.SetupWithContext
// 0x0010 (0x0010 - 0x0000)
struct WBP_TgfGame_Inventory_DragItem_C_SetupWithContext final
{
public:
	class UTgfInventoryItemWrapper*               Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryWrapper*                   Context;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_DragItem_C_SetupWithContext) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_DragItem_C_SetupWithContext");
static_assert(sizeof(WBP_TgfGame_Inventory_DragItem_C_SetupWithContext) == 0x000010, "Wrong size on WBP_TgfGame_Inventory_DragItem_C_SetupWithContext");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_SetupWithContext, Item) == 0x000000, "Member 'WBP_TgfGame_Inventory_DragItem_C_SetupWithContext::Item' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_SetupWithContext, Context) == 0x000008, "Member 'WBP_TgfGame_Inventory_DragItem_C_SetupWithContext::Context' has a wrong offset!");

// Function WBP_TgfGame_Inventory_DragItem.WBP_TgfGame_Inventory_DragItem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_TgfGame_Inventory_DragItem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_Inventory_DragItem_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_TgfGame_Inventory_DragItem_C_GetModuleName");
static_assert(sizeof(WBP_TgfGame_Inventory_DragItem_C_GetModuleName) == 0x000010, "Wrong size on WBP_TgfGame_Inventory_DragItem_C_GetModuleName");
static_assert(offsetof(WBP_TgfGame_Inventory_DragItem_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_TgfGame_Inventory_DragItem_C_GetModuleName::ReturnValue' has a wrong offset!");

}

