#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tgf_Inventory_Attribute_Tips_Talent

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tgf_Inventory_Attribute_Tips_Talent.WBP_Tgf_Inventory_Attribute_Tips_Talent_C
// 0x0048 (0x02C0 - 0x0278)
class UWBP_Tgf_Inventory_Attribute_Tips_Talent_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg;                                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_157;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C* TalentItem;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            ParentCell;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_ItemTooltips_Talentline_C*> DescribeLines;                                     // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_TgfGame_Inventory_Attribute_Tips_TalentItem_C*> TalentLines;                                       // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Tgf_Inventory_Attribute_Tips_Talent(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ShowTooltip();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePos();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tgf_Inventory_Attribute_Tips_Talent_C">();
	}
	static class UWBP_Tgf_Inventory_Attribute_Tips_Talent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tgf_Inventory_Attribute_Tips_Talent_C>();
	}
};
static_assert(alignof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C) == 0x000008, "Wrong alignment on UWBP_Tgf_Inventory_Attribute_Tips_Talent_C");
static_assert(sizeof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C) == 0x0002C0, "Wrong size on UWBP_Tgf_Inventory_Attribute_Tips_Talent_C");
static_assert(offsetof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Tgf_Inventory_Attribute_Tips_Talent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C, Bg) == 0x000280, "Member 'UWBP_Tgf_Inventory_Attribute_Tips_Talent_C::Bg' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C, SizeBox_157) == 0x000288, "Member 'UWBP_Tgf_Inventory_Attribute_Tips_Talent_C::SizeBox_157' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C, TalentItem) == 0x000290, "Member 'UWBP_Tgf_Inventory_Attribute_Tips_Talent_C::TalentItem' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C, ParentCell) == 0x000298, "Member 'UWBP_Tgf_Inventory_Attribute_Tips_Talent_C::ParentCell' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C, DescribeLines) == 0x0002A0, "Member 'UWBP_Tgf_Inventory_Attribute_Tips_Talent_C::DescribeLines' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_Inventory_Attribute_Tips_Talent_C, TalentLines) == 0x0002B0, "Member 'UWBP_Tgf_Inventory_Attribute_Tips_Talent_C::TalentLines' has a wrong offset!");

}

