#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_DivideItem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Inventory_DivideItem.WBP_Inventory_DivideItem_C
// 0x00B0 (0x0328 - 0x0278)
class UWBP_Inventory_DivideItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_BG;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_ButtonBase_C*                  ButtonMinus;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_ButtonBase_C*                  ButtonPlus;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_52;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ConfirmArea;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Num;                                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PanelBg;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DivideNumber;                                      // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinValue;                                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHeapSubmit;                                      // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector2D                              PanelSize;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryItemWrapper*               CachedItem;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UUserWidget>             InstigatorWidget;                                  // 0x02F8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, InstancedReference, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Inventory_DivideItem_ButtonPlus_1_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Inventory_DivideItem_WBP_Tgf_ButtonBase_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Lobby_InventoryItemHeap2_Button_BG_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Inventory_DivideItem(int32 EntryPoint);
	void InitButtons();
	void OnHeapSubmit__DelegateSignature(int32 Param_Num);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PlaceNearMouseCursor(const struct FGeometry& Anchor, const struct FGeometry& Geometry);
	void PreConstruct(bool IsDesignTime);
	void SetUp(class UTgfInventoryItemWrapper* Item, class UUserWidget* Param_InstigatorWidget, const struct FGeometry& Anchor);
	void UpdateNumberLabel();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Inventory_DivideItem_C">();
	}
	static class UWBP_Inventory_DivideItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Inventory_DivideItem_C>();
	}
};
static_assert(alignof(UWBP_Inventory_DivideItem_C) == 0x000008, "Wrong alignment on UWBP_Inventory_DivideItem_C");
static_assert(sizeof(UWBP_Inventory_DivideItem_C) == 0x000328, "Wrong size on UWBP_Inventory_DivideItem_C");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Inventory_DivideItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, Button_BG) == 0x000280, "Member 'UWBP_Inventory_DivideItem_C::Button_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, ButtonMinus) == 0x000288, "Member 'UWBP_Inventory_DivideItem_C::ButtonMinus' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, ButtonPlus) == 0x000290, "Member 'UWBP_Inventory_DivideItem_C::ButtonPlus' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, CanvasPanel_52) == 0x000298, "Member 'UWBP_Inventory_DivideItem_C::CanvasPanel_52' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, ConfirmArea) == 0x0002A0, "Member 'UWBP_Inventory_DivideItem_C::ConfirmArea' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, Num) == 0x0002A8, "Member 'UWBP_Inventory_DivideItem_C::Num' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, Overlay_0) == 0x0002B0, "Member 'UWBP_Inventory_DivideItem_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, PanelBg) == 0x0002B8, "Member 'UWBP_Inventory_DivideItem_C::PanelBg' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, DivideNumber) == 0x0002C0, "Member 'UWBP_Inventory_DivideItem_C::DivideNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, MaxValue) == 0x0002C4, "Member 'UWBP_Inventory_DivideItem_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, MinValue) == 0x0002C8, "Member 'UWBP_Inventory_DivideItem_C::MinValue' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, OnHeapSubmit) == 0x0002D0, "Member 'UWBP_Inventory_DivideItem_C::OnHeapSubmit' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, PanelSize) == 0x0002E0, "Member 'UWBP_Inventory_DivideItem_C::PanelSize' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, CachedItem) == 0x0002F0, "Member 'UWBP_Inventory_DivideItem_C::CachedItem' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_DivideItem_C, InstigatorWidget) == 0x0002F8, "Member 'UWBP_Inventory_DivideItem_C::InstigatorWidget' has a wrong offset!");

}

