#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemTooltips_MainBasic

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemTooltips_MainBasic.WBP_ItemTooltips_MainBasic_C
// 0x0028 (0x02A0 - 0x0278)
class UWBP_ItemTooltips_MainBasic_C final : public UUserWidget
{
public:
	class UCommonRichTextBlock*                   DamageText;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   DphText;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_29;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ValueText;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetDamage(int32 Element, double DPH, double Min_val, double Max_val, bool bNeedAppendRange);
	void SetTextValue(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemTooltips_MainBasic_C">();
	}
	static class UWBP_ItemTooltips_MainBasic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemTooltips_MainBasic_C>();
	}
};
static_assert(alignof(UWBP_ItemTooltips_MainBasic_C) == 0x000008, "Wrong alignment on UWBP_ItemTooltips_MainBasic_C");
static_assert(sizeof(UWBP_ItemTooltips_MainBasic_C) == 0x0002A0, "Wrong size on UWBP_ItemTooltips_MainBasic_C");
static_assert(offsetof(UWBP_ItemTooltips_MainBasic_C, DamageText) == 0x000278, "Member 'UWBP_ItemTooltips_MainBasic_C::DamageText' has a wrong offset!");
static_assert(offsetof(UWBP_ItemTooltips_MainBasic_C, DphText) == 0x000280, "Member 'UWBP_ItemTooltips_MainBasic_C::DphText' has a wrong offset!");
static_assert(offsetof(UWBP_ItemTooltips_MainBasic_C, HorizontalBox_29) == 0x000288, "Member 'UWBP_ItemTooltips_MainBasic_C::HorizontalBox_29' has a wrong offset!");
static_assert(offsetof(UWBP_ItemTooltips_MainBasic_C, Icon) == 0x000290, "Member 'UWBP_ItemTooltips_MainBasic_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_ItemTooltips_MainBasic_C, ValueText) == 0x000298, "Member 'UWBP_ItemTooltips_MainBasic_C::ValueText' has a wrong offset!");

}

