#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NoticeInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NoticeInfo.WBP_NoticeInfo_C
// 0x0038 (0x02B0 - 0x0278)
class UWBP_NoticeInfo_C final : public UUserWidget
{
public:
	class UCanvasPanel*                           CanvasView;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomRichTextBlock*                   Descr;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ImgMaskRoot;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySheetName;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SheetName;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TimeText;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetData(struct FSDKNoticeInfo& NoticeInfo);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NoticeInfo_C">();
	}
	static class UWBP_NoticeInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NoticeInfo_C>();
	}
};
static_assert(alignof(UWBP_NoticeInfo_C) == 0x000008, "Wrong alignment on UWBP_NoticeInfo_C");
static_assert(sizeof(UWBP_NoticeInfo_C) == 0x0002B0, "Wrong size on UWBP_NoticeInfo_C");
static_assert(offsetof(UWBP_NoticeInfo_C, CanvasView) == 0x000278, "Member 'UWBP_NoticeInfo_C::CanvasView' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeInfo_C, Descr) == 0x000280, "Member 'UWBP_NoticeInfo_C::Descr' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeInfo_C, ImgMaskRoot) == 0x000288, "Member 'UWBP_NoticeInfo_C::ImgMaskRoot' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeInfo_C, Line) == 0x000290, "Member 'UWBP_NoticeInfo_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeInfo_C, OverlaySheetName) == 0x000298, "Member 'UWBP_NoticeInfo_C::OverlaySheetName' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeInfo_C, SheetName) == 0x0002A0, "Member 'UWBP_NoticeInfo_C::SheetName' has a wrong offset!");
static_assert(offsetof(UWBP_NoticeInfo_C, TimeText) == 0x0002A8, "Member 'UWBP_NoticeInfo_C::TimeText' has a wrong offset!");

}

