#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tgf_CheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LyraGame_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WBP_Tgf_CheckBox.WBP_Tgf_CheckBox_C
// 0x0020 (0x0CA0 - 0x0C80)
class UWBP_Tgf_CheckBox_C final : public UTgfCheckBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkAudioEvent*                          CheckedSound;                                      // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          UncheckedSound;                                    // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Tgf_CheckBox(int32 EntryPoint);
	void TgfOnCheckStateChanged(ECheckBoxState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tgf_CheckBox_C">();
	}
	static class UWBP_Tgf_CheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tgf_CheckBox_C>();
	}
};
static_assert(alignof(UWBP_Tgf_CheckBox_C) == 0x000010, "Wrong alignment on UWBP_Tgf_CheckBox_C");
static_assert(sizeof(UWBP_Tgf_CheckBox_C) == 0x000CA0, "Wrong size on UWBP_Tgf_CheckBox_C");
static_assert(offsetof(UWBP_Tgf_CheckBox_C, UberGraphFrame) == 0x000C80, "Member 'UWBP_Tgf_CheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_CheckBox_C, CheckedSound) == 0x000C88, "Member 'UWBP_Tgf_CheckBox_C::CheckedSound' has a wrong offset!");
static_assert(offsetof(UWBP_Tgf_CheckBox_C, UncheckedSound) == 0x000C90, "Member 'UWBP_Tgf_CheckBox_C::UncheckedSound' has a wrong offset!");

}

