#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Reticle_Torch

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Reticle_Torch.WBP_Reticle_Torch_C.ExecuteUbergraph_WBP_Reticle_Torch
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHudBooleanMessage                     Temp_struct_Variable;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHudBooleanMessage                     Temp_struct_Variable_2;                            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHudBooleanMessage                     Temp_struct_Variable_3;                            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHudBooleanMessage                     Temp_struct_Variable_5;                            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GameWidgetGetAbilitySystemComponentFromActor_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch) == 0x000008, "Wrong alignment on WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch");
static_assert(sizeof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch) == 0x0000C8, "Wrong size on WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, EntryPoint) == 0x000000, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_struct_Variable) == 0x000004, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_struct_Variable_1) == 0x000008, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_object_Variable) == 0x000010, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000018, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_struct_Variable_2) == 0x000020, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, K2Node_CustomEvent_ProxyObject) == 0x000038, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, K2Node_CustomEvent_ActualChannel) == 0x000040, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_struct_Variable_3) == 0x000048, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_struct_Variable_4) == 0x00004C, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_object_Variable_1) == 0x000058, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_GetPayload_ReturnValue) == 0x000060, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x000068, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, K2Node_CustomEvent_ProxyObject_1) == 0x000078, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, K2Node_CustomEvent_ActualChannel_1) == 0x000080, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, Temp_struct_Variable_5) == 0x000098, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_K2_GetPawn_ReturnValue) == 0x0000A8, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_GetPayload_ReturnValue_1) == 0x0000B0, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_IsValid_ReturnValue_2) == 0x0000B1, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_GameWidgetGetAbilitySystemComponentFromActor_ReturnValue) == 0x0000B8, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_GameWidgetGetAbilitySystemComponentFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'WBP_Reticle_Torch_C_ExecuteUbergraph_WBP_Reticle_Torch::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function WBP_Reticle_Torch.WBP_Reticle_Torch_C.OnMessageReceived_15B6234F457FC0E74EA887BB5959681F
// 0x0010 (0x0010 - 0x0000)
struct WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F) == 0x000008, "Wrong alignment on WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F");
static_assert(sizeof(WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F) == 0x000010, "Wrong size on WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F");
static_assert(offsetof(WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F, ProxyObject) == 0x000000, "Member 'WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F::ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F, ActualChannel) == 0x000008, "Member 'WBP_Reticle_Torch_C_OnMessageReceived_15B6234F457FC0E74EA887BB5959681F::ActualChannel' has a wrong offset!");

// Function WBP_Reticle_Torch.WBP_Reticle_Torch_C.OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26
// 0x0010 (0x0010 - 0x0000)
struct WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26) == 0x000008, "Wrong alignment on WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26");
static_assert(sizeof(WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26) == 0x000010, "Wrong size on WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26");
static_assert(offsetof(WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26, ProxyObject) == 0x000000, "Member 'WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26::ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26, ActualChannel) == 0x000008, "Member 'WBP_Reticle_Torch_C_OnMessageReceived_19073F7340A6FC68E82C1895F94FAD26::ActualChannel' has a wrong offset!");

}

