#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoginWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TGFGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LoginWindow.WBP_LoginWindow_C
// 0x01A8 (0x0490 - 0x02E8)
class UWBP_LoginWindow_C final : public ULoginWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoginAnimation;                                    // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_1;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_2;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_3;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      ButtonCopyID;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      ButtonLiveMode;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonLiveModeHover;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonLiveModeText;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      CustomerServiceButton;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CustomerServiceButtonHover;                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      DiscordButton;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DiscordButtonHover;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LoadingText;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo1;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo2;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo3;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo4;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      NoticeButton;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NoticeButtonHover;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OpenIdText;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      QuitGameButton;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuitGameButtonHover;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SDKLoginButtonHover;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SDKLoginButtonText;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SDKLoginPanel;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SDKLogoutButtonHover;                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      SDKNoauthLoginButton;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      SDKQChatLoginButton;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SDKQChatLoginButtonHover;                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SDKQChatLoginButtonText;                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      SDKSetSensitiveButton;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SDKSetSensitiveButtonHover;                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SDKSetSensitiveButtonText;                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      SDKWChatLoginButton;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SDKWChatLoginButtonHover;                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SDKWChatLoginButtonText;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      SelectServerButton;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ServerName;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      StartGameButton;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           StartGamePanel;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Version;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   VFXlogin;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   VFXlogin_1;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VFXlogin1;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   VFXstart;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SaveGame_C*                         SaveGame;                                          // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UButton*                                SDKLoginSteamButton111;                            // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UServerItem*                            CurrentServerItem;                                 // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasNoticePopup;                                    // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_LoginWindow_ButtonCopyID_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_ButtonLiveMode_K2Node_ComponentBoundEvent_18_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_ButtonLiveMode_K2Node_ComponentBoundEvent_19_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_ButtonLiveMode_K2Node_ComponentBoundEvent_24_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_CustomerServiceButton_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_CustomerServiceButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_DiscodeButton_K2Node_ComponentBoundEvent_22_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_DiscodeButton_K2Node_ComponentBoundEvent_23_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_NoticeButton_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_NoticeButton_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_NoticeButton_K2Node_ComponentBoundEvent_17_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_QuitGameButton_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_QuitGameButton_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_QuitGameButton_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKLoginButton_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKLoginButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKLogoutButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKLogoutButton_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKLogoutButton_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKQChatLoginButton_K2Node_ComponentBoundEvent_21_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKSetSensitiveButton_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SDKWChatLoginButton_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_SelectServerButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_StartGameButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_LoginWindow_WBP_Tgf_Button_C_137_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void CheckInputText(bool* Valid);
	void CheckNoticePopup();
	void Construct();
	void ExecuteUbergraph_WBP_LoginWindow(int32 EntryPoint);
	void GetDefaultServerItem(class UServerItem** ServerItem);
	void GetSavedOpenId(class FString* OpenID);
	void GetSavedServerId(int32* ServerId);
	void GetSavedServerItem(class UServerItem** ServerItem);
	class FString GetServerUnavailableMessage(const class FString& UserData);
	void LoadOrCreateSaveGame();
	void OnCurrentServerChanged(class UTGFEventArgs* Args);
	void OnEnterStateConnectServer();
	void OnEnterStateGameLogin();
	void OnEnterStateLoadHall();
	void OnEnterStateNone();
	void OnEnterStateQueryDir();
	void OnEnterStateSDKLogin();
	void OnEnterStateSyncPlayerInfo();
	void OnEnterStateWaitingSDKLogin();
	void OnEnterStateWaitingStartGame();
	void SaveGameData();
	void SaveOpenId(const class FString& OpenID);
	void SaveServerId(int32 ServerId);
	void SequenceEvent();
	void SequenceEvent__ENTRYPOINTWBP_LoginWindow();
	void SetAppVersion();
	void SetCustomerServiceButton();
	void SetLiveModeButton();
	void SetSelectedServer();
	void SetSelectServerButton();
	void SetServer();
	void SetServerName(class UServerItem* ServerItem);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LoginWindow_C">();
	}
	static class UWBP_LoginWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LoginWindow_C>();
	}
};
static_assert(alignof(UWBP_LoginWindow_C) == 0x000008, "Wrong alignment on UWBP_LoginWindow_C");
static_assert(sizeof(UWBP_LoginWindow_C) == 0x000490, "Wrong size on UWBP_LoginWindow_C");
static_assert(offsetof(UWBP_LoginWindow_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_LoginWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, LoginAnimation) == 0x0002F0, "Member 'UWBP_LoginWindow_C::LoginAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Background) == 0x0002F8, "Member 'UWBP_LoginWindow_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Background_1) == 0x000300, "Member 'UWBP_LoginWindow_C::Background_1' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Background_2) == 0x000308, "Member 'UWBP_LoginWindow_C::Background_2' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Background_3) == 0x000310, "Member 'UWBP_LoginWindow_C::Background_3' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, ButtonCopyID) == 0x000318, "Member 'UWBP_LoginWindow_C::ButtonCopyID' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, ButtonLiveMode) == 0x000320, "Member 'UWBP_LoginWindow_C::ButtonLiveMode' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, ButtonLiveModeHover) == 0x000328, "Member 'UWBP_LoginWindow_C::ButtonLiveModeHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, ButtonLiveModeText) == 0x000330, "Member 'UWBP_LoginWindow_C::ButtonLiveModeText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, CustomerServiceButton) == 0x000338, "Member 'UWBP_LoginWindow_C::CustomerServiceButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, CustomerServiceButtonHover) == 0x000340, "Member 'UWBP_LoginWindow_C::CustomerServiceButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, DiscordButton) == 0x000348, "Member 'UWBP_LoginWindow_C::DiscordButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, DiscordButtonHover) == 0x000350, "Member 'UWBP_LoginWindow_C::DiscordButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, EditableTextBox) == 0x000358, "Member 'UWBP_LoginWindow_C::EditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, LoadingText) == 0x000360, "Member 'UWBP_LoginWindow_C::LoadingText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Logo1) == 0x000368, "Member 'UWBP_LoginWindow_C::Logo1' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Logo2) == 0x000370, "Member 'UWBP_LoginWindow_C::Logo2' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Logo3) == 0x000378, "Member 'UWBP_LoginWindow_C::Logo3' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Logo4) == 0x000380, "Member 'UWBP_LoginWindow_C::Logo4' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, NoticeButton) == 0x000388, "Member 'UWBP_LoginWindow_C::NoticeButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, NoticeButtonHover) == 0x000390, "Member 'UWBP_LoginWindow_C::NoticeButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, OpenIdText) == 0x000398, "Member 'UWBP_LoginWindow_C::OpenIdText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, QuitGameButton) == 0x0003A0, "Member 'UWBP_LoginWindow_C::QuitGameButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, QuitGameButtonHover) == 0x0003A8, "Member 'UWBP_LoginWindow_C::QuitGameButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKLoginButtonHover) == 0x0003B0, "Member 'UWBP_LoginWindow_C::SDKLoginButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKLoginButtonText) == 0x0003B8, "Member 'UWBP_LoginWindow_C::SDKLoginButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKLoginPanel) == 0x0003C0, "Member 'UWBP_LoginWindow_C::SDKLoginPanel' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKLogoutButtonHover) == 0x0003C8, "Member 'UWBP_LoginWindow_C::SDKLogoutButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKNoauthLoginButton) == 0x0003D0, "Member 'UWBP_LoginWindow_C::SDKNoauthLoginButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKQChatLoginButton) == 0x0003D8, "Member 'UWBP_LoginWindow_C::SDKQChatLoginButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKQChatLoginButtonHover) == 0x0003E0, "Member 'UWBP_LoginWindow_C::SDKQChatLoginButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKQChatLoginButtonText) == 0x0003E8, "Member 'UWBP_LoginWindow_C::SDKQChatLoginButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKSetSensitiveButton) == 0x0003F0, "Member 'UWBP_LoginWindow_C::SDKSetSensitiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKSetSensitiveButtonHover) == 0x0003F8, "Member 'UWBP_LoginWindow_C::SDKSetSensitiveButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKSetSensitiveButtonText) == 0x000400, "Member 'UWBP_LoginWindow_C::SDKSetSensitiveButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKWChatLoginButton) == 0x000408, "Member 'UWBP_LoginWindow_C::SDKWChatLoginButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKWChatLoginButtonHover) == 0x000410, "Member 'UWBP_LoginWindow_C::SDKWChatLoginButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKWChatLoginButtonText) == 0x000418, "Member 'UWBP_LoginWindow_C::SDKWChatLoginButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SelectServerButton) == 0x000420, "Member 'UWBP_LoginWindow_C::SelectServerButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, ServerName) == 0x000428, "Member 'UWBP_LoginWindow_C::ServerName' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, StartGameButton) == 0x000430, "Member 'UWBP_LoginWindow_C::StartGameButton' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, StartGamePanel) == 0x000438, "Member 'UWBP_LoginWindow_C::StartGamePanel' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Text) == 0x000440, "Member 'UWBP_LoginWindow_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, Version) == 0x000448, "Member 'UWBP_LoginWindow_C::Version' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, VFXlogin) == 0x000450, "Member 'UWBP_LoginWindow_C::VFXlogin' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, VFXlogin_1) == 0x000458, "Member 'UWBP_LoginWindow_C::VFXlogin_1' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, VFXlogin1) == 0x000460, "Member 'UWBP_LoginWindow_C::VFXlogin1' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, VFXstart) == 0x000468, "Member 'UWBP_LoginWindow_C::VFXstart' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SaveGame) == 0x000470, "Member 'UWBP_LoginWindow_C::SaveGame' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, SDKLoginSteamButton111) == 0x000478, "Member 'UWBP_LoginWindow_C::SDKLoginSteamButton111' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, CurrentServerItem) == 0x000480, "Member 'UWBP_LoginWindow_C::CurrentServerItem' has a wrong offset!");
static_assert(offsetof(UWBP_LoginWindow_C, HasNoticePopup) == 0x000488, "Member 'UWBP_LoginWindow_C::HasNoticePopup' has a wrong offset!");

}

