#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_Equipment_DropArea

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.DoTgfCustomNavigation
// 0x0050 (0x0050 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Result;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetNextFocWidget_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation) == 0x000050, "Wrong size on WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation, Param_Navigation) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation, Result) == 0x000008, "Member 'WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation::Result' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation, CallFunc_Conv_ByteToString_ReturnValue) == 0x000010, "Member 'WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation::CallFunc_Conv_ByteToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation, CallFunc_GetNextFocWidget_ReturnValue) == 0x000020, "Member 'WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation::CallFunc_GetNextFocWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation, CallFunc_GetObjectName_ReturnValue) == 0x000030, "Member 'WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'WBP_Inventory_Equipment_DropArea_C_DoTgfCustomNavigation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.ExecuteUbergraph_WBP_Inventory_Equipment_DropArea
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Temp_wildcard_Variable_1;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew;  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDragDropOperation*                     K2Node_CustomEvent_Operation;                      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDragDropOperation* Operation)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryDragDropOperation*         K2Node_CustomEvent_DragOperation;                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow;                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bMatches;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Query_Valid_Drop_bIsValid;                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchEquipmentWithSlot_bRoughlyMatch;     // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MatchEquipmentWithSlot_OutFailReason;     // 0x0080(0x0018)()
	bool                                          CallFunc_MatchEquipmentWithSlot_ReturnValue;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UTgfEquipmentDefinition>    CallFunc_GetEquipmentDefinition_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea) == 0x0000B0, "Wrong size on WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, EntryPoint) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, Temp_bool_not_found_Variable) == 0x000005, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::Temp_bool_not_found_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, Temp_wildcard_Variable) == 0x000008, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, Temp_wildcard_Variable_1) == 0x000010, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder) == 0x000020, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_GetInventoryContext_InventoryContextNew) == 0x000038, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_GetInventoryContext_InventoryContextNew' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000048, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_DoesImplementInterface_ReturnValue) == 0x000050, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_Event_IsDesignTime) == 0x000051, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_CustomEvent_Operation) == 0x000058, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_CustomEvent_Operation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_CustomEvent_DragOperation) == 0x000070, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_CustomEvent_DragOperation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_CustomEvent_bShow) == 0x000078, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_CustomEvent_bShow' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, K2Node_CustomEvent_bMatches) == 0x000079, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::K2Node_CustomEvent_bMatches' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_Query_Valid_Drop_bIsValid) == 0x00007A, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_Query_Valid_Drop_bIsValid' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_MatchEquipmentWithSlot_bRoughlyMatch) == 0x00007B, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_MatchEquipmentWithSlot_bRoughlyMatch' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_MatchEquipmentWithSlot_OutFailReason) == 0x000080, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_MatchEquipmentWithSlot_OutFailReason' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_MatchEquipmentWithSlot_ReturnValue) == 0x000098, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_MatchEquipmentWithSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_GetEquipmentDefinition_ReturnValue) == 0x0000A0, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_GetEquipmentDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea, CallFunc_IsValidClass_ReturnValue) == 0x0000A8, "Member 'WBP_Inventory_Equipment_DropArea_C_ExecuteUbergraph_WBP_Inventory_Equipment_DropArea::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.OnDragEnter
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0040(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InventoryContext_C*                 ToContext;                                         // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowsDrop;                                       // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_OnDragEnter) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_OnDragEnter");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_OnDragEnter) == 0x0000F0, "Wrong size on WBP_Inventory_Equipment_DropArea_C_OnDragEnter");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDragEnter, PointerEvent) == 0x000040, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDragEnter, Operation) == 0x0000D8, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDragEnter::Operation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDragEnter, ToContext) == 0x0000E0, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDragEnter::ToContext' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDragEnter, bAllowsDrop) == 0x0000E8, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDragEnter::bAllowsDrop' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.OnDragLeave
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_OnDragLeave) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_OnDragLeave");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_OnDragLeave) == 0x0000A0, "Wrong size on WBP_Inventory_Equipment_DropArea_C_OnDragLeave");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDragLeave, Operation) == 0x000098, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDragLeave::Operation' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.OnDrop
// 0x0178 (0x0178 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0040(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable;                            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Inventory_DragDrop_Base_C*          K2Node_DynamicCast_AsBP_Inventory_Drag_Drop_Base;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UInventoryFragment_Sound*         CallFunc_FindFragmentByClass_ReturnValue;          // 0x0108(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_1;                          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0120(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew;  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_DropToEquipmentSlot_OutFailReason;        // 0x0158(0x0018)()
	bool                                          CallFunc_DropToEquipmentSlot_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable;                      // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_OnDrop) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_OnDrop");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_OnDrop) == 0x000178, "Wrong size on WBP_Inventory_Equipment_DropArea_C_OnDrop");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, MyGeometry) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, PointerEvent) == 0x000040, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, Operation) == 0x0000D8, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, ReturnValue) == 0x0000E0, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, Temp_wildcard_Variable) == 0x0000E8, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, K2Node_DynamicCast_AsBP_Inventory_Drag_Drop_Base) == 0x0000F0, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::K2Node_DynamicCast_AsBP_Inventory_Drag_Drop_Base' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_IsValid_ReturnValue) == 0x0000F9, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000100, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_FindFragmentByClass_ReturnValue) == 0x000108, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_FindFragmentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_IsValid_ReturnValue_2) == 0x000111, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_DoesImplementInterface_ReturnValue) == 0x000112, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, Temp_wildcard_Variable_1) == 0x000118, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, Temp_delegate_Variable) == 0x000120, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder) == 0x000130, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_PostEvent_ReturnValue) == 0x000144, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_GetInventoryContext_InventoryContextNew) == 0x000148, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_GetInventoryContext_InventoryContextNew' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_IsValid_ReturnValue_3) == 0x000150, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_IsValid_ReturnValue_4) == 0x000151, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_DropToEquipmentSlot_OutFailReason) == 0x000158, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_DropToEquipmentSlot_OutFailReason' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, CallFunc_DropToEquipmentSlot_ReturnValue) == 0x000170, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::CallFunc_DropToEquipmentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnDrop, Temp_bool_not_found_Variable) == 0x000171, "Member 'WBP_Inventory_Equipment_DropArea_C_OnDrop::Temp_bool_not_found_Variable' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.OnInventoryDragInitiated
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_OnInventoryDragInitiated final
{
public:
	class UTgfInventoryDragDropOperation*         DragOperation;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_OnInventoryDragInitiated) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_OnInventoryDragInitiated");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_OnInventoryDragInitiated) == 0x000008, "Wrong size on WBP_Inventory_Equipment_DropArea_C_OnInventoryDragInitiated");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnInventoryDragInitiated, DragOperation) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_OnInventoryDragInitiated::DragOperation' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.OnItemDragEnded
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_OnItemDragEnded final
{
public:
	class UDragDropOperation*                     Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_OnItemDragEnded) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_OnItemDragEnded");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_OnItemDragEnded) == 0x000008, "Wrong size on WBP_Inventory_Equipment_DropArea_C_OnItemDragEnded");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnItemDragEnded, Operation) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_OnItemDragEnded::Operation' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.OnItemDrop__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_OnItemDrop__DelegateSignature final
{
public:
	class UBP_Inventory_DragDrop_Base_C*          DropOperation;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_OnItemDrop__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_OnItemDrop__DelegateSignature");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_OnItemDrop__DelegateSignature) == 0x000008, "Wrong size on WBP_Inventory_Equipment_DropArea_C_OnItemDrop__DelegateSignature");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_OnItemDrop__DelegateSignature, DropOperation) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_OnItemDrop__DelegateSignature::DropOperation' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_PreConstruct");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_PreConstruct) == 0x000001, "Wrong size on WBP_Inventory_Equipment_DropArea_C_PreConstruct");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.Query Valid Drop
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop final
{
public:
	class UDragDropOperation*                     Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InventoryContext_C*                 ToContext;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_not_found_Variable;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryDragDropOperation*         K2Node_DynamicCast_AsTgf_Inventory_Drag_Drop_Operation; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_wildcard_Variable_1;                          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_InventoryContextHolder_C> K2Node_DynamicCast_AsBPI_Inventory_Context_Holder; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper*                   CallFunc_GetInventoryContext_InventoryContextNew;  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_DropToEquipmentSlot_OutFailReason;        // 0x0080(0x0018)()
	bool                                          CallFunc_DropToEquipmentSlot_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop) == 0x0000A0, "Wrong size on WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, Operation) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, bIsValid) == 0x000008, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::bIsValid' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, ToContext) == 0x000010, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::ToContext' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, Temp_bool_not_found_Variable) == 0x000018, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::Temp_bool_not_found_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, K2Node_DynamicCast_AsTgf_Inventory_Drag_Drop_Operation) == 0x000020, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::K2Node_DynamicCast_AsTgf_Inventory_Drag_Drop_Operation' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, Temp_wildcard_Variable) == 0x000030, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000040, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_DoesImplementInterface_ReturnValue) == 0x000048, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, Temp_wildcard_Variable_1) == 0x000050, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, K2Node_DynamicCast_AsBPI_Inventory_Context_Holder) == 0x000058, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::K2Node_DynamicCast_AsBPI_Inventory_Context_Holder' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_GetInventoryContext_InventoryContextNew) == 0x000070, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_GetInventoryContext_InventoryContextNew' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_DropToEquipmentSlot_OutFailReason) == 0x000080, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_DropToEquipmentSlot_OutFailReason' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop, CallFunc_DropToEquipmentSlot_ReturnValue) == 0x000098, "Member 'WBP_Inventory_Equipment_DropArea_C_Query_Valid_Drop::CallFunc_DropToEquipmentSlot_ReturnValue' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.Show Hide Drop Indicator
// 0x0005 (0x0005 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator) == 0x000001, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator) == 0x000005, "Wrong size on WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator, bShow) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator::bShow' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator, Temp_bool_Variable) == 0x000001, "Member 'WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator, Temp_byte_Variable) == 0x000002, "Member 'WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator, K2Node_Select_Default) == 0x000004, "Member 'WBP_Inventory_Equipment_DropArea_C_Show_Hide_Drop_Indicator::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.ShowIndicatorExternally
// 0x0002 (0x0002 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMatches;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally) == 0x000001, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally) == 0x000002, "Wrong size on WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally, bShow) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally::bShow' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally, bMatches) == 0x000001, "Member 'WBP_Inventory_Equipment_DropArea_C_ShowIndicatorExternally::bMatches' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.Update Drop Indicator Image
// 0x0130 (0x0130 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x002C(0x0014)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0060(0x00D0)()
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image) == 0x000010, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image) == 0x000130, "Wrong size on WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, Temp_bool_Variable) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, Temp_object_Variable) == 0x000008, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, CallFunc_SelectColor_ReturnValue) == 0x00001C, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, K2Node_MakeStruct_SlateColor) == 0x00002C, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, K2Node_MakeStruct_Margin) == 0x000044, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, K2Node_Select_Default) == 0x000058, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image, K2Node_MakeStruct_SlateBrush) == 0x000060, "Member 'WBP_Inventory_Equipment_DropArea_C_Update_Drop_Indicator_Image::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function WBP_Inventory_Equipment_DropArea.WBP_Inventory_Equipment_DropArea_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Inventory_Equipment_DropArea_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Equipment_DropArea_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_Inventory_Equipment_DropArea_C_GetModuleName");
static_assert(sizeof(WBP_Inventory_Equipment_DropArea_C_GetModuleName) == 0x000010, "Wrong size on WBP_Inventory_Equipment_DropArea_C_GetModuleName");
static_assert(offsetof(WBP_Inventory_Equipment_DropArea_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_Inventory_Equipment_DropArea_C_GetModuleName::ReturnValue' has a wrong offset!");

}

