#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Common_Button_Simple

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Common_Button_Simple.WBP_Common_Button_Simple_C
// 0x0478 (0x06F0 - 0x0278)
class UWBP_Common_Button_Simple_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ButtonBg;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      ButtonClick;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBg;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextNormal;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextName;                                          // 0x02A8(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             ButtonClicked;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             Texture;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ClickSound;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Height;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Width;                                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           ButtonStyle;                                       // 0x02F0(0x03F0)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Font_Size;                                         // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableClick;                                      // 0x06E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Common_Button_Simple_ButtonClick_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Common_Button_Single_ButtonClick_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Common_Button_Single_ButtonClick_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ButtonClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Common_Button_Simple(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBg(class UTexture2D* Param_Texture);
	void SetName(const class FText& Param_Name);
	void SetSize(double Param_Width, double Hight);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Common_Button_Simple_C">();
	}
	static class UWBP_Common_Button_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Common_Button_Simple_C>();
	}
};
static_assert(alignof(UWBP_Common_Button_Simple_C) == 0x000010, "Wrong alignment on UWBP_Common_Button_Simple_C");
static_assert(sizeof(UWBP_Common_Button_Simple_C) == 0x0006F0, "Wrong size on UWBP_Common_Button_Simple_C");
static_assert(offsetof(UWBP_Common_Button_Simple_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Common_Button_Simple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, ButtonBg) == 0x000280, "Member 'UWBP_Common_Button_Simple_C::ButtonBg' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, ButtonClick) == 0x000288, "Member 'UWBP_Common_Button_Simple_C::ButtonClick' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, HoverBg) == 0x000290, "Member 'UWBP_Common_Button_Simple_C::HoverBg' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, SizeBox) == 0x000298, "Member 'UWBP_Common_Button_Simple_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, TextNormal) == 0x0002A0, "Member 'UWBP_Common_Button_Simple_C::TextNormal' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, TextName) == 0x0002A8, "Member 'UWBP_Common_Button_Simple_C::TextName' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, ButtonClicked) == 0x0002C0, "Member 'UWBP_Common_Button_Simple_C::ButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, Texture) == 0x0002D0, "Member 'UWBP_Common_Button_Simple_C::Texture' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, ClickSound) == 0x0002D8, "Member 'UWBP_Common_Button_Simple_C::ClickSound' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, Height) == 0x0002E0, "Member 'UWBP_Common_Button_Simple_C::Height' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, Width) == 0x0002E8, "Member 'UWBP_Common_Button_Simple_C::Width' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, ButtonStyle) == 0x0002F0, "Member 'UWBP_Common_Button_Simple_C::ButtonStyle' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, Font_Size) == 0x0006E0, "Member 'UWBP_Common_Button_Simple_C::Font_Size' has a wrong offset!");
static_assert(offsetof(UWBP_Common_Button_Simple_C, DisableClick) == 0x0006E4, "Member 'UWBP_Common_Button_Simple_C::DisableClick' has a wrong offset!");

}

