#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NoticeInfo

#include "Basic.hpp"

#include "TGFGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_NoticeInfo.WBP_NoticeInfo_C.SetData
// 0x02D8 (0x02D8 - 0x0000)
struct WBP_NoticeInfo_C_SetData final
{
public:
	struct FSDKNoticeInfo                         NoticeInfo;                                        // 0x0000(0x0178)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UWBP_GuidePoint_C*                      CellItem;                                          // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSDKNoticeTextInfo                     CallFunc_GetNoticeTextInfo_ReturnValue;            // 0x0188(0x0080)(ConstParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatToLocalTime_ReturnValue;            // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0220(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0238(0x0018)()
	struct FStringResult                          CallFunc_ConvertDateTimeToLocal_ReturnValue;       // 0x0250(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0268(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0280(0x0018)()
	class FString                                 CallFunc_Split_LeftS;                              // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x02C0(0x0018)()
};
static_assert(alignof(WBP_NoticeInfo_C_SetData) == 0x000008, "Wrong alignment on WBP_NoticeInfo_C_SetData");
static_assert(sizeof(WBP_NoticeInfo_C_SetData) == 0x0002D8, "Wrong size on WBP_NoticeInfo_C_SetData");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, NoticeInfo) == 0x000000, "Member 'WBP_NoticeInfo_C_SetData::NoticeInfo' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CellItem) == 0x000178, "Member 'WBP_NoticeInfo_C_SetData::CellItem' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CurrentIndex) == 0x000180, "Member 'WBP_NoticeInfo_C_SetData::CurrentIndex' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_GetNoticeTextInfo_ReturnValue) == 0x000188, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_GetNoticeTextInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000208, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_FormatToLocalTime_ReturnValue) == 0x000210, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_FormatToLocalTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Conv_StringToText_ReturnValue) == 0x000220, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000238, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_ConvertDateTimeToLocal_ReturnValue) == 0x000250, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_ConvertDateTimeToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000268, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000280, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Split_LeftS) == 0x000298, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Split_RightS) == 0x0002A8, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Split_ReturnValue) == 0x0002B8, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NoticeInfo_C_SetData, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0002C0, "Member 'WBP_NoticeInfo_C_SetData::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");

// Function WBP_NoticeInfo.WBP_NoticeInfo_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_NoticeInfo_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NoticeInfo_C_GetModuleName) == 0x000008, "Wrong alignment on WBP_NoticeInfo_C_GetModuleName");
static_assert(sizeof(WBP_NoticeInfo_C_GetModuleName) == 0x000010, "Wrong size on WBP_NoticeInfo_C_GetModuleName");
static_assert(offsetof(WBP_NoticeInfo_C_GetModuleName, ReturnValue) == 0x000000, "Member 'WBP_NoticeInfo_C_GetModuleName::ReturnValue' has a wrong offset!");

}

