#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_InventoryMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CommonInput_structs.hpp"
#include "LyraGame_structs.hpp"
#include "LyraGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TgfGame_InventoryMenu.WBP_TgfGame_InventoryMenu_C
// 0x00E0 (0x04D0 - 0x03F0)
class UWBP_TgfGame_InventoryMenu_C final : public ULyraActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TransitionOut;                                     // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionIn;                                      // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_Attribute_C*     AttributePanel;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AttributeSection;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CapturedCharacter;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PopupOverlay;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_22;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DragDropIntercepter_C*             WBP_DragDropIntercepter;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Inventory_CharacterSection_C*      WBP_Inventory_CharacterSection;                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TgfGame_Inventory_LootSection_C*   WBP_TgfGame_Inventory_LootSection;                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_SceneCaptureRig_C*                  CaptureRig;                                        // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Render_Target;                                     // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bTransitionInFinished;                             // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstTimeButtonUp;                                // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETgfActorCareer                               DesignerPreviewCareer;                             // 0x045A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45B[0x5];                                      // 0x045B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfInventoryWrapper_InGame*            InventoryContext;                                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULyraAbilitySystemComponent*            AbilitySystem;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ALyraCharacter*                         LyraCharacter;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ETgfActorCareer                               ActorCareer;                                       // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTgfFirstLevelAttrDataAsset*            TalentDataAsset;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ETgfActorRace                                 Actor_Race;                                        // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FireQ;                                             // 0x048C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FireE;                                             // 0x0494(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ChargeQ;                                           // 0x049C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ChargeE;                                           // 0x04A4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MessageTag;                                        // 0x04AC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  AttrChangeAction;                                  // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DisplayAttributeTable;                             // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTgfWidgetGamepadWrapper*               GamepadWrapper;                                    // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindActionEvent();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CreateCaptureIn();
	void DropItem(class UDragDropOperation* Operation);
	void ExecuteUbergraph_WBP_TgfGame_InventoryMenu(int32 EntryPoint);
	void FinishTransitionIn();
	void GetAttributeValue(EnRoleDisplayAttribueID Attribute_id, double* Value, double* Base, double* Max);
	void GetCharacterSectionPositon(struct FVector2D* LeftTop, struct FVector2D* Size);
	void GetInventoryContext(class UTgfInventoryWrapper** InventoryContextNew);
	void IsCloseKey(const struct FKey& Key, bool* Result);
	void OnAttributeChanged();
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnInitialized();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void PlayBackgroundEffect();
	void SequenceEvent__ENTRYPOINTWBP_TgfGame_InventoryMenu();
	void SequenceEvent__ENTRYPOINTWBP_TgfGame_InventoryMenu_0();
	void Set_Detail_Attribute(int32 Param_Index, TArray<class UWBP_TgfGame_Inventory_Attribute_ListItem2_C*>& AttributeItems, class UWrapBox* Attr_parent, const struct FRoleDisplayAttribute& Attr_config, bool* Ret);
	void SetAttrValue(double Value, class UWBP_TgfGame_Inventory_Attribute_ListItem1_C* Item, const class FText& Param_Name, const struct FRoleDisplayAttribute& Attr_config);
	void SetUp(class AController* _Controller, class ALyraCharacter* Character, class ULyraInventoryManagerComponent* Loot_Inventory, class ULyraEquipmentManagerComponent* Loot_Equipment, class ALyraCharacter* MyCharacter);
	void TestPos();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Attributes(class ULyraAbilitySystemComponent* Ablity);
	void UpdateDetailAttributes();
	void UpdateRoleInfo(ETgfActorCareer Career);

	class UWidget* BP_GetDesiredFocusTarget() const;
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TgfGame_InventoryMenu_C">();
	}
	static class UWBP_TgfGame_InventoryMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TgfGame_InventoryMenu_C>();
	}
};
static_assert(alignof(UWBP_TgfGame_InventoryMenu_C) == 0x000008, "Wrong alignment on UWBP_TgfGame_InventoryMenu_C");
static_assert(sizeof(UWBP_TgfGame_InventoryMenu_C) == 0x0004D0, "Wrong size on UWBP_TgfGame_InventoryMenu_C");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, UberGraphFrame) == 0x0003F0, "Member 'UWBP_TgfGame_InventoryMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, TransitionOut) == 0x0003F8, "Member 'UWBP_TgfGame_InventoryMenu_C::TransitionOut' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, TransitionIn) == 0x000400, "Member 'UWBP_TgfGame_InventoryMenu_C::TransitionIn' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, AttributePanel) == 0x000408, "Member 'UWBP_TgfGame_InventoryMenu_C::AttributePanel' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, AttributeSection) == 0x000410, "Member 'UWBP_TgfGame_InventoryMenu_C::AttributeSection' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, CapturedCharacter) == 0x000418, "Member 'UWBP_TgfGame_InventoryMenu_C::CapturedCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, PopupOverlay) == 0x000420, "Member 'UWBP_TgfGame_InventoryMenu_C::PopupOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, SafeZone_22) == 0x000428, "Member 'UWBP_TgfGame_InventoryMenu_C::SafeZone_22' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, WBP_DragDropIntercepter) == 0x000430, "Member 'UWBP_TgfGame_InventoryMenu_C::WBP_DragDropIntercepter' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, WBP_Inventory_CharacterSection) == 0x000438, "Member 'UWBP_TgfGame_InventoryMenu_C::WBP_Inventory_CharacterSection' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, WBP_TgfGame_Inventory_LootSection) == 0x000440, "Member 'UWBP_TgfGame_InventoryMenu_C::WBP_TgfGame_Inventory_LootSection' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, CaptureRig) == 0x000448, "Member 'UWBP_TgfGame_InventoryMenu_C::CaptureRig' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, Render_Target) == 0x000450, "Member 'UWBP_TgfGame_InventoryMenu_C::Render_Target' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, bTransitionInFinished) == 0x000458, "Member 'UWBP_TgfGame_InventoryMenu_C::bTransitionInFinished' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, bFirstTimeButtonUp) == 0x000459, "Member 'UWBP_TgfGame_InventoryMenu_C::bFirstTimeButtonUp' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, DesignerPreviewCareer) == 0x00045A, "Member 'UWBP_TgfGame_InventoryMenu_C::DesignerPreviewCareer' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, InventoryContext) == 0x000460, "Member 'UWBP_TgfGame_InventoryMenu_C::InventoryContext' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, AbilitySystem) == 0x000468, "Member 'UWBP_TgfGame_InventoryMenu_C::AbilitySystem' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, LyraCharacter) == 0x000470, "Member 'UWBP_TgfGame_InventoryMenu_C::LyraCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, ActorCareer) == 0x000478, "Member 'UWBP_TgfGame_InventoryMenu_C::ActorCareer' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, TalentDataAsset) == 0x000480, "Member 'UWBP_TgfGame_InventoryMenu_C::TalentDataAsset' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, Actor_Race) == 0x000488, "Member 'UWBP_TgfGame_InventoryMenu_C::Actor_Race' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, FireQ) == 0x00048C, "Member 'UWBP_TgfGame_InventoryMenu_C::FireQ' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, FireE) == 0x000494, "Member 'UWBP_TgfGame_InventoryMenu_C::FireE' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, ChargeQ) == 0x00049C, "Member 'UWBP_TgfGame_InventoryMenu_C::ChargeQ' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, ChargeE) == 0x0004A4, "Member 'UWBP_TgfGame_InventoryMenu_C::ChargeE' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, MessageTag) == 0x0004AC, "Member 'UWBP_TgfGame_InventoryMenu_C::MessageTag' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, AttrChangeAction) == 0x0004B8, "Member 'UWBP_TgfGame_InventoryMenu_C::AttrChangeAction' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, DisplayAttributeTable) == 0x0004C0, "Member 'UWBP_TgfGame_InventoryMenu_C::DisplayAttributeTable' has a wrong offset!");
static_assert(offsetof(UWBP_TgfGame_InventoryMenu_C, GamepadWrapper) == 0x0004C8, "Member 'UWBP_TgfGame_InventoryMenu_C::GamepadWrapper' has a wrong offset!");

}

