#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemGearSetSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemGearSetSlot.WBP_ItemGearSetSlot_C
// 0x0028 (0x02A0 - 0x0278)
class UWBP_ItemGearSetSlot_C final : public UUserWidget
{
public:
	class UWBP_ItemGearSetLine_C*                 GearSetLine;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   GearSetTitle;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemGearSetIcon;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separation;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowSeparation(bool bShow);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemGearSetSlot_C">();
	}
	static class UWBP_ItemGearSetSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemGearSetSlot_C>();
	}
};
static_assert(alignof(UWBP_ItemGearSetSlot_C) == 0x000008, "Wrong alignment on UWBP_ItemGearSetSlot_C");
static_assert(sizeof(UWBP_ItemGearSetSlot_C) == 0x0002A0, "Wrong size on UWBP_ItemGearSetSlot_C");
static_assert(offsetof(UWBP_ItemGearSetSlot_C, GearSetLine) == 0x000278, "Member 'UWBP_ItemGearSetSlot_C::GearSetLine' has a wrong offset!");
static_assert(offsetof(UWBP_ItemGearSetSlot_C, GearSetTitle) == 0x000280, "Member 'UWBP_ItemGearSetSlot_C::GearSetTitle' has a wrong offset!");
static_assert(offsetof(UWBP_ItemGearSetSlot_C, ItemGearSetIcon) == 0x000288, "Member 'UWBP_ItemGearSetSlot_C::ItemGearSetIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ItemGearSetSlot_C, Separation) == 0x000290, "Member 'UWBP_ItemGearSetSlot_C::Separation' has a wrong offset!");
static_assert(offsetof(UWBP_ItemGearSetSlot_C, VerticalBox) == 0x000298, "Member 'UWBP_ItemGearSetSlot_C::VerticalBox' has a wrong offset!");

}

