#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuideWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TGFGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GuideWindow.WBP_GuideWindow_C
// 0x0060 (0x0318 - 0x02B8)
class UWBP_GuideWindow_C final : public UGuideWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Start;                                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tgf_ButtonBase_C*                  ButtonClose;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonOut;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               List;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               SheetWrapBox;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GuideInfo_C*                       WBP_GuideInfo;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FName>                           BigRawNames;                                       // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_GuideMainItem_C*>           SheetItemList;                                     // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   SelectId;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GuideWindow_ButtonClose_1_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_GuideWindow_ButtonOut_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_GuideWindow(int32 EntryPoint);
	void InitConfigData();
	void OnItemSelect(class FName Select_Id);
	struct FEventReply OnUserKeyUp(const struct FKeyEvent& InKeyEvent);
	void ReceiveOnClose();
	void ReceiveOnOpen(class UTGFWindowArgs* Args);
	void SetDetail();
	void SetSheetList();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GuideWindow_C">();
	}
	static class UWBP_GuideWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GuideWindow_C>();
	}
};
static_assert(alignof(UWBP_GuideWindow_C) == 0x000008, "Wrong alignment on UWBP_GuideWindow_C");
static_assert(sizeof(UWBP_GuideWindow_C) == 0x000318, "Wrong size on UWBP_GuideWindow_C");
static_assert(offsetof(UWBP_GuideWindow_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_GuideWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, Start) == 0x0002C0, "Member 'UWBP_GuideWindow_C::Start' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, ButtonClose) == 0x0002C8, "Member 'UWBP_GuideWindow_C::ButtonClose' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, ButtonOut) == 0x0002D0, "Member 'UWBP_GuideWindow_C::ButtonOut' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, List) == 0x0002D8, "Member 'UWBP_GuideWindow_C::List' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, SheetWrapBox) == 0x0002E0, "Member 'UWBP_GuideWindow_C::SheetWrapBox' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, WBP_GuideInfo) == 0x0002E8, "Member 'UWBP_GuideWindow_C::WBP_GuideInfo' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, BigRawNames) == 0x0002F0, "Member 'UWBP_GuideWindow_C::BigRawNames' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, SheetItemList) == 0x000300, "Member 'UWBP_GuideWindow_C::SheetItemList' has a wrong offset!");
static_assert(offsetof(UWBP_GuideWindow_C, SelectId) == 0x000310, "Member 'UWBP_GuideWindow_C::SelectId' has a wrong offset!");

}

