#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_PostGame_Extraction

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_PostGame_Extraction.WBP_TgfGame_PostGame_Extraction_C.ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction
// 0x0050 (0x0050 - 0x0000)
struct WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction) == 0x000008, "Wrong alignment on WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction");
static_assert(sizeof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction) == 0x000050, "Wrong size on WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, Temp_delegate_Variable) == 0x000004, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, CallFunc_PostEvent_ReturnValue) == 0x000020, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, Temp_delegate_Variable_1) == 0x000024, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, Temp_delegate_Variable_2) == 0x000034, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, CallFunc_PostEvent_ReturnValue_1) == 0x000044, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction, CallFunc_PostEvent_ReturnValue_2) == 0x000048, "Member 'WBP_TgfGame_PostGame_Extraction_C_ExecuteUbergraph_WBP_TgfGame_PostGame_Extraction::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");

}

