#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemToolTips_CompareBattle

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TGFBattleProtocol_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemToolTips_CompareBattle.WBP_ItemToolTips_CompareBattle_C
// 0x0070 (0x02E8 - 0x0278)
class UWBP_ItemToolTips_CompareBattle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_41;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_34;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemTooltip_Battle_C*              WBP_ItemTooltip;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemTooltip_Battle_C*              WBP_ItemTooltip_Comparison;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTgfInventoryItemWrapper*               Item;                                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryWrapper*                   Inventory_Context;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTgfInventoryWrapper*                   Root_Inventory_Context;                            // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ParentPos;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ParentSize;                                        // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Parent_Cell;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowAtLeft;                                        // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseAsBuiltinTooltips;                             // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowUnkonw;                                        // 0x02E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnTooltipClosed();
	void BP_OnTooltipOpening();
	void ExecuteUbergraph_WBP_ItemToolTips_CompareBattle(int32 EntryPoint);
	void HaveOwnerList(bool* Ret);
	void HideComparison();
	void ItemCanCompare(bool* Ret);
	void OnPoseEvent();
	void OnToggleCompareMode(bool bCompareModeOn);
	void OnToggleUserListMode(bool bCompareModeOn);
	void PreConstruct(bool IsDesignTime);
	void ResetData();
	void SetUp(class UTgfInventoryWrapper* Param_Inventory_Context, class UTgfInventoryWrapper* Param_Root_Inventory_Context, class UTgfInventoryItemWrapper* Param_Item, ETGFProtoTgfEnItemStorageType Storage_Type, bool bDisplayAttributeAsRangeForSelf, bool Param_ShowUnkonw);
	void ShowComparison();
	void ShowTooltips(const struct FVector2D& Parent_pos, const struct FVector2D& Parent_size, class UUserWidget* Parent_cell);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePos();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemToolTips_CompareBattle_C">();
	}
	static class UWBP_ItemToolTips_CompareBattle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemToolTips_CompareBattle_C>();
	}
};
static_assert(alignof(UWBP_ItemToolTips_CompareBattle_C) == 0x000008, "Wrong alignment on UWBP_ItemToolTips_CompareBattle_C");
static_assert(sizeof(UWBP_ItemToolTips_CompareBattle_C) == 0x0002E8, "Wrong size on UWBP_ItemToolTips_CompareBattle_C");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, UberGraphFrame) == 0x000278, "Member 'UWBP_ItemToolTips_CompareBattle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, HorizontalBox_41) == 0x000280, "Member 'UWBP_ItemToolTips_CompareBattle_C::HorizontalBox_41' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, Overlay_34) == 0x000288, "Member 'UWBP_ItemToolTips_CompareBattle_C::Overlay_34' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, WBP_ItemTooltip) == 0x000290, "Member 'UWBP_ItemToolTips_CompareBattle_C::WBP_ItemTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, WBP_ItemTooltip_Comparison) == 0x000298, "Member 'UWBP_ItemToolTips_CompareBattle_C::WBP_ItemTooltip_Comparison' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, Item) == 0x0002A0, "Member 'UWBP_ItemToolTips_CompareBattle_C::Item' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, Inventory_Context) == 0x0002A8, "Member 'UWBP_ItemToolTips_CompareBattle_C::Inventory_Context' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, Root_Inventory_Context) == 0x0002B0, "Member 'UWBP_ItemToolTips_CompareBattle_C::Root_Inventory_Context' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, ParentPos) == 0x0002B8, "Member 'UWBP_ItemToolTips_CompareBattle_C::ParentPos' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, ParentSize) == 0x0002C8, "Member 'UWBP_ItemToolTips_CompareBattle_C::ParentSize' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, Parent_Cell) == 0x0002D8, "Member 'UWBP_ItemToolTips_CompareBattle_C::Parent_Cell' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, ShowAtLeft) == 0x0002E0, "Member 'UWBP_ItemToolTips_CompareBattle_C::ShowAtLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, bUseAsBuiltinTooltips) == 0x0002E1, "Member 'UWBP_ItemToolTips_CompareBattle_C::bUseAsBuiltinTooltips' has a wrong offset!");
static_assert(offsetof(UWBP_ItemToolTips_CompareBattle_C, ShowUnkonw) == 0x0002E2, "Member 'UWBP_ItemToolTips_CompareBattle_C::ShowUnkonw' has a wrong offset!");

}

