#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TGFFramework_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingPopup.WBP_SettingPopup_C
// 0x00E0 (0x0398 - 0x02B8)
class UWBP_SettingPopup_C final : public UTGFWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Star;                                              // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnAccountCenter;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BtnAccountCenterText;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnBackToAdventure;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnBeginner;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnChangeCharacter;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BtnChangeCharacterText;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnCustomerService;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BtnCustomerServiceText;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnGuide;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnNotice;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_RedDot_Hall_C*              BtnNoticeRedDot;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BtnNoticeText;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnQuit;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnRedeem;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BtnRedeemText;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Tgf_Button_C*                      BtnSetting;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonBackToAdventureText;                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonCloseText;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonGuideText;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonQuitText;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonSettingText;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LIActivity;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mask;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Version;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_ListPanel_C*              WBP_GameMenu_ListPanel;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         ReportTimeStamp;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__SettingPopup_BtnQuit_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SettingPopup_BtnSetting_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnAccountCenter_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnAccountCenter_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnAccountCenter_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnAccountCenter_K2Node_ComponentBoundEvent_21_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnAccountCenter_K2Node_ComponentBoundEvent_22_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnBackToAdventure_K2Node_ComponentBoundEvent_24_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnBackToAdventure_K2Node_ComponentBoundEvent_25_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnClose_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnClose_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnCustomerService_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnCustomerService_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnGuide_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnGuide_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnGuide_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnNotice_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnNotice_K2Node_ComponentBoundEvent_18_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnNotice_K2Node_ComponentBoundEvent_19_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnQuit_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnQuit_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnRedeem_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnRedeem_K2Node_ComponentBoundEvent_23_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnSetting_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_SettingPopup_BtnSetting_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_SettingPopup(int32 EntryPoint);
	struct FEventReply On_Mouse_Button_Down(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnUserKeyUp(const struct FKeyEvent& InKeyEvent);
	void ReceiveOnClose();
	void ReceiveOnOpen(class UTGFWindowArgs* Args);
	void RefreshRedDot();
	void SetAppVersion();
	void SetCustomerServiceButton();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingPopup_C">();
	}
	static class UWBP_SettingPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingPopup_C>();
	}
};
static_assert(alignof(UWBP_SettingPopup_C) == 0x000008, "Wrong alignment on UWBP_SettingPopup_C");
static_assert(sizeof(UWBP_SettingPopup_C) == 0x000398, "Wrong size on UWBP_SettingPopup_C");
static_assert(offsetof(UWBP_SettingPopup_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_SettingPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, Star) == 0x0002C0, "Member 'UWBP_SettingPopup_C::Star' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnAccountCenter) == 0x0002C8, "Member 'UWBP_SettingPopup_C::BtnAccountCenter' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnAccountCenterText) == 0x0002D0, "Member 'UWBP_SettingPopup_C::BtnAccountCenterText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnBackToAdventure) == 0x0002D8, "Member 'UWBP_SettingPopup_C::BtnBackToAdventure' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnBeginner) == 0x0002E0, "Member 'UWBP_SettingPopup_C::BtnBeginner' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnChangeCharacter) == 0x0002E8, "Member 'UWBP_SettingPopup_C::BtnChangeCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnChangeCharacterText) == 0x0002F0, "Member 'UWBP_SettingPopup_C::BtnChangeCharacterText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnCustomerService) == 0x0002F8, "Member 'UWBP_SettingPopup_C::BtnCustomerService' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnCustomerServiceText) == 0x000300, "Member 'UWBP_SettingPopup_C::BtnCustomerServiceText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnGuide) == 0x000308, "Member 'UWBP_SettingPopup_C::BtnGuide' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnNotice) == 0x000310, "Member 'UWBP_SettingPopup_C::BtnNotice' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnNoticeRedDot) == 0x000318, "Member 'UWBP_SettingPopup_C::BtnNoticeRedDot' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnNoticeText) == 0x000320, "Member 'UWBP_SettingPopup_C::BtnNoticeText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnQuit) == 0x000328, "Member 'UWBP_SettingPopup_C::BtnQuit' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnRedeem) == 0x000330, "Member 'UWBP_SettingPopup_C::BtnRedeem' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnRedeemText) == 0x000338, "Member 'UWBP_SettingPopup_C::BtnRedeemText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, BtnSetting) == 0x000340, "Member 'UWBP_SettingPopup_C::BtnSetting' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, ButtonBackToAdventureText) == 0x000348, "Member 'UWBP_SettingPopup_C::ButtonBackToAdventureText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, ButtonCloseText) == 0x000350, "Member 'UWBP_SettingPopup_C::ButtonCloseText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, ButtonGuideText) == 0x000358, "Member 'UWBP_SettingPopup_C::ButtonGuideText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, ButtonQuitText) == 0x000360, "Member 'UWBP_SettingPopup_C::ButtonQuitText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, ButtonSettingText) == 0x000368, "Member 'UWBP_SettingPopup_C::ButtonSettingText' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, LIActivity) == 0x000370, "Member 'UWBP_SettingPopup_C::LIActivity' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, Mask) == 0x000378, "Member 'UWBP_SettingPopup_C::Mask' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, Version) == 0x000380, "Member 'UWBP_SettingPopup_C::Version' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, WBP_GameMenu_ListPanel) == 0x000388, "Member 'UWBP_SettingPopup_C::WBP_GameMenu_ListPanel' has a wrong offset!");
static_assert(offsetof(UWBP_SettingPopup_C, ReportTimeStamp) == 0x000390, "Member 'UWBP_SettingPopup_C::ReportTimeStamp' has a wrong offset!");

}

