#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TgfGame_HeroSelectState

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TgfGame_HeroSelectState.WBP_TgfGame_HeroSelectState_C.ExecuteUbergraph_WBP_TgfGame_HeroSelectState
// 0x0018 (0x0018 - 0x0000)
struct WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Tgf_Character_Default_C*            K2Node_CustomEvent_SelectedCharacter_1;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Tgf_Character_Default_C*            K2Node_CustomEvent_SelectedCharacter;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState) == 0x000008, "Wrong alignment on WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState");
static_assert(sizeof(WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState) == 0x000018, "Wrong size on WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState");
static_assert(offsetof(WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState, EntryPoint) == 0x000000, "Member 'WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState, K2Node_CustomEvent_SelectedCharacter_1) == 0x000008, "Member 'WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState::K2Node_CustomEvent_SelectedCharacter_1' has a wrong offset!");
static_assert(offsetof(WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState, K2Node_CustomEvent_SelectedCharacter) == 0x000010, "Member 'WBP_TgfGame_HeroSelectState_C_ExecuteUbergraph_WBP_TgfGame_HeroSelectState::K2Node_CustomEvent_SelectedCharacter' has a wrong offset!");

// Function WBP_TgfGame_HeroSelectState.WBP_TgfGame_HeroSelectState_C.OnCharacterSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGame_HeroSelectState_C_OnCharacterSelected final
{
public:
	class ABP_Tgf_Character_Default_C*            SelectedCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_HeroSelectState_C_OnCharacterSelected) == 0x000008, "Wrong alignment on WBP_TgfGame_HeroSelectState_C_OnCharacterSelected");
static_assert(sizeof(WBP_TgfGame_HeroSelectState_C_OnCharacterSelected) == 0x000008, "Wrong size on WBP_TgfGame_HeroSelectState_C_OnCharacterSelected");
static_assert(offsetof(WBP_TgfGame_HeroSelectState_C_OnCharacterSelected, SelectedCharacter) == 0x000000, "Member 'WBP_TgfGame_HeroSelectState_C_OnCharacterSelected::SelectedCharacter' has a wrong offset!");

// Function WBP_TgfGame_HeroSelectState.WBP_TgfGame_HeroSelectState_C.OnSelectEnd
// 0x0008 (0x0008 - 0x0000)
struct WBP_TgfGame_HeroSelectState_C_OnSelectEnd final
{
public:
	class ABP_Tgf_Character_Default_C*            SelectedCharacter;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TgfGame_HeroSelectState_C_OnSelectEnd) == 0x000008, "Wrong alignment on WBP_TgfGame_HeroSelectState_C_OnSelectEnd");
static_assert(sizeof(WBP_TgfGame_HeroSelectState_C_OnSelectEnd) == 0x000008, "Wrong size on WBP_TgfGame_HeroSelectState_C_OnSelectEnd");
static_assert(offsetof(WBP_TgfGame_HeroSelectState_C_OnSelectEnd, SelectedCharacter) == 0x000000, "Member 'WBP_TgfGame_HeroSelectState_C_OnSelectEnd::SelectedCharacter' has a wrong offset!");

}

