#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tgf_Skill_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "LyraGame_structs.hpp"


namespace SDK::Params
{

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.BP_InternalTick
// 0x0004 (0x0004 - 0x0000)
struct WBP_Tgf_Skill_Base_C_BP_InternalTick final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_BP_InternalTick) == 0x000004, "Wrong alignment on WBP_Tgf_Skill_Base_C_BP_InternalTick");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_BP_InternalTick) == 0x000004, "Wrong size on WBP_Tgf_Skill_Base_C_BP_InternalTick");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_InternalTick, InDeltaTime) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_BP_InternalTick::InDeltaTime' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.BP_OnBuffAdd
// 0x0018 (0x0018 - 0x0000)
struct WBP_Tgf_Skill_Base_C_BP_OnBuffAdd final
{
public:
	class UTgfGameplayEffect*                     GE;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveHandle;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         Param_RemainTime;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalTime;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_BP_OnBuffAdd) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_BP_OnBuffAdd");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_BP_OnBuffAdd) == 0x000018, "Wrong size on WBP_Tgf_Skill_Base_C_BP_OnBuffAdd");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnBuffAdd, GE) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_BP_OnBuffAdd::GE' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnBuffAdd, ActiveHandle) == 0x000008, "Member 'WBP_Tgf_Skill_Base_C_BP_OnBuffAdd::ActiveHandle' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnBuffAdd, Param_RemainTime) == 0x000010, "Member 'WBP_Tgf_Skill_Base_C_BP_OnBuffAdd::Param_RemainTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnBuffAdd, TotalTime) == 0x000014, "Member 'WBP_Tgf_Skill_Base_C_BP_OnBuffAdd::TotalTime' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.BP_OnCooldownStart
// 0x0010 (0x0010 - 0x0000)
struct WBP_Tgf_Skill_Base_C_BP_OnCooldownStart final
{
public:
	float                                         CooldownTime;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_bNeedHideDuration;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Param_HideDurationLimit;                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_BP_OnCooldownStart) == 0x000004, "Wrong alignment on WBP_Tgf_Skill_Base_C_BP_OnCooldownStart");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_BP_OnCooldownStart) == 0x000010, "Wrong size on WBP_Tgf_Skill_Base_C_BP_OnCooldownStart");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnCooldownStart, CooldownTime) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_BP_OnCooldownStart::CooldownTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnCooldownStart, TotalTime) == 0x000004, "Member 'WBP_Tgf_Skill_Base_C_BP_OnCooldownStart::TotalTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnCooldownStart, Param_bNeedHideDuration) == 0x000008, "Member 'WBP_Tgf_Skill_Base_C_BP_OnCooldownStart::Param_bNeedHideDuration' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnCooldownStart, Param_HideDurationLimit) == 0x00000C, "Member 'WBP_Tgf_Skill_Base_C_BP_OnCooldownStart::Param_HideDurationLimit' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.BP_OnGameplayAbilityEnd
// 0x0008 (0x0008 - 0x0000)
struct WBP_Tgf_Skill_Base_C_BP_OnGameplayAbilityEnd final
{
public:
	class UGameplayAbility*                       GameplayAbility;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_BP_OnGameplayAbilityEnd) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_BP_OnGameplayAbilityEnd");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_BP_OnGameplayAbilityEnd) == 0x000008, "Wrong size on WBP_Tgf_Skill_Base_C_BP_OnGameplayAbilityEnd");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnGameplayAbilityEnd, GameplayAbility) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_BP_OnGameplayAbilityEnd::GameplayAbility' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.BP_OnGERemove
// 0x0008 (0x0008 - 0x0000)
struct WBP_Tgf_Skill_Base_C_BP_OnGERemove final
{
public:
	struct FActiveGameplayEffectHandle            Param_GEHandle;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_BP_OnGERemove) == 0x000004, "Wrong alignment on WBP_Tgf_Skill_Base_C_BP_OnGERemove");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_BP_OnGERemove) == 0x000008, "Wrong size on WBP_Tgf_Skill_Base_C_BP_OnGERemove");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_BP_OnGERemove, Param_GEHandle) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_BP_OnGERemove::Param_GEHandle' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.ExecuteUbergraph_WBP_Tgf_Skill_Base
// 0x0200 (0x0200 - 0x0000)
struct WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLyraEquipmentChangeMessage            Temp_struct_Variable;                              // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLyraEquipmentChangeMessage            Temp_struct_Variable_2;                            // 0x0060(0x0008)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_CooldownTime;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TotalTime_1;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNeedHideDuration;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HideDurationLimit;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTgfGameplayEffect*                     K2Node_Event_GE;                                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            K2Node_Event_ActiveHandle;                         // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainTime;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TotalTime;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            K2Node_Event_GEHandle;                             // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ActiveGameplayEffectHandle_ReturnValue; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTgfEquipmentManagerComponent*          CallFunc_GetTgfEquipmentManagerComponent_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillCanActive_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillCanActive_ReturnValue_1;        // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_Event_GameplayAbility;                      // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillCanActive_ReturnValue_2;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillCanActive_ReturnValue_3;        // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkillCanActive_ReturnValue_4;        // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_1;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetFinalCDPercent_CDPercent;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFinalCDPercent_bShowText;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FormatCooldownTime_ReturnValue;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	double                                        CallFunc_StartCoolDown_RemainTime_ImplicitCast;    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StartCoolDown_Cool_Down_Time_ImplicitCast; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StartCoolDown_HidDurLimit_ImplicitCast;   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StartCoolDown_HidDurLimit_ImplicitCast_1; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2;   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BuffTotalTime_ImplicitCast;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2;   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3;   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FormatCooldownTime_CDTime_ImplicitCast;   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base) == 0x000200, "Wrong size on WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, EntryPoint) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_CustomEvent_ProxyObject) == 0x000008, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_CustomEvent_ActualChannel) == 0x000010, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, Temp_struct_Variable) == 0x000028, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, Temp_struct_Variable_1) == 0x000030, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, Temp_object_Variable) == 0x000038, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000040, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_IsDesignTime) == 0x000049, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_IsValid_ReturnValue_1) == 0x00004A, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, Temp_struct_Variable_2) == 0x000060, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetPayload_ReturnValue) == 0x000068, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_CooldownTime) == 0x00006C, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_CooldownTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_TotalTime_1) == 0x000070, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_TotalTime_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_bNeedHideDuration) == 0x000074, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_bNeedHideDuration' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_HideDurationLimit) == 0x000078, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_HideDurationLimit' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00007C, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000080, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_PlayAnimation_ReturnValue) == 0x000090, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_GE) == 0x000098, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_GE' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_ActiveHandle) == 0x0000A0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_ActiveHandle' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_RemainTime) == 0x0000A8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_RemainTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_TotalTime) == 0x0000AC, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_TotalTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0000B0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetObjectClass_ReturnValue) == 0x0000B8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_GEHandle) == 0x0000C0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_GEHandle' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_EqualEqual_ActiveGameplayEffectHandle_ReturnValue) == 0x0000C8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_EqualEqual_ActiveGameplayEffectHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x0000C9, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_ClassIsChildOf_ReturnValue) == 0x0000CA, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_IsValidClass_ReturnValue) == 0x0000CB, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_IsValid_ReturnValue_2) == 0x0000D8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_FClamp_ReturnValue) == 0x0000E0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetTgfEquipmentManagerComponent_ReturnValue) == 0x0000E8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetTgfEquipmentManagerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_CheckSkillCanActive_ReturnValue) == 0x0000F0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_CheckSkillCanActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000F1, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_CheckSkillCanActive_ReturnValue_1) == 0x0000F2, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_CheckSkillCanActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_GameplayAbility) == 0x0000F8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_GameplayAbility' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_CheckSkillCanActive_ReturnValue_2) == 0x000100, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_CheckSkillCanActive_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_CheckSkillCanActive_ReturnValue_3) == 0x000101, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_CheckSkillCanActive_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_CheckSkillCanActive_ReturnValue_4) == 0x000102, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_CheckSkillCanActive_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_MatchesAnyTags_ReturnValue) == 0x000103, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_MatchesAnyTags_ReturnValue_1) == 0x000104, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_MatchesAnyTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_IsValid_ReturnValue_3) == 0x000105, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000108, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000110, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000118, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000120, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_Event_InDeltaTime) == 0x000128, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x000130, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000138, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x000140, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetFinalCDPercent_CDPercent) == 0x000148, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetFinalCDPercent_CDPercent' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_GetFinalCDPercent_bShowText) == 0x000150, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_GetFinalCDPercent_bShowText' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_FormatCooldownTime_ReturnValue) == 0x000158, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_FormatCooldownTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_StartCoolDown_RemainTime_ImplicitCast) == 0x000180, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_StartCoolDown_RemainTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_StartCoolDown_Cool_Down_Time_ImplicitCast) == 0x000190, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_StartCoolDown_Cool_Down_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000198, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_StartCoolDown_HidDurLimit_ImplicitCast) == 0x0001A0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_StartCoolDown_HidDurLimit_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_StartCoolDown_HidDurLimit_ImplicitCast_1) == 0x0001A8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_StartCoolDown_HidDurLimit_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0001B0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0001B8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001C0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2) == 0x0001C8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, K2Node_VariableSet_BuffTotalTime_ImplicitCast) == 0x0001D0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::K2Node_VariableSet_BuffTotalTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2) == 0x0001D8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001E0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0001E8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3) == 0x0001F0, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0001F8, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base, CallFunc_FormatCooldownTime_CDTime_ImplicitCast) == 0x0001FC, "Member 'WBP_Tgf_Skill_Base_C_ExecuteUbergraph_WBP_Tgf_Skill_Base::CallFunc_FormatCooldownTime_CDTime_ImplicitCast' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.GetFinalCDPercent
// 0x0020 (0x0020 - 0x0000)
struct WBP_Tgf_Skill_Base_C_GetFinalCDPercent final
{
public:
	double                                        CDPercent;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowText;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_GetFinalCDPercent) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_GetFinalCDPercent");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_GetFinalCDPercent) == 0x000020, "Wrong size on WBP_Tgf_Skill_Base_C_GetFinalCDPercent");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_GetFinalCDPercent, CDPercent) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_GetFinalCDPercent::CDPercent' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_GetFinalCDPercent, bShowText) == 0x000008, "Member 'WBP_Tgf_Skill_Base_C_GetFinalCDPercent::bShowText' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_GetFinalCDPercent, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000009, "Member 'WBP_Tgf_Skill_Base_C_GetFinalCDPercent::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_GetFinalCDPercent, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Tgf_Skill_Base_C_GetFinalCDPercent::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_GetFinalCDPercent, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Tgf_Skill_Base_C_GetFinalCDPercent::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.OnMessageReceived_32922858476DF01AB3108DA239AE54DD
// 0x0010 (0x0010 - 0x0000)
struct WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD) == 0x000010, "Wrong size on WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD, ProxyObject) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD::ProxyObject' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD, ActualChannel) == 0x000008, "Member 'WBP_Tgf_Skill_Base_C_OnMessageReceived_32922858476DF01AB3108DA239AE54DD::ActualChannel' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.Play Cast Anim
// 0x0008 (0x0008 - 0x0000)
struct WBP_Tgf_Skill_Base_C_Play_Cast_Anim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_Play_Cast_Anim) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_Play_Cast_Anim");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_Play_Cast_Anim) == 0x000008, "Wrong size on WBP_Tgf_Skill_Base_C_Play_Cast_Anim");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_Play_Cast_Anim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_Play_Cast_Anim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Tgf_Skill_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Tgf_Skill_Base_C_PreConstruct");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_PreConstruct) == 0x000001, "Wrong size on WBP_Tgf_Skill_Base_C_PreConstruct");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.SetCostEnough
// 0x0002 (0x0002 - 0x0000)
struct WBP_Tgf_Skill_Base_C_SetCostEnough final
{
public:
	bool                                          CostEnough;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_SetCostEnough) == 0x000001, "Wrong alignment on WBP_Tgf_Skill_Base_C_SetCostEnough");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_SetCostEnough) == 0x000002, "Wrong size on WBP_Tgf_Skill_Base_C_SetCostEnough");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetCostEnough, CostEnough) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_SetCostEnough::CostEnough' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetCostEnough, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'WBP_Tgf_Skill_Base_C_SetCostEnough::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.SetKeyText
// 0x0030 (0x0030 - 0x0000)
struct WBP_Tgf_Skill_Base_C_SetKeyText final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_TgfGame_CommonKey_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_TgfGame_CommonKey_C*               CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_SetKeyText) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_SetKeyText");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_SetKeyText) == 0x000030, "Wrong size on WBP_Tgf_Skill_Base_C_SetKeyText");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetKeyText, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_SetKeyText::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetKeyText, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_Tgf_Skill_Base_C_SetKeyText::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetKeyText, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WBP_Tgf_Skill_Base_C_SetKeyText::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetKeyText, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000018, "Member 'WBP_Tgf_Skill_Base_C_SetKeyText::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetKeyText, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'WBP_Tgf_Skill_Base_C_SetKeyText::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetKeyText, CallFunc_AddChild_ReturnValue_1) == 0x000028, "Member 'WBP_Tgf_Skill_Base_C_SetKeyText::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.SetPriestSkillState
// 0x0004 (0x0004 - 0x0000)
struct WBP_Tgf_Skill_Base_C_SetPriestSkillState final
{
public:
	bool                                          CallFunc_CheckCostEnough_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingWeapon_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_SetPriestSkillState) == 0x000001, "Wrong alignment on WBP_Tgf_Skill_Base_C_SetPriestSkillState");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_SetPriestSkillState) == 0x000004, "Wrong size on WBP_Tgf_Skill_Base_C_SetPriestSkillState");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetPriestSkillState, CallFunc_CheckCostEnough_ReturnValue) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_SetPriestSkillState::CallFunc_CheckCostEnough_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetPriestSkillState, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_Tgf_Skill_Base_C_SetPriestSkillState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetPriestSkillState, CallFunc_IsUsingWeapon_ReturnValue) == 0x000002, "Member 'WBP_Tgf_Skill_Base_C_SetPriestSkillState::CallFunc_IsUsingWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetPriestSkillState, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_Tgf_Skill_Base_C_SetPriestSkillState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.SetSkillIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_Tgf_Skill_Base_C_SetSkillIcon final
{
public:
	class UTexture2D*                             Texture2D;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_SetSkillIcon) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_SetSkillIcon");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_SetSkillIcon) == 0x000010, "Wrong size on WBP_Tgf_Skill_Base_C_SetSkillIcon");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetSkillIcon, Texture2D) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_SetSkillIcon::Texture2D' has a wrong offset!");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_SetSkillIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Tgf_Skill_Base_C_SetSkillIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.ShowSkillCastSuccess
// 0x0008 (0x0008 - 0x0000)
struct WBP_Tgf_Skill_Base_C_ShowSkillCastSuccess final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tgf_Skill_Base_C_ShowSkillCastSuccess) == 0x000008, "Wrong alignment on WBP_Tgf_Skill_Base_C_ShowSkillCastSuccess");
static_assert(sizeof(WBP_Tgf_Skill_Base_C_ShowSkillCastSuccess) == 0x000008, "Wrong size on WBP_Tgf_Skill_Base_C_ShowSkillCastSuccess");
static_assert(offsetof(WBP_Tgf_Skill_Base_C_ShowSkillCastSuccess, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Tgf_Skill_Base_C_ShowSkillCastSuccess::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Tgf_Skill_Base.WBP_Tgf_Skill_Base_C.StartCoolDown
// 0x0070 (0x0070 - 0x0000)
struct WBP_Tgf_Skill_Base_C_StartCoolDown final
{
public:
	double                                        Cool_Down_Time;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_RemainTime;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedHideDur;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HidDurLimit;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FormatCooldownTime_ReturnValue;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	double                                        CallFunc_GetFinalCDPercent_CDPercent;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFinalCDPercent_bShowText;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
