#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wwise

#include "Basic.hpp"

#include "AkAudio_classes.hpp"
#include "AudioLinkCore_classes.hpp"


namespace SDK
{

// Class Wwise.WwiseAudioLinkComponent
// 0x0030 (0x04B0 - 0x0480)
class UWwiseAudioLinkComponent final : public UAkComponent
{
public:
	uint8                                         Pad_480[0x8];                                      // 0x0480(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseAudioLinkSettings*                Settings;                                          // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Sound;                                             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoPlay;                                         // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x04A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseAudioLinkComponent">();
	}
	static class UWwiseAudioLinkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseAudioLinkComponent>();
	}
};
static_assert(alignof(UWwiseAudioLinkComponent) == 0x000010, "Wrong alignment on UWwiseAudioLinkComponent");
static_assert(sizeof(UWwiseAudioLinkComponent) == 0x0004B0, "Wrong size on UWwiseAudioLinkComponent");
static_assert(offsetof(UWwiseAudioLinkComponent, Settings) == 0x000488, "Member 'UWwiseAudioLinkComponent::Settings' has a wrong offset!");
static_assert(offsetof(UWwiseAudioLinkComponent, Sound) == 0x000490, "Member 'UWwiseAudioLinkComponent::Sound' has a wrong offset!");
static_assert(offsetof(UWwiseAudioLinkComponent, bAutoPlay) == 0x000498, "Member 'UWwiseAudioLinkComponent::bAutoPlay' has a wrong offset!");
static_assert(offsetof(UWwiseAudioLinkComponent, AudioComponent) == 0x0004A0, "Member 'UWwiseAudioLinkComponent::AudioComponent' has a wrong offset!");

// Class Wwise.WwiseAudioLinkSettings
// 0x0058 (0x0090 - 0x0038)
class UWwiseAudioLinkSettings final : public UAudioLinkSettingsAbstract
{
public:
	TSoftObjectPtr<class UAkAudioEvent>           StartEvent;                                        // 0x0038(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldClearBufferOnReceipt;                       // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProducerToConsumerBufferRatio;                     // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialSilenceFillRatio;                           // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x14];                                      // 0x0074(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          StartEventResolved;                                // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseAudioLinkSettings">();
	}
	static class UWwiseAudioLinkSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseAudioLinkSettings>();
	}
};
static_assert(alignof(UWwiseAudioLinkSettings) == 0x000008, "Wrong alignment on UWwiseAudioLinkSettings");
static_assert(sizeof(UWwiseAudioLinkSettings) == 0x000090, "Wrong size on UWwiseAudioLinkSettings");
static_assert(offsetof(UWwiseAudioLinkSettings, StartEvent) == 0x000038, "Member 'UWwiseAudioLinkSettings::StartEvent' has a wrong offset!");
static_assert(offsetof(UWwiseAudioLinkSettings, bShouldClearBufferOnReceipt) == 0x000068, "Member 'UWwiseAudioLinkSettings::bShouldClearBufferOnReceipt' has a wrong offset!");
static_assert(offsetof(UWwiseAudioLinkSettings, ProducerToConsumerBufferRatio) == 0x00006C, "Member 'UWwiseAudioLinkSettings::ProducerToConsumerBufferRatio' has a wrong offset!");
static_assert(offsetof(UWwiseAudioLinkSettings, InitialSilenceFillRatio) == 0x000070, "Member 'UWwiseAudioLinkSettings::InitialSilenceFillRatio' has a wrong offset!");
static_assert(offsetof(UWwiseAudioLinkSettings, StartEventResolved) == 0x000088, "Member 'UWwiseAudioLinkSettings::StartEventResolved' has a wrong offset!");

}

